Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/indexed_search/pi/locallang.xlf
Languages: ru

# default_search_word_entry
source: Search for
ru: Искать:

# submit_button_label
source: Search
ru: Поиск

# opt_type_0
source: Distinct word
ru: Отдельное слово

# opt_type_1
source: Part of word
ru: Часть слова

# opt_type_2
source: First part of word
ru: Первая часть слова

# opt_type_3
source: Last part of word
ru: Последняя часть слова

# opt_type_10
source: Sounds like
ru: Похоже по звучанию

# opt_type_20
source: Sentence
ru: Предложение

# opt_defOp_0
source: All words (AND)
ru: Все слова (И)

# opt_defOp_1
source: Any words (OR)
ru: Любое слово (ИЛИ)

# opt_sections_0
source: Whole site
ru: Весь сайт

# opt_sections_-1
source: Only this page
ru: Только эта страница

# opt_sections_-2
source: Top + level 1
ru: Главная страница и один подуровень

# opt_sections_-3
source: Level 2 and out
ru: Второй уровень и ниже

# opt_freeIndexUid_-1
source: All, mixed
ru: Все, одним списком

# opt_freeIndexUid_-2
source: All, categorized
ru: Все, по категориям

# opt_freeIndexUid_0
source: Pages
ru: Страницы

# opt_freeIndexUid_header_-1
source: Mixed categories
ru: Смешанные категории

# opt_freeIndexUid_header_0
source: Website Pages
ru: Страницы веб-сайта

# opt_media_-1
source: All media
ru: Во всех видах информации

# opt_media_0
source: Internal pages
ru: Во внутренних страницах

# opt_media_-2
source: All External
ru: Во внешних страницах

# opt_order_rank_flag
source: Weight/Frequency
ru: Весу/Частоте

# opt_order_rank_freq
source: Frequency
ru: Частоте

# opt_order_rank_first
source: Close to top
ru: Расположению ближе к началу

# opt_order_rank_count
source: Number of words
ru: Количеству слов

# opt_order_mtime
source: Date Modified
ru: Дате изменения

# opt_order_title
source: Document title
ru: Названию документа

# opt_order_crdate
source: Creation date
ru: Дате создания

# opt_group_sections
source: Section hierarchy
ru: Древовидно

# opt_group_flat
source: Flat list
ru: Плоским списком

# opt_lang_-1
source: All languages
ru: На всех языках

# opt_lang_0
source: Default
ru: На основном языке

# opt_desc_0
source: Highest first
ru: по убыванию

# opt_desc_1
source: Lowest first
ru: по возрастанию

# opt_RL1
source: Level 1:
ru: 1-ый уровень:

# opt_RL1ALL
source: All pages on level 1
ru: Все страницы на 1-ом уровне:

# opt_RL2
source: - Level 2:
ru: - уровень 2:

# opt_RL2ALL
source: - All pages on level 2
ru: - все страницы на 2-ом уровне

# form_legend
source: Search form
ru: Форма поиска

# form_searchFor
source: Search for:
ru: Найти:

# form_extResume
source: Extended resume
ru: расширенное описание

# form_atATime
source: at a time
ru: Результатов на странице

# form_orderBy
source: Order by:
ru: Упорядочить по:

# form_fromSection
source: From section:
ru: От записи:

# form_freeIndexUid
source: Category:
ru: Категория:

# form_searchIn
source: Search in:
ru: Искать:

# form_match
source: Match:
ru: Совпадает:

# form_style
source: Style:
ru: Стиль:

# rules_header
source: Rules:
ru: Правила:

# rules_text
source: Only words with 2 or more characters are accepted Max 200 chars total Space is used to split words, "" can be used to search for a whole string (not indexed search then) AND, OR and NOT are prefix words, overruling the default operator +/|/- equals AND, OR and NOT as operators. All search words are converted to lowercase.
ru: Поиск осуществляется только по словам с двумя и более буквами. Поисковая фраза может содержать до 200 символов. Слова разделяются пробелом, кавычки "" могут использоваться для поиска точного соответствия. Слова AND, OR и NОТ являются операторами. Их можно вставлять перед словами, чтобы получить более точные результаты поиска. Символы + | - соответствуют операторам AND, OR или NOT. Поиск не учитывает регистр символов.

source: Search for
ru: Искать:

# searchFor_or
source: or
ru: или

# searchFor_and
source: and
ru: и

# searchFor_butNot
source: but not
ru: но не

# noResults
source: NO results found.
ru: Нет результатов.

# inSection
source: in the section
ru: в секции

# inNsection
source: in %s section:
ru: в %s секции:

# inNsections
source: in %s sections:
ru: в %s секциях:

# word_page
source: page
ru: страница

# word_pages
source: pages
ru: страницы

# unnamedSection
source: Other
ru: Другие

# link_regularSearch
source: Regular search
ru: Обычный поиск

# link_advancedSearch
source: Advanced search
ru: Расширенный поиск

# res_path
source: Path:
ru: Путь:

# res_modified
source: Modified:
ru: Изменен:

# res_created
source: Created:
ru: Создан:

# res_size
source: Size:
ru: Размер:

# res_noResume
source: Note: This search hit may not accurately match the content on this page. The page resume cannot be shown.
ru: Примечание: результат поиска может не совпадает с содержимым страницы.

# res_otherMatching
source: Other matching pages in the same document:
ru: Другие найденные страницы в том же документе:

# res_otherPageAsWell
source: INFO: There was another page indexed as well... Probably indexed with another or no usergroup.
ru: Примечание: индексирована также другая страница... Вероятно, индексация прошла в другой группе пользователей.

# res_memberGroups
source: Require membership of group numbers %s
ru: Только для членов групп %s

# pi_list_browseresults_prev
source: < Previous
ru: < Назад

# pi_list_browseresults_page
source: Page
ru: Cтраница

# pi_list_browseresults_next
source: Next >
ru: Вперёд >

# pi_list_browseresults_display
source: Displaying results ###TAG_BEGIN###%s to %s###TAG_END### out of ###TAG_BEGIN###%s###TAG_END###
ru: Результаты ###TAG_BEGIN###%s-%s###TAG_END### из ###TAG_BEGIN###%s###TAG_END###

# local_operator_AND
source: AND
ru: И

# local_operator_OR
source: OR
ru: ИЛИ

# local_operator_NOT
source: NOT
ru: НЕ

# makerating_addToCurrentSearch
source: Add to current search words
ru: Добавить слова в этот поисковый запрос

# maketitle_matches
source: matches
ru: Соответствия

# pi_wizard_title
source: Indexed Search
ru: Поиск

# pi_wizard_description
source: Search based on a database stored index.
ru: Поиск на основе индекса, хранимого в базе данных.
