Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/RemoveFormat/*.locallang.xlf
Languages: it, ru

source: All
it: Tutto
ru: Все

# All HTML:
source: All HTML tags:
it: Tutti i tag HTML:
ru: Все теги HTML:

source: Cancel
it: Annulla
ru: Отмена

source: Cleaning Area
it: Area Pulitura
ru: Область для очистки

# Cleaning options
source: Type(s) of format to remove
it: Tipo di formattazione da rimuovere
ru: Тип удаляемого форматирования

# Formatting:
source: HTML Format:
it: Formattazione HTML:
ru: Форматирование HTML:

source: Images:
it: Immagini:
ru: Изображения:

# MS Word Formatting:
source: MS Word Format:
it: Formattazione MS Word:
ru: Форматирование MSWord:

source: OK
ru: ОК

# Remove formatting
source: Remove format
it: Rimuovi formattazione
ru: Удалить форматирование

# RemoveFormatTooltip
source: Remove format
it: Rimuovi formattazione
ru: Удалить форматирование

# Selection
source: Selected text
it: Selezione
ru: Выделение

# Select the type of formatting you wish to remove.
source: Select the type(s) of format to remove.
it: Seleziona il tipo di formattazione da rimuovere.
ru: Выберите тип удаляемого форматирования.

# Spaces
source: Non-breaking spaces:
ru: Неразрывные пробелы:

source: Typographical punctuation:
ru: Типографская пунктуация:
