Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/*.locallang_csh_abbreviation.xlf
Languages: ru

# acronym.description
source: Enter the short form of the term.
ru: Введите краткую форму термина.

# .description
source: An 'Abbreviation' associates a short form to a given term. The abbreviation may be defined for a specific language.
ru: "Аббревиатура" - это сокращенная форма определенного термина. Аббревиатура может употребляться в определенном языке.

# .details
source: Defined abbreviations are used in the htmlArea RTE Abbreviation dialogue. A defined abbreviation may further be configured so as to be made available only when editing content in a given language.
ru: Указанные аббревиатуры используются в диалоге сокращений htmlArea RTE. Кроме того, аббревиатуры можно настроить для использования при редактировании содержимого лишь на определенном языке.

# endtime.description
source: Enter a date and time at which you want the abbreviation to stop being available to non-admin users. If no time is specified, the abbreviation is indefinitely available to the users of the RTE, unless it is hidden.
ru: Введите дату и время, начиная с которых аббревиатура станет недоступной для пользователей не администраторов. Если время не определено, не скрытые аббревиатуры остаются доступными для пользователей RTE неопределенное время.

# hidden.description
source: Check this option if you wish to disable the availability of this entry to non-admin users.
ru: Включите этот параметр, если нужно ограничить доступ к этой записи для не администраторов.

# starttime.description
source: Enter a time at which you want the abbreviation to start being available to non-admin users. If no time is specified, the abbreviation becomes immediately available to the users of the RTE, if not hidden.
ru: Введите время, начиная с которого аббревиатура станет доступной для пользователей не администраторов. Если время не определено, не скрытые аббревиатуры становятся доступными для пользователей RTE сразу же.

# static_lang_isocode.description
source: Select the language for which the abbreviation is defined.
ru: Выберете язык, для которого определена аббревиатура.

# static_lang_isocode.details
source: The selected language will be used as the value of the language attribute of the HTML element inserted in the content element by the RTE.
ru: Выбранный язык будет использоваться в качестве значения атрибута language в элементе HTML, вставленном в элемент содержимого через RTE.

# sys_language_uid.description
source: Select the language of content elements in which the abbreviation may be used.
ru: Выберете язык элементов содержимого, на котором может использоваться аббревиатура.

# term.description
source: Enter the term to be abbreviated.
ru: Введите сокращаемый термин.

# type.description
source: Select the type of abbreviation.
ru: Выберете тип сокращения.

# type.details
source: A defined abbreviation may be of two types: abbreviation or acronym. These correspond to HTML elements abbr and acronym. Note however that acronym is deprecated in recent versions of HTML.
ru: Указываемые аббревиатуры могут быть двух типов: аббревиатура или акроним. Это соответствует двум элементам HTML – abbr и acronym. Обратите внимание, что акронимы не употребляются в последних версиях HTML.
