Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/*.locallang_csh.xlf
Languages: ru

# beUserSettings.alttitle
source: BE User settings
ru: Настройки внутреннего пользователя

# beUserSettings.description
source: BE User settings let you specify some options of the RTE.
ru: Некоторые параметры редактора можно настроить для конкретных пользователей.

# rteHeight.alttitle
source: Default height of the RTE in px
ru: Высота редактора в пикселях по умолчанию

# rteHeight.description
source: This option lets you specify the initial height of the RTE.
ru: Этот параметр позволяет назначить начальную высоту окна редактора.

# rteHeight.details
source: The option specifies the height of the RTE when it is initially displayed. The height of the RTE must be specified as a fixed number of pixels not as a percentage. The value you set should allow sufficient height for the tool bar, the editing area and the status bar of the RTE.
ru: Параметр определяет высоту редактора при начальном его отображении. Высота определяется в пикселях, а не в процентах. Определенная высота должна учитывать панель инструментов, область редактирования и панель статуса редактора.

# rteMaxHeight.description
source: The value you set should allow sufficient height for the tool bar, the editing area and the status bar of the RTE. Default value is 2000.
ru: Параметр определяет максимально возможную высоту редактора, включая панель инструментов, область редактирования и панель статуса редактора. По умолчанию - 2000 пикселей.

# rteResize.alttitle
source: Make RTE resizable
ru: Возможность изменения размеров редактора

# rteResize.description
source: This option will make RTE-enabled fields resizable. A resize handle will appear at the bottom right corner of the RTE.
ru: Параметр позволяет изменять размеры поля для редактора. Изменять размер можно при помощи правого нижнего поля редактора.

# rteWidth.alttitle
source: Default width of the RTE in px or %
ru: Ширина редактора в пикселях или % по умолчанию

# rteWidth.description
source: This option lets you specify the initial width of the RTE.
ru: Этот параметр позволяет назначить начальную ширину окна редактора.

# rteWidth.details
source: The option specifies the width of the RTE when it is initially displayed. The width may be specified as a fixed number of pixels or as a percentage.
ru: Параметр определяет ширину редактора при начальном его отображении. Ширина определяется в пикселях или в процентах.
