Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/css_styled_content/*.locallang_db.xlf
Languages: it

# tt_content.tx_cssstyledcontent_acctables
source: Accessibility
it: Accessibilità

# tt_content.tx_cssstyledcontent_acctables_caption
source: Table Caption
it: Didascalia tabella (<caption>)

# tt_content.tx_cssstyledcontent_acctables_headerpos
source: Table Header Position
it: Posizione dell'Header della tabella

# tt_content.tx_cssstyledcontent_acctables_headerpos.I.0
source: No header
it: Nessun header

# tt_content.tx_cssstyledcontent_acctables_headerpos.I.1
source: Top
it: Cima

# tt_content.tx_cssstyledcontent_acctables_headerpos.I.2
source: Left
it: Sinistra

# tt_content.tx_cssstyledcontent_acctables_nostyles
source: No CSS styles for this table
it: Nessuno stile CSS per questa tabella

# tt_content.tx_cssstyledcontent_acctables_summary
source: Table Summary
it: Sommario tabella (attributo "summary" nel tag <table>)

# tt_content.tx_cssstyledcontent_acctables_tableclass
source: Additional CSS Class
it: Classe CSS per questa tabella

# tt_content.tx_cssstyledcontent_acctables_tfoot
source: Use Table Footer (wrap last row with <tfoot> tags)
it: Usa table-footer (<tfoot>) nell'ultima riga

# tt_content.tx_cssstyledcontent_tableparsing
source: CSV parsing
it: Parsing dati CSV

# tt_content.tx_cssstyledcontent_tableparsing_delimiter
source: Field Delimiter
it: Delimitatore dei campi

# tt_content.tx_cssstyledcontent_tableparsing_delimiter_colon
source: : (Colon)
it: : [due punti]

# tt_content.tx_cssstyledcontent_tableparsing_delimiter_comma
source: , (Comma)
it: , [Virgola]

# tt_content.tx_cssstyledcontent_tableparsing_delimiter_semicolon
source: ; (Semicolon)
it: ; [punto e virgola]

# tt_content.tx_cssstyledcontent_tableparsing_quote
source: Text Delimiter
it: Delimitatore del testo

# tt_content.tx_cssstyledcontent_tableparsing_quote_double
source: " (Double quotes)
it: " [Doppie virgolette]

# tt_content.tx_cssstyledcontent_tableparsing_quote_none
source: None
it: Nessuno

# tt_content.tx_cssstyledcontent_tableparsing_quote_single
source: ' (Single quotes)
it: ' [singolo apice]
