Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/felogin/pi1/*.locallang.xlf
Languages: it

# change_password
source: Change your password
it: Cambiare password

# cookie_warning
source: Warning: There is a possibility that cookies are not enabled in your web browser! If your login disappears on your next click that is the case and you should enable cookies (or accept cookies from this website) immediately!
it: Attenzione: è probabile che il tuo browser non abbia i cookies abilitati! Se il messaggio di avvenuto login scompare nella prossima pagina che visiterai, allora devi abilitare (o accettare) i cookies provenienti da questo sito.

# ll_change_password_done_message
source: Your password has been saved. You can now login with your new password.
it: La vostra password è stata salvata. Ora potete effettuare il login con la nuova password.

# ll_change_password_header
source: Change your password
it: Cambiare password

# ll_change_password_message
source: Please enter your new password twice. Password needs a minimum length of %s chars.
it: Inserire la password due volte. La password deve avere un minimo di %s caratteri.

# ll_change_password_nolinkprefix_message
source: Error: there is no prefix for the link. Please set one of the following in your typoscript template: plugin.tx_felogin_pi1.feloginBaseURL = http://yourdomain/, config.baseURL = http://yourdomain/, config.absRefPrefix = /
it: Errore: non c'è prefisso per il link. Configurare una delle seguenti opzioni nel template Typoscript: plugin.tx_felogin_pi1.feloginBaseURL = http://yourdomain/, config.baseURL = http://yourdomain/, config.absRefPrefix = /

# ll_change_password_notequal_message
source: The passwords are not equal, please enter your new password twice. Password needs a minimum length of %s chars.
it: Le due password non sono uguali, per piacere inserire la password due volte. La password deve avere un minimo di %s caratteri.

# ll_change_password_notvalid_message
source: The link you clicked is not valid. Please repeat the forgot message procedure.
it: Il link che avete cliccato non è valido. Ripetere la procedura di password dimenticata.

# ll_change_password_tooshort_message
source: The password length is too short. Please enter your new password twice. Password needs a minimum length of %s chars.
it: La password è troppo corta. Inserisci nuova mente la password due volte e con lunghezza minima di %s caratteri.

# ll_enter_your_data
source: Username or email address:
it: Username o email:

# ll_error_header
source: Login failure
it: Errore di login

# ll_error_message
source: An error occurred during login. Most likely you didn't enter the username or password correctly. Be certain that you enter them precisely as they are, including upper/lower case. Another possibility is that cookies might be disabled in your web browser.
it: Errore durante il login. Probabilmente non hai inserito correttamente lo username o la password. Assicurati di averli digitati in modo corretto, anche per quanto riguarda le lettere maiuscole/minuscole. Assicurati altresì di aver abilitato i cookies nel tuo browser.

# ll_forgot_email_nopassword
source: Your password Hi %s We couldn't find a username for this email address and so cannot send the password to you. Probably you misspelled the email address (upper/lower case makes a difference) or maybe you even didn't register yet?
it: La tua password Salve %s Nel nostro sistema non c'è alcun utente con l'indirizzo email da te indicato. Probabilmente hai specificato un email non corretto (controlla la maiuscole/minuscole), oppure non ti sei mai registrato.

# ll_forgot_email_password
source: Your password Hi %s Your username is "%s" Your password is "%s"
it: La tua password Salve %s Il tuo username è "%s" La tua password è "%s"

# ll_forgot_header
source: Forgot your password?
it: Dimenticato la password?

# ll_forgot_header_backToLogin
source: Return to login form
it: Ritorna al login

# ll_forgot_message
source: Please enter the email address by which you registered your user account. Then press "Send password" and your password will immediately be emailed to you. Make sure to spell your email address correctly.
it: Inserire l'indirizzo email con il quale vi siete registrati. Cliccate sul pulsante "Invia password" e la password vi sarà inviata immediatamente. Attenzione a scrivere l'indirizzo correttamente.

# ll_forgot_message_emailSent
source: Your password has now been sent to the email address %s
it: La vostra password è stata inviata all'indirizzo email %s

# ll_forgot_reset_message
source: Please enter your username or email address. Instructions for resetting the password will be immediately emailed to you.
it: Inserisci tuo username o email. Ti saranno spedite immediatamente le istruzioni su come resettare la password.

# ll_forgot_reset_message_emailSent
source: An email has been sent to the address stored in your account and contains a link to reset your password. If you do not receive an email, your account or email address was not found.
it: E' stata inviata all'indirizzo del vostro account una mail contenente un link per resettare la password. Se non ricevete questa email, il vostro account o indirizzo email non sono stati trovati.

# ll_forgot_reset_message_error
source: Your account or email address does not exist.
it: Il tuo account o il tuo indirizzo e-mail non esistono.

# ll_forgot_validate_reset_password
source: Your new password Dear %s, This email was sent in response to your request to reset your password. Please click on the link below. %s For security reasons, this link is only active until %s. If you do not visit the link before then, you will need to repeat the password reset steps.
it: La tua nuova password Salve %s Questa email ti è inviata in seguito alla richiesta di resettare la vostra password. Per continuare con la procedure cliccare il seguente link: %s Per ragioni di sicurezza, questo link è valido solo fino a %s. Se non visitate il link prima di tale data, dovrete ripetere la procedura di reset della password.

# ll_logout_header
source: You have logged out.
it: Hai effettuato il logout.

# ll_logout_message
source: You just logged out from your user session on this website. You can login again or as another user by the form below.
it: La tua sessione su questo sito è terminata. Puoi effettuare un nuovo login utilizzando il form sottostante.

# ll_status_header
source: Current status
it: Stato corrente

# ll_status_message
source: This is your current status:
it: Questo è il tuo stato corrente:

# ll_success_header
source: Login successful
it: Login effettuato con successo

# ll_success_message
source: You are now logged in as '###USER###'
it: Hai effettuato il login come utente '###USER###'

# ll_welcome_header
source: User login
it: Login utente

# ll_welcome_message
source: Enter your username and password here in order to log in on the website:
it: Inserire username e password per effettuare il login:

# newpassword_label1
source: Enter new password
it: Inserire nuova password

# newpassword_label2
source: Repeat new password
it: Ripetere la nuova password

# noValidRedirectUrl
source: Url "%s" for redirect was not accepted!
it: URL "%s" per il redirect non valido!

# permalogin
source: Stay logged in:
it: Mantenere il login:

source: Reset Password
it: Resettare password

source: Send password
it: Inviare password

# xssAttackDetected
source: Url "%s" contained an XSS attack and was cleaned!
it: L' URL "%s" conteneva un attacco XSS ed è stata ripulito!

source: Your email:
it: Email:
