Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/felogin/*.locallang_db.xlf
Languages: it

# felogin_forgotHash
source: Forgot hash
it: Hash dimenticato

# felogin_redirectPid
source: Redirect at Login to Page (felogin)
it: Dopo il login reindirizza alla pagina:

# tt_content.CType_pi1
source: Website User Login
it: Login utente

# tt_content.pi_flexform.error_header
source: Login Error Header
it: Titolo Errore di Login

# tt_content.pi_flexform.error_message
source: Login Error Message
it: Testo Errore di Login

# tt_content.pi_flexform.field_manualOrder
source: Using fieldlists below:
it: Usa i campi sottostanti:

# tt_content.pi_flexform.field_orderDetails
source: User Fields/details:
it: Campi Utente/dettagli:

# tt_content.pi_flexform.field_orderList
source: User Fields/list:
it: Campi Utente/lista:

# tt_content.pi_flexform.forgot_header
source: Forgot Password Header
it: Titolo Password Dimenticata

# tt_content.pi_flexform.forgot_message
source: Forgot Password Message
it: Testo Password Dimenticata

# tt_content.pi_flexform.general_header
source: General Header
it: Titolo generale:

# tt_content.pi_flexform.general_message
source: General Message
it: Testo generale:

# tt_content.pi_flexform.groupSelection
source: FE group selection:
it: Seleziona gruppi FE:

# tt_content.pi_flexform.groupSelection_noGroup
source: no group
it: nessun gruppo

# tt_content.pi_flexform.groupSelectmode
source: FE group select mode:
it: Modalità di selezione del Gruppo FE

# tt_content.pi_flexform.groupSelectmode_DontShowSelected
source: Dont show selected
it: Non mostrare selezionato

# tt_content.pi_flexform.groupSelectmode_FromTS
source: (from Typoscript)
it: (da Typoscript)

# tt_content.pi_flexform.groupSelectmode_showAll
source: Show all
it: Mostra tutto

# tt_content.pi_flexform.groupSelectmode_showSelected
source: Show selected
it: Mostra selezionato

# tt_content.pi_flexform.logout_header
source: Logout Header
it: Titolo Logout

# tt_content.pi_flexform.logout_message
source: Logout Message
it: Testo Logout

# tt_content.pi_flexform.redirectDisable
source: Disable Redirect
it: Disabilita redirect:

# tt_content.pi_flexform.redirectFirstMethod
source: Use First Supported Mode from Selection
it: Usa la prima modalità trovata:

# tt_content.pi_flexform.redirect_header
source: Redirect Header
it: Titolo Redirect:

# tt_content.pi_flexform.redirect_message
source: Redirect Message
it: Testo Redirect:

# tt_content.pi_flexform.redirectMode
source: Redirect Mode
it: Modalità Redirect (devi selezionare le opzioni, altrimenti il redirect non funzionerà)

# tt_content.pi_flexform.redirectMode.I.0
source: Defined by Usergroup Record
it: definito nel Record Gruppo Utenti

# tt_content.pi_flexform.redirectMode.I.1
source: Defined by User Record
it: definito del Record Utente

# tt_content.pi_flexform.redirectMode.I.2
source: After Login (TS or Flexform)
it: dopo il Login (TS o Flexform)

# tt_content.pi_flexform.redirectMode.I.3
source: After Logout (TS or Flexform)
it: dopo il Logout (TS o Flexform)

# tt_content.pi_flexform.redirectMode.I.4
source: After Login Error (TS or Flexform)
it: dopo Errore di Login (TS o Flexform)

# tt_content.pi_flexform.redirectMode.I.5
source: Defined by GET/POST Parameters
it: definito da variabili GET/POST

# tt_content.pi_flexform.redirectMode.I.6
source: Defined by Referrer
it: definito dal Referrer

# tt_content.pi_flexform.redirectMode.I.7
source: Defined by Domain Entries
it: definito dal record Domain

# tt_content.pi_flexform.redirectPageLogin
source: After Successful Login Redirect to Page
it: Effettuato il Login fai redirect alla pagina:

# tt_content.pi_flexform.redirectPageLoginError
source: After Failed Login Redirect to Page
it: Dopo un errore di Login fai redirect alla pagina:

# tt_content.pi_flexform.redirectPageLogout
source: After Logout Redirect to Page
it: Dopo il Logout fai redirect alla pagina:

# tt_content.pi_flexform.sheet_general
source: General
it: Generale

# tt_content.pi_flexform.sheet_messages
source: Messages
it: Messaggi

# tt_content.pi_flexform.sheet_redirect
source: Redirects
it: Opzioni redirect

# tt_content.pi_flexform.show_forgot_password
source: Display Password Recovery Link
it: Mostra link "Dimenticato la password?":

# tt_content.pi_flexform.show_logoutFormAfterLogin
source: Disable redirect after successful login, but display logout-form
it: Mostra form di logout dopo il login

# tt_content.pi_flexform.show_permalogin
source: Display Remember Login Option
it: Mostra checkbox "Mantieni login" (se abilitato nell'installazione)

# tt_content.pi_flexform.status_header
source: Status Display Header
it: Titolo Mostra Stato

# tt_content.pi_flexform.status_message
source: Status Display Message
it: Testo Mostra Stato

# tt_content.pi_flexform.success_header
source: Login Success Header
it: Titolo Login effettuato:

# tt_content.pi_flexform.success_message
source: Login Success Message
it: Testo Login effettuato:

# tt_content.pi_flexform.template_file
source: Template File
it: File Template:

# tt_content.pi_flexform.user_storage
source: User Storage Page
it: Storage Page Utenti

# tt_content.pi_flexform.welcome_header
source: Welcome Header
it: Titolo Benvenuto:

# tt_content.pi_flexform.welcome_message
source: Welcome Message
it: Testo Benvenuto:
