Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/InsertSmiley/*.locallang.xlf
Languages: ru

source: Cancel
ru: Отмена

source: Insert Smiley
ru: Вставить смайлик

# mozilla_cool
source: Cool
ru: Класс

# mozilla_cry
source: Cry
ru: Слезы

# mozilla_embarassed
source: Embarassed
ru: Смущение

# mozilla_footinmouth
source: Foot in mouth
ru: Нога в рот

# mozilla_frown
source: Frown
ru: Хмурый взгляд

# mozilla_innocent
source: Innocent
ru: Невинность

# mozilla_kiss
source: Kiss
ru: Поцелуй

# mozilla_laughing
source: Laughing
ru: Смех

# mozilla_moneyinmouth
source: Money Mouth
ru: Деньги во рту

# mozilla_sealed
source: Lips are sealed
ru: Рот на замке

# mozilla_smile
source: Smile
ru: Улыбка

# mozilla_surprised
source: Surprise
ru: Удивление

# mozilla_tongueout
source: Tongue out
ru: Язык

# mozilla_undecided
source: Undecided
ru: Нерешительность

# mozilla_wink
source: Wink
ru: Подмигнуть

# mozilla_yell
source: Yell
ru: Вопль

source: Smiley
ru: Смайлик
