Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/indexed_search/locallang_csh_indexcfg.xlf
Languages: it, ru

# .description
source: The Indexed Search configuration allows you to set up indexing of resources which are external to the TYPO3 page tree. This could be a library of records (like news), a directory structure of files (like PDFs) or an external URL to be crawled to some depth - or third-party content provided from other extensions via hooks.
it: La configurazione della ricerca indicizzata consente di impostare l'indicizzazione delle risorse che sono esterne alla struttura delle pagine TYPO3. Questo potrebbe essere una libreria di documenti (come la news), una struttura di directory di file (come PDF) o un URL esterno con indicizzazione di una certa profondità - o contenuti di terze parti forniti da altre estensioni tramite hooks.
ru: Настройка индексирующего поиска позволяет настраивать индексирование внешних, относительно дерева страниц TYPO3, ресурсов. Это может быть библиотека записей (например новости), структура файлов в папках (например PDF) или внешний URL с определенной глубиной, или стороннее содержимое из других расширений, доступное через прерывания.

# .details
source: The Indexing Configuration records are used to set up how the indexing occurs, at which time and related to which part of the page tree. An important requirement to keep in mind is that the "crawler" extension must be installed since the indexing engine uses the "crawler" extensions queue as a timing device - and using the "crawler" extension means using a cron-job to activate it from the shell.
it: I record di indicizzazione di configurazione vengono utilizzati per impostare come avviene l'indicizzazione, relativi a che periodo e a quale parte dell'albero delle pagine. Un requisito importante da tenere a mente è che l'estensione "crawler" deve essere installata in quanto il motore di indicizzazione utilizza la coda di "crawler" in modo temporizzato - e utilizzare l'estensione "crawler" significa utilizzare un cron-job per attivarla da shell.
ru: Записи настроек индексирующего поиска используются для описания процесса индексирования, его расписания и места индексирования в дереве страниц. Важное требование, которое нужно учитывать, то, что "поисковое" расширение должно быть установлено прежде чем механизм индексирования будет использовать очередь "поискового" расширения для синхронизации, ведь использование расширения "поиска" – значит использование cron-задания для активизации его из оболочки.

# title.description
source: Provide a title for the configuration.
it: Inserire un titolo per la configurazione.
ru: Название настроек.

# description.description
source: If needed, give it a description or put other important notes in this field.
it: Se necessario, inserire una descrizione o note importanti in questo campo.
ru: При необходимости, здесь можно дать описание для настроек или другую важную инфромацию.

# hidden.description
source: Disable the configuration by this checkbox. If disabled, the configuration will be bypassed by the crawlers cron job.
it: Disabilitare la configurazione tramite questo checkbox. Se disabilitata, la configurazione verrà ignorata dal cron job del crawler.
ru: Этот флажок отключает настройку. При этом настройка будет исключена при обработке cron-задания.

# hidden.details
source: Notice; Disabling the indexing process will not hide already indexed content in search results!
it: Attenzione, disabilitare il processo di indicizzazione non nasconderà i contenuti indicizzati dai risultati!
ru: Примечание. Отключения процесса индексирования не скроет уже проиндексированное содержимое из результатов поиска!

# starttime.description
source: Set a start time for the configuration. If set, the configuration will be bypassed by the crawlers cron job until this time is reached.
it: Impostare un orario di inizio per la configurazione. Se impostato, la configurazione verrà ignorata dal cron job del crawler finchè l'orario non sarà raggiunto.
ru: Время для работы настроек. Если установлено, настройки сработают через cron-задание в это время.

# timer_frequency.description
source: Use this setting to adjust how often you would like a re-indexing process to run for the configuration.
it: Utilizzare questa impostazione per determinare la frequenza del processo di reindicizzazione per la configurazione.
ru: Используйте для настройки частоты процесса индексирования для этой конфигурации.

# timer_offset.description
source: The offset adjusts at what time of day you want the indexing process to run.
it: L'offset corregge l'orario in cui si vuole che il processo di indicizzazione venga eseguito.
ru: Смещение используется для запуска процесса индексирования в определенное время суток.

# timer_next_indexing.description
source: This field contains the date and time of the next occuring indexing session. If left blank the next indexing will occur as soon as the cron-script is run again (typically within the next minute) and afterwards set to the next time according to frequency and offset.
ru: Поле содержит дату и время следующей сессии индексирования. Если оставить пустым, следующее индексирование произойдет при новом срабатывании cron-сценария (обычно в течение нескольких минут), после чего будет установлено новое время, соответственно частоте и смещению.

# type.description
source: Select the type of Indexing Configuration here.
it: Selezionare il tipo di configurazione di indicizzazione.
ru: Выберете тип настроек индексирования.

# type.details
source: <b>Records</b> - You will be able to index records on a specified page from a specified database table. You can determine which fields from that record you want to index and how additional GET parameters should look like when linking to the search result. <b>Files</b> - Allows you to index a whole directory of files from the fileadmin/ folder. You can optionally specify how many levels of recursion you want. <b>External URL</b> - Allows you to index an external site and search it from your TYPO3 installation! You can specify how deep the crawler should go on that external URL. <b>Page tree</b> - Allows you to index the page tree using the cron script. This type will not be useful as a category for searching like the other types. <b>Meta configuration</b> - Points to a collection of other indexing configurations in which the search will be done. Cannot be used for cron-job based indexing. <b>Custom</b> - Other extensions might register custom types of configurations.
it: <b>Records</ b> - Sarete in grado di indicizzare i record in una pagina specificata da una tabella di database specificato. È possibile determinare quali campi da quel record che si desidera indicizzare e come ulteriori parametri GET dovrebbe essere simile a quando si collega al risultato della ricerca. <b>File</ b> - Permette di indicizzare una intera directory di file dalla fileadmin / cartella. Facoltativamente, è possibile specificare il numero di livelli di ricorsione che si desidera. <b>URL esterno</ b> - Permette di indicizzare un sito esterno e cercatela dalla vostra installazione di TYPO3! È possibile specificare la profondità del crawler dovrebbe andare su quella URL esterno. <b>Albero delle pagine</ b> - Permette di indicizzare la pagina albero usando lo script cron. Questo tipo non sarà utile come categoria per la ricerca come gli altri tipi. <b>Meta configurazione</ b> - segnala un insieme di altre configurazioni di indicizzazione con in cui la ricerca sarà eseguita. Non può essere usato per l'indicizzazione cron-job based. <b>Personalizzato</ b> - Altre estensioni potrebbero registrare i tipi di configurazioni personalizzate.
ru: <b>Записи</b> - включение индексирования записей на определенной странице из определенной таблицы БД. Можно определить, какие поля из этой записи нужно индексировать и как должны выглядеть дополнительные GET параметры при ссылке на результаты поиска. <b>Файлы</b> - индексирование файлов в целой директории из папки fileadmin/. Дополнительно можно определить глубину вложенных папок, на которую нужно индексировать файлы. <b>Внешний URL</b> - возможность индексирования внешнего сайта и поиска на нем из текущей установки TYPO3! Можно установить глубину поиска по внешнему URL. <b>Page tree</b> - Allows you to index the page tree using the cron script. This type will not be useful as a category for searching like the other types. <b>Meta configuration</b> - Points to a collection of other indexing configurations in which the search will be done. Cannot be used for cron-job based indexing. <b>Custom</b> - Other extensions might register custom types of configurations.

# table2index.description
source: Specify the database table to index records from.
it: Specificare la tabella del database di cui indicizzare i contenuti.
ru: Определение таблицы БД для индексирования ее записей.

# alternative_source_pid.description
source: By default the indexer will select records from the page id where the Indexing Configuration is stored. If you want an alternative page as the source of your records you can enter it here.
it: Per impostazione predefinita, l'indicizzatore selezionerà i record della pagina in cui è memorizzata la configurazione di indicizzazione. Se si desidera una pagina alternativa come fonte dei record, può essere inserita qui.
ru: По умолчанию индесирование будет производиться с записями на странице с id, где сохранена настройка индексирования. Если источником записей должна служить другая страница, здесь нужно ввести ее id.

# get_params.description
source: Enter the GET parameters necessary to display the search results. You can use ###UID### as a marker in the parameter template.
it: Inserire i parametri in GET necessari per visualizzare i risultati della ricerca. Si può usare ###UID### come un marker nei template con il parametro relativo.
ru: Введите параметры GET, необходимые для отображения результатов поиска. Можно использовать ###UID### в качестве маркера в шаблоне параметров.

# get_params.details
source: Notice: The GET parameters are appended to the URL of the page where the Indexing Configuration is stored (which must be the page where a plugin exists that can display the records with the given parameters!). Example value: "&showUid=###UID###"
it: avvertenza: i parametri GET sono aggiunti all'URL della pagina dove è memorizzato la configurazione di indicizzazione (che deve essere la pagina dove esiste un plugin che può mostrare i record con il parametro specificato!). Esempio: "&showUid=###UID###"
ru: Примечание: GET параметры применяются для URL страницы с сохраненной настройкой индексирования (на которой должно находиться расширение, которое сможет отобразить записи с данными параметрами!). Пример значения: "&showUid=###UID###"

# fieldlist.description
source: Enter a comma-list of fields to be indexed. The first field name will be used for the search result title.
it: Inserire un elenco separato da virgole di campi da indicizzare. Il nome del primo campo sarà usato come titolo per il risultato della ricerca.
ru: Введите через запятую список полей, которые должны быть проиндексированы. Первое назване поля будет использовано для заголовка результатов поиска.

# fieldlist.details
source: <b>Example:</b> "header,bodytext,image_caption" would index the Header, Bodytext and Image Caption fields from "tt_content". Notice that you must use the real database field names, don't spell them wrong!
it: <b>Esempio:</b> "header,bodytext,image_caption" indicizzeranno l'Header, il Bodytext e i campi Image Caption provenienti da "tt_content". Attenzione ad usare i nomi dei campi del database correttamente!
ru: <b>Пример:</b> "header,bodytext,image_caption", будет индексироваться поля Header, Bodytext и Image Caption из "tt_content". Помните, что должны использоваться настоящие названия полей базы данных, проверьте правильность их написания!

# chashcalc.description
source: If checked, the URL in the search result for records will be encoded with a "&cHash" parameter to make it cachable. Use only if supported by the plugin!
ru: Если включено, URL результата поиска для записей будет закодирован с параметрами "&cHash" для возможности кеширования. Используйте только если поддерживается расширением!

# recordsbatch.description
source: Enter how many records to index for each instance of the indexing process (how many per minute). Default is 100 records.
it: Inserite quanti record indicizzare per ogin processo di indicizzazione (quanti per quanti minuti). Il default è 100 record.
ru: Количество записей для индексирования в каждом экземпляре процесса индексирования (количество в минуту). По умолчанию — 100 записей.

# records_indexonchange.description
source: If set, new and changed records from this table will be indexed through a hook in the core (TCEmain) meaning that they will be searchable immediately after addition to the system.
it: Se impostato, record nuovi e modificati da questa tabella verranno indicizzati tramite un hook nel core (TCEmain), il che significa che essi saranno ricercabili subito dopo l'aggiunta al sistema.
ru: Если включено, новые и изменившиеся записи из этой таблицы будут индексироваться через обработчик в ядре (TCEmain), это значит, что они будут доступны для поиска сразу после добавления в систему.

# externalUrl.description
source: Enter the URL of the external website you want to index.
it: Inserire l'URL del sito esterno da indicizzare.
ru: URL внешнего сайта, который нужно проиндексировать.

# url_deny.description
source: Enter a URL on each line inside of which the crawler should not decend.
it: Inserisci un URL su ciascuna riga all'interno del quale il crawler non dovrebbe entrare.
ru: Введите посторочно URL, на которых не нужно производить поиск.

# url_deny.details
source: Example: If you wish to index "http://typo3.org/" but not "http://typo3.org/extensions/" and "http://typo3.org/downloads/" then you simply enter those two URLs into the box like this: http://typo3.org/downloads/ http://typo3.org/extensions/
ru: Пример: Если нужно проиндексировать "http://typo3.org/", без "http://typo3.org/extensions/" и "http://typo3.org/downloads/", нужно просто ввести эти два URL в поле: http://typo3.org/downloads/ http://typo3.org/extensions/

# filepath.description
source: Enter a filepath inside fileadmin/ where you want the files to be indexed.
it: Inserisci un percorso dentro fileadmin/ dove vuoi che i file siano indicizzati.
ru: Введите путь к файлам, внутри директории fileadmin/ для индексирования находящихся в ней файлов.

# filepath.details
source: Example: "fileadmin/newsletters/"
it: Esempio: "fileadmin/newsletters/"
ru: Пример: "fileadmin/newsletters/"

# extensions.description
source: If you want to index only specific files in the directory, enter a list of file extensions here. For example: "html,pdf,doc"
it: Se si desidera indicizzare solo file specifici nella directory, inserire un elenco di estensioni di file qui. Per esempio: "html, pdf, doc"
ru: Если нужно проиндексировать лишь определенные файлы в директории, введите список расширений для этих файлов. Пример: "html,pdf,doc"

# depth.description
source: Levels of recursion.
it: Livelli di ricorsione.
ru: Количество просмотриваемых подуровней.

# depth.details
source: For file indexing it is the level of directories to decend. For External URLs it's the depth to which the crawler will go with links.
it: Per indicizzazare i file questo è il livello di directory a scendere. Per gli URL esterni è la profondità a cui il crawler andrà con i collegamenti.
ru: Для индексирования файлов, это число уровней поддиректорий для данной директории. Для внешних URL — это глубина просматриваемых уровней ссылок.

# indexcfgs.description
source: When a search is conducted in this indexing configuration the actual search will take place in the indexed content from the configurations listed here. You can also enter pages and if you do so the search will take place in indexing configurations found on those pages.
it: Quando una ricerca viene condotta in questa configurazione di indicizzazione, la ricerca attuale si svolgerà nel contenuto indicizzato da configurazioni elencate qui. È inoltre possibile inserire le pagine e se lo fate la ricerca avrà luogo in base alle configurazioni di indicizzazione trovate su queste pagine.
ru: После проведения поиска с этими настройками индексирования, фактический поиск будет проводиться по проиндексированному содержимому через сделанные здесь настройки. Также можно ввести страницы, при поиске будут задействованы настройки, найденные на них.
