Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/indexed_search/locallang_db.xlf
Languages: ru

# index_config
source: Indexing Configuration
ru: Конфигурация индексирования

# index_config.title
source: Title:
ru: Название:

# index_config.description
source: Description:
ru: Описание:

# index_config.type.I.1
source: Database Records
ru: Записи в базе данных

# index_config.type.I.2
source: Filepath on server
ru: Содержимое файлов в файловой системе сервера

# index_config.type.I.3
source: External URL
ru: Внешние URL

# index_config.type.I.4
source: Page tree
ru: Дерево страниц

# index_config.type.I.5
source: Meta configuration
ru: Мета-конфигурация

# index_config.type
source: Type:
ru: Тип:

# index_config.depth.I.0
source: Single page
ru: Одна страница

# index_config.depth.I.1
source: 1 Level
ru: 1 уровень

# index_config.depth.I.2
source: 2 Levels
ru: 2 уровня

# index_config.depth.I.3
source: 3 Levels
ru: 3 уровня

# index_config.depth
source: Depth:
ru: Глубина:

# index_config.table2index
source: Table to index:
ru: Индексируемые таблицы:

# index_config.alternative_source_pid
source: Alternative Source Page:
ru: Альтернативный страницы:

# index_config.get_params
source: GET parameter string (with ###UID### substitution):
ru: Строка параметер GET (с заменой ###UID###)

# index_config.fields
source: Fields (first is title):
ru: Поля (первое - название):

# index_config.externalUrl
source: External URL (eg. "http://www.domain.org/"):
ru: Внешний URL (например, "http://www.domain.org/"):

# index_config.chashcalc
source: Calculate cHash (force caching)?
ru: Вычислить cHash (принудительное кеширование)?

# index_config.filepath
source: Filepath:
ru: Путь к директории с нужными файлами:

# index_config.extensions
source: Limit to extensions (commalist):
ru: Индексировать только файлы с расширениями: (список через запятую)

# index_config.url_deny
source: Enter sub-URLs in which not to decend:
ru: Введите части URL-адресов, которые следует отбросить при индексировании:

# index_config.records_indexonchange
source: Index Records immediately when saved?:
ru: Индексировать записи сразу после сохранения?:

# index_config.timer_next_indexing
source: Next indexing is scheduled (if empty, then immediately):
ru: Следующее индексирование запланировано на (если не указано, то сразу):

# index_config.timer_offset
source: Timing offset from midnight:
ru: Смещение от полуночи:

# index_config.timer_frequency
source: How often would you like a re-index?:
ru: Как часто вы хотите производить переиндексацию?

# index_config.timer_frequency.I.0
source: Every hour
ru: Раз в час

# index_config.timer_frequency.I.1
source: Every day (24 hours)
ru: Раз в сутки

# index_config.timer_frequency.I.2
source: Every week
ru: Раз в неделю

# index_config.recordsbatch
source: How many records to index a minute (default is 100):
ru: Сколько записей в минуту индексировать (по умолчанию 100):

# index_config.set_id
source: Session ID (if > zero, then indexing job is running):
ru: ID сессии (если > нуля, запущено задание индексирования):

# index_config.indexcfgs
source: Indexing configurations:
ru: Конфигурация индексирования:

# index_config.parameterCfgs
source: Parameter combination configuration ([tablename]:&[param]=###UID###):
ru: Комбинация параметров конфигурации ([tablename]:&[param]=###UID###):

# index_config.rootpage
source: Root page:
ru: Корневая страница:
