Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/workspaces/Resources/Private/Language/*.locallang_db.xlf
Languages: ru

# sys_filemounts.tabs.staging
source: Staging
ru: Настройка процесса

# sys_workspace.custom_stages
source: Custom stages:
ru: Дополнительные этапы:

# sys_workspace.edit_allow_notificaton_settings
source: Allow notification settings during stage change back to edit stage
ru: Разрешить настройки уведомления о возвращении обратно на этап редактирования

# sys_workspace.edit_notification_defaults
source: Edit stage: default notification mail recipients
ru: Этап редактирования: получатели уведомлений по умолчанию

# sys_workspace.edit_notification_mode
source: Edit stage: Recipient suggestion checkboxes
ru: Этап редактирования: флажки получателя приглашения

# sys_workspace.notification_mode.0
source: All are selected per default (can be changed)
ru: Настройки по умолчанию (может быть изменено)

# sys_workspace.notification_mode.1
source: Some are selected per default (defaults cannot be unchecked)
ru: Некоторое выбрано по умолчанию (невозможно изменить настройки по умолчанию)

# sys_workspace.notification_mode.2
source: All are selected per default (cannot be changed)
ru: Настройки по умолчанию (не может быть изменено)

# sys_workspace.publish_allow_notificaton_settings
source: Allow notification settings during stage change to ready to publish
ru: Разрешить настройки уведомления о возвращении обратно на этап готовности к публикации

# sys_workspace.publish_notification_defaults
source: Ready to publish stage: default notification mail recipients
ru: Этап готовности к публикации: получатели уведомлений по умолчанию

# sys_workspace.publish_notification_mode
source: Ready to publish stage: Recipient suggestion checkboxes
ru: Этап готовности к публикации: флажки получателя предложения

# sys_workspace_stage
source: Workspace Stage
ru: Этап работы

# sys_workspace_stage.allow_notificaton_settings
source: Allow notification settings during stage change
ru: Разрешить настройки уведомления об изменении этапа

# sys_workspace_stage.default_mailcomment
source: Default mail comment:
ru: Комментарий в письмах по умолчанию:

# sys_workspace_stage.notification_defaults
source: Default notification mail recipients
ru: Получатели уведомлений по умолчанию

# sys_workspace_stage.notification_mode
source: Recipient suggestion checkboxes
ru: Флажки получателя предложения

# sys_workspace_stage.parentid
source: UID of parent record:
ru: UID родительской записи:

# sys_workspace_stage.parenttable
source: Parent table:
ru: Родительская таблица:

# sys_workspace_stage.responsible_persons
source: Responsible persons:
ru: Ответственные персоны:

# tabs.general
source: General
ru: Общее

# tabs.notification_settings
source: Notification settings
ru: Настройки уведомлений
