Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/workspaces/Resources/Private/Language/*.locallang.xlf
Languages: ru

# actionSendToStage
source: Send to stage
ru: Переслать на стадию

source: Close
ru: Закрыть

# column.actions
source: Actions
ru: Действия

# column.changeDate
source: Modification
ru: Изменение

# column.difference
source: Difference
ru: Разница

# column.stage
source: Current Stage
ru: Текущая стадия

# column.workspaceName
source: Workspace
ru: Рабочая область

# column.wsPath
source: Path
ru: Путь

# column.wsSwapColumn
source: Swap workspace
ru: Обмен рабочих областей

# column.wsTitle
source: Changed
ru: Изменено

# comments
source: User comments for <b>step {0} of stage</b> "{1}"
ru: Пользовательский комментарий для <b>шага {0} на этапе</b> "{1}"

# current_step
source: <b>Current stage step</b>: {0} (<b>{1}</b>/{2})
ru: <b>Шаг текущего этапа</b>: {0} (<b>{1}</b>/{2})

# editorInLive
source: You are in LIVE workspace. You have to select a draft workspace before you can review and publish changes.
ru: Это ОПЕРАТИВНАЯ рабочая область. Необходимо выбрать черновую рабочую область, перед тем, как станет возможным рецензировать и публиковать изменения.

# error.getStageTitle.stageNotFound
source: Stage not found
ru: Этап не найден

# error.noResponse
source: The server did not send any response whether the action was successful.
ru: Сервер не ответил об успешном выполнении действия.

# error.sendToNextStage.noRecordFound
source: The record element could not be found.
ru: Невозможно найти запись элемента.

# error.sendToPrevStage.noPreviousStage
source: The record element is already in editing stage, there is no previous stage.
ru: Запись элемента уже на стадии редактирования, а ранних этапов не существует.

# error.stageId.integer
source: StageId is supposed to be an integer
ru: ID этапа должно быть целым числом

# error.stageId.invalid
source: The stage to be used seems to be invalid and cannot be used. Please consider to use the update wizard in the install tool to fix this.
ru: Желаемый для использования этап имеет ошибки не может использоваться. Используйте мастер обновления в install tool для исправления.

# info.elementAlreadyModified
source: Element is in workspace stage "%s", modifications will send it back to "%s".
ru: Элемент находится на рабочем этапе "%s", изменения вернут его на этап "%s".

# info.newpage
source: New Page!
ru: Новая страница!

# info.newpage.detail
source: The previewed page has been created in a workspace and has no live counterpart.
ru: Просматриваемая страница была создана в рабочей области и не имеет аналога на живом сайте.

# integrity.dependsOnDefaultLanguageRecord
source: Record "%s" depends on default language record
ru: Запись "%s" зависит от записи на языке по умолчанию

# integrity.hasIssuesDescription
source: The integrity check discovered several issues, see status icons infront of each record for further details.
ru: При проверке целостности были обнаружены некоторые ошибки, смотрите значки статуса напротив каждой записи для детальной информации.

# integrity.hasIssuesQuestion
source: Do you want to continue?
ru: Настаиваете на продолжении?

# integrity.isDefaultLanguageRecord
source: Default language record for record "%s"
ru: Запись на языке по умолчанию для записи "%s"

source: item
ru: элемент

source: items
ru: элементы

# label_doaction_discard
source: Discard
ru: Удаление

# label_doaction_publish
source: Publish
ru: Публикация

# label_doaction_swap
source: Swap
ru: Обмен

# language.allLanguages
source: all languages
ru: все языки

# language.selectLanguage
source: all languages
ru: все языки

# legend.deleted
source: deleted
ru: удален

# legend.edited
source: edited
ru: отредактированный

# legend.hidden
source: hidden
ru: скрыт

# legend.label
source: Legend:
ru: Легенда:

# legend.moved
source: moved
ru: перемещен

# legend.new
source: created
ru: создан

source: Live Workspace
ru: Оперативная область

# path
source: <b>Path</b>: {0}
ru: <b>Путь</b>: {0}

source: Preview Link
ru: Ссылка на предварительный просмотр

# preview.listView
source: List view
ru: Режим списка

# preview.livePreview
source: Live
ru: В живую

# preview.livePreviewDetail
source: Click this element to hide the workspace version and see the live version of the page.
ru: Щелкните по элементу для скрытия рабочей версии и просмотра живой версии страницы.

# preview.modeHbox
source: Horizontal
ru: Горизонтальный

# preview.modeSlider
source: Slider
ru: Слайдер

# preview.modeVbox
source: Vertical
ru: Вертикальный

# preview.visualPreview
source: Visual preview
ru: Визуальный просмотр

# preview.workspacePreview
source: Workspace
ru: Рабочая область

# preview.workspacePreviewDetail
source: Click this element to hide the live version and see the workspace version of the page.
ru: Щелкните по элементу для скрытия живой версии и просмотра рабочей версии страницы.

# publish_execute_action_option
source: Publish to LIVE
ru: Публиковать В ЖИВУЮ

source: Records to display
ru: Отображение записей

source: review and publish
ru: рецензия и публикация

source: Row details...
ru: Подробнее...

# runMassAction.done
source: Done processing %d elements
ru: Обработано %d элементов

# runMassAction.init
source: init
ru: инициализация

# stage
source: Stage {0}
ru: Этап {0}

# status.error
source: Error
ru: Ошибки

# status.info
source: Information
ru: Информация

# status.warning
source: Warning
ru: Предупреждение

# title
source: Workspaces
ru: Рабочие области

# tooltip.affectWholeWorkspace
source: Please note that this will affect all changes in the current workspace, which may be more than you are currently seeing on your screen.
ru: Обратите внимание, что это затронет все изменения, сделанные в текущей рабочей области, их может быть больше, чем видно на экране.

# tooltip.discardAll
source: Do you really want to discard changes from the whole workspace?
ru: Подтверждаете отмену изменений во всей рабочей области целиком?

# tooltip.discardSelected
source: Really discard changes of the selected elements?
ru: Подтверждаете отмену изменений в выбранных элементах?

# tooltip.discardVersion
source: Discard workspace version of record.
ru: Отменить версию записи в рабочей области.

# tooltip.editElementAction
source: Edit element
ru: Править элемент

# tooltip.openPage
source: Open version of page
ru: Открыть версию страницы

# tooltip.publishAll
source: Really publish entire workspace?
ru: Подтверждаете публикацию рабочей области целиком?

# tooltip.publishSelected
source: Really publish selected elements?
ru: Подтверждаете публикацию выбранных элементов?

# tooltip.sendToNextStage
source: Send record to next Stage
ru: Отправить запись на следующий этап

# tooltip.sendToPrevStage
source: Send record to previous Stage
ru: Отправить запись на предыдущий этап

# tooltip.showHistory
source: Show history of workspace version
ru: Показать историю версий рабочей области

# tooltip.swap
source: Swap live and workspace versions of record
ru: Обменять оперативную и рабочую версии записи

# tooltip.swapAll
source: Really swap entire workspace?
ru: Подтверждаете обмен рабочей области целиком?

# tooltip.swapSelected
source: Really swap selected elements?
ru: Подтверждаете обмен выбранных элементов?

# tooltip.viewElementAction
source: Preview element
ru: Просмотр элемента

# warning.oldStyleWorkspaceInUser
source: It seems that you're still using old-style workspace. Please use the update scripts in the TYPO3 Install Tool to run the necessary updates. If you continue using this module without migrating your workspace you might loose data.
ru: Похоже, что используется устаревшая рабочая область. Воспользуйтесь сценарием обновления в TYPO3 Install Tool для внесения необходимых изменений. Если продолжить использование этого модуля без обновления, то можно потерять все данные из рабочей области.

# window.discardAll.message
source: Do you really want to discard all versions from page?
ru: Подтверждаете отмену всех версий на странице?

# window.discardAll.title
source: Discard all workspace version of current page.
ru: Отменить все рабочие версии текущей страницы.

# window.discard.message
source: Do you really want to discard this version from workspace?
ru: Подтверждаете отмену этой версии из рабочей области?

# window.discard.title
source: Discard workspace version of record.
ru: Отменить версию записи в рабочей области.

# window.massAction.title
source: Prepare to start mass action
ru: Подготовка к групповому действию

# window.selectionAction.title
source: Prepare to execute actions on selection
ru: Подготовка к выполнению действий над выбранным

# window.sendToNextStageWindow.additionalRecipients
source: Additional recipients
ru: Дополнительные получатели

# window.sendToNextStageWindow.comments
source: Comments
ru: Комментарии

# window.sendToNextStageWindow.itemsWillBeSentTo
source: The selected element(s) will be sent to
ru: Выбранный(е) элемент(ы) будут направлены на

# window.sendToNextStageWindow.sendMailTo
source: Send mail to
ru: Отправить письмо

# window.swap.message
source: Do you really want to swap this version?
ru: Подтверждаете обмен этой версии?

# window.swap.title
source: Swap version
ru: Обмен версий

source: Workspace List
ru: Список рабочих областей

source: Workspace version
ru: Версия области
