Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/reports/reports/*.locallang.xlf
Languages: ru

# status_adminUserAccount
source: Admin User Account
ru: Учетная запись администратора

# status_configuration
source: Configuration
ru: Настройка

# status_configuration_DeprecationLog
source: Deprecation Log
ru: Журнал осуждаемых параметров

# status_configuration_DeprecationLogDeletedSuccessful
source: The deprecation log file was successfully deleted.
ru: Файл журнала осуждаемых функций был удален.

# status_configuration_DeprecationLogDeleteLink
source: Delete deprecation log file.
ru: Удалить файл журнала осуждаемых функций.

# status_configuration_DeprecationLogDeletionFailed
source: The deprecation log file could not be deleted!
ru: Файл журнала осуждаемых функций невозможно удалить!

# status_configuration_DeprecationLogEnabled
source: The deprecation log tracks whether old APIs are being used in extensions. Depending on the extensions you use and whether they use deprecated APIs it can happen that the log takes up quite some space over time. The more space it takes up, the more it may affect your installation's performance. It is recommended to disable deprecation log in production environments.
ru: Журнал осуждаемых параметров отслеживает использование устаревших API в расширениях. В зависимости от используемых вами расширений и их кода, в котором используются устаревшие API, сообщения в журнале могут занять немного места. Если же в журнал записывается большое количество сообщений, то это может сказаться на производительности сервера. На работающем сайте рекомендуется отключить журналирование осуждаемых параметров.

# status_configuration_DeprecationLogFile
source: You can find the deprecation log file at %s.
ru: Файл журнала осуждаемых сообщений находиться в %s.

# status_configuration_DeprecationLogSize
source: Your deprecation log file currently takes up %s.
ru: Файл журнала осуждаемых сообщений на данный момент занимает %s.

# status_configuration_PhpMagicQuotesGpcEnabled
source: PHP INI setting magic_quotes_gpc "On" is deprecated since PHP 5.3. You are advised to set it to "Off" until it gets completely removed.
ru: Настройка в PHP INI magic_quotes_gpc "On" устарела начиная с PHP 5.3. Хорошо было бы установить ее на "Off" пока она не будет полностью удалена.

# status_configuration_PhpSafeModeEnabled
source: PHP INI setting safe_mode "On" is deprecated since PHP 5.3 and is not supported by TYPO3 anymore.
ru: Директива PHP INI safe_mode "On" не рекомендуется к использованию начиная с версии PHP 5.2 и отменена в PHP 5.3, поэтому более не должна применяться.

# status_connectionFailed
source: Connection Failed
ru: Невозможно подключиться

# status_contentAdapterActive
source: Content Adapter is active
ru: Активен адаптер содержимого

# status_contentAdapterActiveMessage
source: The Install Tool option [FE][activateContentAdapter] is active to provide compatibility with TypoScript from TYPO3 4.x regarding file handling. This has quite an impact on the performance of frontend rendering. Change TypoScript to support FAL in handling files and disable the setting to increase performance.
ru: Включен параметр Install Tool [FE][activateContentAdapter] для обеспечения совместимости с TypoScript из TYPO3 4.x относительно обработки файлов. Это слегка сказывается на производительности внешнего интерфейса. Измените TypoScript для поддержки FAL при обработке файлов и отключите этот параметр для улучшения производительности.

# status_CreatedDirectoryPermissions
source: Permissions of created directories
ru: Разрешения для создаваемых директорий

# status_CreatedFilePermissions
source: Permissions of created files
ru: Разрешения для создаваемых файлов

# status_disabled
source: Disabled
ru: Отключено

# status_empty
source: Empty
ru: Пусто

# status_enabled
source: Enabled
ru: Включено

# status_enabledPermanently
source: Enabled permanently
ru: Постоянно включено

# status_enabledTemporarily
source: Enabled temporarily
ru: Временно включено

# status_encryptionKey
source: Encryption Key
ru: Ключ шифрования

# status_fal
source: File Abstraction Layer
ru: Слой абстрагирования файлов

# status_fileDenyPattern
source: File Deny Pattern
ru: Шаблон запрещенных файлов

# status_htaccessUploadProtection
source: .htaccess Upload Protection
ru: Защита загрузки .htaccess

# status_insecure
source: Insecure
ru: Небезопасно

# status_installEnabledTemporarily
source: The Install Tool is temporarily enabled. Delete the file "%s" when you have finished setting up TYPO3. If not used the Install Tool will be disabled automatically in %s minutes.
ru: Инструмент установки временно включен. Удалите файл "%s" по окончании настройки TYPO3. Если инструментом установки не будут пользоваться, то он будет отключен автоматически через %s минут.

# status_installTool
source: Install Tool
ru: Инструментарий установки

# status_installToolPassword
source: Install Tool Password
ru: Пароль к инструментарию установки

# status_memcachedConfiguration
source: Memcached Configuration
ru: Настройка буферизации памяти

# status_missingFiles
source: Files flagged as missing
ru: Файлы отмечены как отсутствующие

# status_missingFilesMessage
source: These files are flagged as missing. Restore the files and run the indexer to reset the missing flag.
ru: Файлы отмечены как отсутствующие. Восстановите файлы и перезапустите индексацию для сброса флага отсутствия.

# status_none
source: None
ru: Нет

# status_ok
source: OK
ru: ОК

# status_oldXclassUsage
source: Old XCLASS method used
ru: Используется устаревший метод XCLASS

# status_oldXclassUsageFound
source: Old XCLASS method is used in %d cases:
ru: Используется устаревший метод XCLASS в %d случаях:

# status_oldXclassUsageFound_message
source: The old XCLASS registration does not work since TYPO3 CMS version 6.0. This is not necessarily a bad thing, the registration might be done by an extension author to keep compatibility with older TYPO3 CMS versions. Please check the affected extension for TYPO3 CMS 6.0 compatibility to verify whether this is a problem for you.
ru: Устаревший подход регистрации XCLASS не работает с TYPO3 CMS 6.0. Это не значит, что это плохо. Поддержка XCLASS может служить совместимости с более старыми версиями TYPO3 CMS. Пожалуйста, проверьте расширение на совместимость с TYPO3 CMS 6.0.

# status_phpMemory
source: PHP Memory Limit
ru: Ограничения памяти PHP

# status_phpMemoryContactAdmin
source: Contact your system administrator or hosting provider for assistance with increasing your PHP memory limit.
ru: Попросите системного администратора или провайдера хостинга об увеличении доступной для PHP памяти.

# status_phpMemoryEditLimit
source: Increase the memory limit by editing the memory_limit parameter in the file %s and then restart your web server (or contact your system administrator or hosting provider for assistance).
ru: Увеличьте ограничение к памяти, отредактировав параметр memory_limit в файле %s и перезапустите сервер (или попросите об этом системного администратора или провайдера хостинга).

# status_phpMemoryUnlimited
source: unlimited
ru: неограничено

# status_phpModules
source: PHP Modules
ru: Модули PHP

# status_phpModulesGroup
source: one of: %s
ru: один из: %s

# status_phpModulesInfo
source: You need to install and enable these modules to let TYPO3 function correctly.
ru: Для корректного функционирования TYPO3 необходимо установить указанные модули.

# status_phpModulesList
source: The following PHP module(s) is/are missing: %s.
ru: Ошибка в следующих модулях(е) PHP: %s.

# status_phpModulesMissing
source: One or more modules are missing.
ru: Один или несколько модулей с ошибкой.

# status_phpModulesPresent
source: All required modules are installed.
ru: Установлены все требуемые модули.

# status_phpPeakMemory
source: PHP peak memory usage
ru: Пиковое использование памяти в PHP

# status_phpPeakMemoryClearFlag
source: Clear this flag
ru: Сбросить флаг

# status_phpRegisterGlobals
source: PHP Register Globals
ru: Глобальные переменные регистра PHP (PHP Register Globals)

# status_phpRegisterGlobalsEnabled
source: %s is enabled. TYPO3 requires this configuration directive to be disabled.
ru: Включено %s. Для TYPO3 требуется отключить эти указания в настройке.

# status_phpRegisterGlobalsHowToChange
source: how to change configuration settings
ru: как изменить настройки

# status_phpRegisterGlobalsPHPManual
source: The PHP manual has instructions for %s.
ru: В руководстве по PHP имеются инструкции для %s.

# status_phpRegisterGlobalsSecurity
source: Your site may not be secure when %s is enabled.
ru: При включении %s, безопасность сайта может быть под угрозой.

# status_phpTooOld
source: Your PHP installation is too old.
ru: Установленная версия PHP слишком старая

# status_phpVersion
source: PHP Version
ru: Версия PHP

# status_problemNotification
source: One or more problems were detected with your TYPO3 installation. Please check the %sstatus report%s for more information.
ru: В текущей установке TYPO3 была(и) обнаружена(ы) проблема(ы). За информацией обратитесь к %sотчету по состоянию%s.

# status_referenceIndex
source: Reference Index
ru: Индекс ссылок

# status_report_description
source: Get a status report about your site's operation and any detected problems.
ru: Получение отчета о состоянии сайта и любых обнаруженных проблемах.

# status_report_explanation
source: Here you can find a short overview of your site's parameters as well as any problems detected with your installation. It may be useful to copy and paste this information into support requests filed on TYPO3's support mailinglists and project issue trackers.
ru: Здесь можно посмотреть краткий обзор параметров своего сайта, а также любых проблем обнаруженных в данной установке. Может быть полезно для копирования и вставки этой информации в запросы к поддержке TYPO3.

# status_report_title
source: Status Report
ru: Отчет о состоянии

# status_saltedPasswords
source: Backend user password hashes
ru: Хеши пароля внутреннего пользователя

# status_saltedPasswords_infoText
source: During the configuration check of saltedpasswords the following issues have been found:
ru: При проверке настройки saltedpasswords были найдены следующие проблемы:

# status_saltedPasswords_notAllPasswordsHashed
source: Some backend user passwords are found to be only md5 hashed. Run the scheduler task to convert all passwords to salted hashes.
ru: Пароли некоторых внутренних пользователей хешированы с использованием только лишь md5. Запустите в планировщике задачу преобразования всех паролей с использованием salted хеширования.

# status_security
source: Security
ru: Безопасность

# status_system
source: System
ru: Система

# status_typo3
source: TYPO3 System
ru: Система TYPO3

# status_updateComplete
source: Update Complete
ru: Обновление завершено

# status_updateIncomplete
source: Update Incomplete
ru: Обновление не закончено

# status_updateTaskDescription
source: Runs a system status check and sends notifications if problems have been found.
ru: Запуск проверки состояния системы и отправка уведомлений о найденных проблемах.

# status_updateTask_email_issues
source: Issues
ru: Замечания

# status_updateTask_email_site
source: Site
ru: Сайт

# status_updateTask_email_subject
source: System Status Notification for site %s
ru: Система уведомлений о состоянии для сайта %s

# status_updateTaskField_notificationEmail
source: Notification Email Address
ru: Адрес e-mail уведомления

# status_updateTaskField_notificationEmail_invalid
source: Empty or invalid notification email address.
ru: Пустой или неверный адрес e-mail уведомления.

# status_updateTaskField_notificationEmails
source: Notification Email Addresses (one per line)
ru: E-mail для уведомлений (один на строчку)

# status_updateTaskField_notificationEmails_invalid
source: Empty or invalid notification email addresses.
ru: Пустой или неверный адрес e-mail уведомления.

# status_updateTaskTitle
source: System Status Update
ru: Обновление статуса системы

# status_webServer
source: Web Server
ru: Веб сервер

# status_webServer_infoText
source: For your Web Server some notifications have been found:
ru: Имеется несколько замечаний относительно настроек текущего сервера:

# status_webServer_threadStackSize
source: Fluid uses complex regular expressions which require a lot of stack space during the first processing. On Windows the default stack size for Apache is a lot smaller than on unix. You can increase the size to 8MB (default on unix) by adding to the httpd.conf: <br />&lt;IfModule mpm_winnt_module&gt; <br />ThreadStackSize 8388608 <br />&lt;/IfModule&gt; <br />Restart Apache after this change.
ru: Fluid использует сложные регулярные выражения, требующие большого пространства стека при первоначальной обработке. В ОС Windows по умолчанию размер стека для Apache значительно меньше, чем в Unix. Можно увеличить этот размер до 8 МБайт (как принято по умолчанию в unix), добавив в конец файла настроек httpd.conf следующие строки: <br />&lt;IfModule mpm_winnt_module&gt; <br />ThreadStackSize 8388608 <br />&lt;/IfModule&gt; <br />После чего необходимо перезапустить Apache.

# status_xclassUsage
source: XCLASS used
ru: Используется XCLASS

# status_xclassUsageFound
source: Your system registers XCLASS
ru: Ваша система регистрирует XCLASS

# status_xclassUsageFound_message
source: XCLASS can overwrite methods or classes of the core or other extensions. This is not necessarily a bad thing, but those XCLASS might break during extension or core upgrades. You should keep an eye on extension compatibility and make sure the intended functionality is still given after updates.
ru: XCLASS может переназначить методы или классы ядра или других расширений. Это необходимость, с которой приходится мириться, при этом XCLASS может прекратить работать после обновления расширения или ядра. Необходимо помнить о совместимых расширениях и убеждаться в функциональности сайта после обновлений.
