Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/install/report/*.locallang.xlf
Languages: ru

# status_fileSystem
source: File System
ru: Файловая система

# status_writable
source: Writable
ru: Запись разрешена

# status_missingDirectory
source: Required Directory Missing
ru: Ошибка в требуемой директории

# status_nonExistingDirectory
source: Directory not existing
ru: Директория не существует

# status_recommendedWritableDirectory
source: Directory should be writable
ru: Запись в директорию должна быть разрешена

# status_requiredWritableDirectory
source: Directory not writable
ru: Директория защищена от записи

# status_directoryDoesNotExist
source: %s does not exist.
ru: %s не существует.

# status_directoryDoesNotExistCouldNotCreate
source: %s does not exist and could not be created.
ru: %s не существует и не может быть создана.

# status_directoryShouldAlsoBeWritable
source: Also note that it should be writable, if it did exist.
ru: Также помните, что при ее существовании, запись туда должна быть разрешена.

# status_directoryShouldBeWritable
source: %s should be writable.
ru: %s должна быть разрешена запись.

# status_directoryMustBeWritable
source: %s must be writable.
ru: %s должна быть разрешена запись.

# status_remainingUpdates
source: Remaining Updates
ru: Ожидает обновления
