Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/wizard_crpages/*.locallang.xlf
Languages: it

# wiz_crMany
source: Create multiple pages
it: Crea pagine multiple

# wiz_newPages
source: Create new pages
it: Crea nuove pagine

# wiz_newPages_addMoreLines
source: Add more lines
it: Aggiungi altre linee

# wiz_newPages_create
source: The pages were created!
it: Le pagine sono state create!

# wiz_newPages_currentMenu
source: New page structure
it: Nuova struttura delle pagine

# wiz_newPages_errorMsg1
source: You are not allowed to create new subpages to this page!
it: Non hai i permessi per creare sottopagine di questa pagina!

# wiz_newPages_hidePages
source: Hide new pages
it: Nascondi le pagine appena create

# wiz_newPages_hidePagesInMenus
source: Hide new pages in menus
it: Nascondi le nuove pagine nei menu

# wiz_newPages_lCreate
source: Create pages
it: Crea pagine

# wiz_newPages_lCreate_msg1
source: You're about to create many new pages. Are you sure you want to continue?
it: Stai per creare molte nuove pagine. Sei sicuro di voler continuare?

# wiz_newPages_listEnd
source: Place new pages after the existing subpages
it: Inserisci le nuove pagine dopo le sottopagine esistenti

# wiz_newPages_lReset
source: Clear fields
it: Cancella i campi

# wiz_newPages_noCreate
source: No pages were created!
it: Nessuna pagina creata!

# wiz_newPages_page
source: Page
it: Pagina
