Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/openid/Resources/Private/Language/*.Wizard.xlf
Languages: ru

source: Add OpenID
ru: Добавить OpenID

# error.cancelled
source: OpenID authentication has been cancelled.
ru: Отменена аутентификация по OpenID.

# error.general
source: Status: %s<br/>Message: %s
ru: Статус: %s<br/>Сообщение: %s

# error.no-response
source: We got no OpenID response.
ru: Мы не получили ответ OpenID.

# error.setup
source: Error setting up OpenID authentication for "%s".
ru: Ошибка настройки аутентификации OpenID для "%s".

# html.description
source: Add an OpenID to your backend user. This OpenID can then be used to log in the TYPO3 backend.
ru: Добавление OpenID для внутреннего пользователя. После этот OpenID можно использовать для авторизации в интерфейсе управления TYPO3.

# html.openid_url
source: OpenID identifier
ru: Идентификатор OpenID

# html.submit
source: Login
ru: Вход

# html.title
source: OpenID registration
ru: Регистрация OpenID

# title.error
source: Error during OpenID authentication
ru: Ошибка в процессе авторизации по OpenID

# title.success
source: OpenID authentication successful
ru: Успешная аутентификация по OpenID

# youropenid
source: OpenID is: <tt>%s</tt>
ru: OpenID: <tt>%s</tt>
