Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/BlockStyle/*.locallang.xlf
Languages: ru

source: Action items
ru: Элементы действия

# BlockStyle-Tooltip
source: Apply style to the containing block
ru: Применить стиль к блоку-контейнеру

source: Component items
ru: Элементы компонента

source: Detail
ru: Детали

# Element style
source: Block element style
ru: Стиль блочного элемента

# frame-frame1
source: Frame with grey background
ru: Область с серым фоном

# frame-frame2
source: Frame with yellow background
ru: Область с желтым фоном

source: Important
ru: Важное

source: Name of person
ru: Имя человека

# No style
source: No block style
ru: Блок без стиля

# Remove style
source: Remove block style
ru: Удалить стиль блока

# Technische Universitat Ilmenau
source: Technische Universität Ilmenau
ru: Технический университет Ильменау

# Unknown style
source: Unknown block style
ru: Неизвестный стиль блока
