Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/web_info/*.locallang.xlf
Languages: fr, it, ru

# hits_title
source: Hit Statistics
fr: Statistiques d'affichage
it: Statistiche di visita
ru: Статистика хитов

# lang_getlangsta_createNewTranslationHeaders
source: Create new translation headers
fr: Créer un nouvel en-tête d'enregistrement
it: Crea intestazione record in altra lingua
ru: Создать новый перевод заголовков

# lang_renderl10n_badThingThereAre
source: ERROR: there are two or more page overlay records for this language! Only one is allowed!
fr: ERREUR: Il y a deux enregistrements de langue pour cet enregistrement! Un seul est permis!
it: ERRORE: ci sono due o più pagine "overlay record" per questa lingua. E' consentito crearne solo una!
ru: ОШИБКА: перевод на данный язык уже существует! Разрешен только один перевод!

# lang_renderl10n_CEcount
source: Content Element Count
fr: Compteur des éléments de contenu
it: Numero di contenuti
ru: Счетчик записей

# lang_renderl10n_default
source: Default
fr: Défaut
ru: По умолчанию

# lang_renderl10n_editDefaultLanguagePage
source: Edit default language page properties
fr: Editer la langue par défaut du titre de la page
it: Modifica le proprietà della pagina per lingua di default
ru: Править заголовок страницы на основном языке

# lang_renderl10n_editLangOverlays
source: Edit all language overlay records
fr: Editer tous les enregistrements de langue
it: Modifica tutte le traduzioni
ru: Править все переводы заголовка страницы

# lang_renderl10n_editLanguageOverlayRecord
source: Edit language overlay record
fr: Editer l'enregistrement de langue
it: Modifica traduzione
ru: Править запись перевода

# lang_renderl10n_editPage
source: Edit page
fr: Editer la page
it: Modifica pagina
ru: Править страницу

# lang_renderl10n_editPageLang
source: Edit page translation
fr: Editer la traduction de la page
it: Modifica traduzioni della pagina
ru: Править перевод страницы

# lang_renderl10n_editPageProperties
source: Edit all page properties
fr: Editer toutes les propriétés de la page
it: Modifica tutte le proprietà della pagina
ru: Править все свойства страницы

# lang_renderl10n_page
source: Page
it: Pagina
ru: Страница

# lang_renderl10n_viewPage
source: View page
fr: Voir la page
it: Visualizza pagina
ru: Просмотр страницы

# lang_title
source: Localization overview
fr: Vue d'ensemble pour la localisation
it: Anteprima della localizzazione
ru: Обзор локализации

source: Page information
fr: Information sur la page
it: Informazioni sulla pagina
ru: Информация о странице

# pages_0
source: Basic settings
fr: Paramêtres de base
it: Impostazioni di base
ru: Основные параметры

# pages_1
source: Record overview
fr: Enregistrement (vue d'ensemble)
it: Vista d'insieme dei record
ru: Просмотр записи

# pages_2
source: Cache and Age
fr: Cache et âge
it: Cache ed età
ru: Буфер и его возраст

# page_sysnote
source: Internal notes
fr: Notes internes
it: Note interne
ru: Заметки

# page_title
source: Pagetree overview
fr: Arborescence (vue d'ensemble)
it: Albero delle pagine
ru: Обзор дерева страниц

# pI_crDate
source: Created date
fr: Date de création
it: Data creazione
ru: Дата создания

# pI_crUser
source: Created by
fr: Créé par
it: Creato da
ru: Автор

# pI_lastChange
source: Last change
fr: Dernier changement
it: Ultima modifica
ru: Последние изменения

# pI_lastChangeContent
source: Last change, content
fr: Dernier changement, contenu
it: Ultimo modifica dei contenuti
ru: Последние изменения содержимого

# stat_period
source: Statistics in the period %s back to %s
fr: Statistique pour la période du %s au %s
it: Statistiche nel periodo compreso tra %s e %s
ru: Статистика в период %s до %s

# stat_type_0
source: Page hits
fr: Affichages de la page
it: Visite per pagina
ru: Хиты страницы

# stat_type_1
source: Total hits
fr: Affichages totals
it: Visite totali
ru: Всего хитов

# stat_type_2
source: Hits in main sections
fr: Affichages dans la section principale
it: Visite raggruppate per sezione
ru: Хиты в основных разделах
