Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/version/*.locallang.xlf
Languages: ru

source: Allow preview of whole workspace
ru: Разрешить предварительный просмотр всей рабочей области

# approveAllToPublish
source: Approve all for Publishing
ru: Все одобрено для публикации

source: Approve for Publishing
ru: Утвердить для публикации

source: Archive
ru: Архив

# autopublishTask.description
source: This tasks checks any workspace that has a publication date set in the past and automatically publishes it.
ru: Эта задача проверяет рабочие области, имеющие просроченные даты публикации и автоматически публикует их.

# autopublishTask.name
source: Workspaces auto-publication
ru: Автоматическая публикация областей

source: change:
ru: разница:

# clickAPage_content
source: Please click a page in the pagetree frame to see the versioning module.
ru: Выберете страницу в дереве страниц, чтобы вывести модуль управления версиями.

# clickAPage_header
source: Web>Versioning module
ru: Модуль Веб>Версии

# cmdPid0
source: Page: Page + content
ru: Страница: Страница + содержимое

# cmdPid1
source: Element: Just record
ru: Элемент: лишь одна запись

# cmdPid100
source: Branch: All subpages
ru: Ветвь: все вложенные страницы

source: Colored diff-view
ru: Режим отличий с окрашиванием

source: Comment:
ru: Комментарий:

source: Comment for Publisher:
ru: Комментарии для издателя:

source: Comment for Reviewer:
ru: Комментарии для рецензента:

# completeMatch
source: Complete match on editable fields.
ru: Полное соответствие по редактируемым полям.

source: Controls:
ru: Управление:

source: Create new version
ru: Создать новую версию

source: CURRENT ONLINE VERSION!
ru: ТЕКУЩАЯ ВЕРСИЯ НА САЙТЕ!

source: [Default Draft]
ru: [Черновик по умолчанию]

source: Deleted element
ru: Удаленный элемент

source: Diff
ru: Отличия

source: DIFFING
ru: ОТЛИЧИЯ

# diffToLiveElement
source: Difference to live element:
ru: Отличия от элемента на сайте:

source: Draft
ru: Черновик

source: Draft Workspaces
ru: Черновые области

source: Editing
ru: Правка

# errorDiffSources
source: ERROR: You didn't select two sources for diffing!
ru: ОШИБКА: для просмотра отличий нельзя использовать несколько источников!

# errorRecordsNotFound
source: ERROR: Records could strangely not be found!
ru: ОШИБКА: странное отсутствие записей!

source: Errors:
ru: Ошибки:

source: Fieldname
ru: Название поля

# filter_all
source: All
ru: Все

# filter_archive
source: Archive
ru: Архив

# filter_drafts
source: Drafts
ru: Черновики

# goBack
source: Click here to go back
ru: Щелкните для возврата:

source: Lifecycle
ru: Жизненный цикл

source: LIVE
ru: САЙТ

source: Live Version:
ru: Версия на сайте:

source: [Live workspace]
ru: [Сайт]

# mlang_labels_tabdescr
source: The Web>Versioning module provides access to versioning features for the page tree.
ru: Модуль Веб>Версии предоставляет доступ к функционалу управления версиями для дерева страниц.

# mlang_labels_tablabel
source: Page and content versioning and workspace management for pages.
ru: Управление версиями страниц и содержимого, а также управление рабочими областями страниц.

# mlang_tabs_tab
source: Versioning
ru: Версии

# moveToPlaceholder
source: Move-to placeholder (destination)
ru: Переместить к заполнителю (месту назначения)

# moveToPointer
source: Move-to pointer (source)
ru: Переместить к указателю (источнику)

# multipleVersions
source: Multiple versions in same workspace!
ru: Несколько версий в одной области!

source: New element
ru: Новый элемент

# notAvailable
source: N/A
ru: Н/Д

source: [Offline]
ru: [Автономно]

# previewInstruction
source: You can preview this page from the workspace using this link for the next %s hours (does not require backend login):
ru: Можно посмотреть страницу из рабочей области, используя эту ссылку в течение %s следующих часов (без авторизации во внутреннем интерфейсе):

source: Preview Link
ru: Ссылка на просмотр

source: Preview Url:
ru: Просмотр Url:

source: Publish
ru: Публиковать

# publishedXTimes
source: Published %s times
ru: Опубликовано %s раз

source: Publish Page
ru: Публикация страницы

# publishPageQuestion
source: Are you sure you want to publish all content %sfrom this page?
ru: Подтверждаете публикацию всего содержимого %sэтой страницы?

# recordsMatchesCompletely
source: Records matches completely on all editable fields!
ru: Полное соответствие записей по всем редактируемым полям!

source: Refresh
ru: Обновить

source: Rejected
ru: Отклонено

# rejectExplain
source: Please explain why you reject:
ru: Причина отклонения:

source: Remove from workspace
ru: Изъять из рабочей области

source: Reset stage
ru: Сбросить стадию

source: Review
ru: Рецензия

source: Send all to Review
ru: Переслать на рецензию все

source: Send to Review
ru: Переслать на рецензию

source: Show all information
ru: Вывести полную информацию

# showDiffView
source: Show difference view
ru: Вывести режим отличий

source: Show Log
ru: Вывести журнал

# stage.approvedForPublish
source: approved for "Publish"
ru: одобрено для "публикации"

# stage.rejectedElement
source: rejected element!
ru: отклонить элемент!

# stage.resetToEdit
source: reset to "Editing"
ru: вернуть на "правку"

# stage.sentToReview
source: sent element to "Review"
ru: отослать элемент на "рецензию"

# stage.undefined
source: [undefined]
ru: [неопределено]

source: [Sub elements]
ru: [Вложенные элементы]

# subElementsClick
source: [Sub elements, click for details]
ru: [Вложенные элементы, щелкните для деталей]

source: Swap
ru: Обмен

source: Swap page
ru: Обмен страницы

# swapPageQuestion
source: Are you sure you want to publish (swap) all content %sfrom this page?
ru: Подтверждаете публикацию (обмен) всего содержимого %sэтой страницы?

source: SWAP with current
ru: ОБМЕН с текущим

# tblHeaderDesc_t3ver_count
source: t3ver_count - Life cycle counter. Incremented each time element is unpublished.
ru: t3ver_count - Счетчик жизненного цикла. Увеличивается при каждой снятии элемента с публикации.

# tblHeaderDesc_t3ver_id
source: t3ver_id - Version number, incremental integer
ru: t3ver_id - номер версии, приращиваемое целое

# tblHeaderDesc_t3ver_label
source: Label
ru: Метка

# tblHeaderDesc_t3ver_oid
source: t3ver_oid - Reference to live version UID
ru: t3ver_oid - ссылка на UID текущей версии

# tblHeaderDesc_t3ver_stage
source: t3ver_stage - Publishing stage: Editing (0), review (1), publish (10), rejected (-1).
ru: t3ver_stage - стадии публикации: редактирование (0), рецензия (1), публикация (10), отклонено (-1).

# tblHeaderDesc_t3ver_state
source: t3ver_state - Special states of a version: 1=Placeholder for "New". 2=Marked deleted.
ru: t3ver_state - специальные состояния версии: 1=заполнитель для "нового". 2=помечено удаленным.

# tblHeaderDesc_t3ver_wsid
source: t3ver_wsid - Workspace ID. There can be only one version of an element per ID (except ID zero).
ru: t3ver_wsid - Workspace ID. Может существовать лишь одна версия элемента для ID (за исключением нулевого ID).

# tblHeaderDesc_title
source: Header of element
ru: Заголовок элемента

# tblHeaderDesc_uid
source: Unique ID of element
ru: Уникальный ID элемента

# tblHeader_t3ver_count
source: count
ru: счетчик

# tblHeader_t3ver_label
source: Label
ru: Метка

# tblHeader_t3ver_stage
source: stage
ru: стадия

# tblHeader_t3ver_state
source: state
ru: состояние

# tblHeader_title
source: Title
ru: Загловок

# title
source: Versioning
ru: Версии

# title_review
source: Send to review/pub
ru: Отправить на рецензию/публиковать

source: Undefined
ru: Неопределенно

source: User Comment
ru: Комментарии пользователя

# versionDetails
source: Details for version
ru: Сведения по версии

# versionInVersion
source: Version inside version!
ru: Версия внутри версии!

# versionSelect.inBranch
source: Inside branch, no further versioning possible
ru: Внутри ветви, дополнительные версии невозможны

# versionSelect.label
source: Versions of this page:
ru: Версии этой страницы:

# versionSelect.live
source: LIVE version
ru: Версия на САЙТЕ

# versionSelect.publish
source: Publish page
ru: Публикация страницы

# versionSelect.versionsFound
source: Versions found on page, no "Page" versioning possible
ru: Версии находятся на странице, версии "Страницы" невозможны

source: Workspace
ru: Рабочая область

source: Workspace-Id:
ru: Id области:

# wsManagement
source: Workspace management
ru: Управление рабочими областями

# wsVersions
source: Workspace Versions:
ru: Версия в рабочей области:
