Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/extensionmanager/Resources/Private/Language/*.locallang.xlf
Languages: ru

# dependencyCheck.headline
source: The following errors were found while trying to install "%s"
ru: Попытка установки повлекла следующие ошибки "%s"

# dependencyCheck.requiredExtension
source: Required extension "%s":
ru: Требуется расширение "%s":

# dependencyCheck.unresolvedDependencies.message
source: If you continue installing the extension, all dependency checks will be turned off. <ul> <li>Required extensions are tried to be fetched from TER (if they do not yet exist in the system)</li> <li>Version dependency checks are skipped</li> </ul> <strong> Be aware that an installation without dependency checks may turn your installation unusable.<br /> In such a case manual intervention is required. </strong>
ru: Если продолжить установку расширения, проверка зависимостей будет отключена. <ul> <li>Требуемые расширения будут запрошены из TER (если они отсутствуют в системе)</li> <li>Номер версии зависимостей не проверяется</li> </ul> <strong> Установка без проверки зависимостей может привести к краху системы.<br /> Если это произошло, понадобится ручное вмешательство. </strong>

# dependencyCheck.unresolvedDependencies.proceed
source: I know what I'm doing, install the extension!
ru: Я знаю, что делаю, установить расширение!

# dependencyCheck.unresolvedDependencies.question
source: Are you sure you want to proceed?
ru: Настаиваете на продолжении?

# dependencyCheck.unresolvedDependencies.title
source: Please read this carefully
ru: Внимательно прочитайте

# distribution.dependency.headline
source: Dependencies, conflics and suggestions
ru: Зависимости, конфликты и предложения

# distribution.dependency.identifier
source: Identifier
ru: Идентификатор

# distribution.dependency.type
source: Type
ru: Тип

# distribution.dependency.version
source: Version
ru: Версия

# distribution.error.headline
source: Could not install distribution '%s'
ru: Невозможно установить разработку '%s'

# distribution.installImpexp
source: Install impexp
ru: Установить impexp

# distributions
source: Get preconfigured distribution
ru: Получить готовые сборки

# distribution.welcome.headline
source: Congratulations...
ru: Поздравляем!!!

# distribution.welcome.message
source: You successfully installed the distribution:
ru: Вы успешно установили сборку:

# distribution.welcome.nextSteps
source: Now you can:
ru: Теперь вы можете:

# distribution.welcome.openPageModule
source: Start editing your website
ru: Начать редактирование вашего сайта

# distribution.welcome.openViewModule
source: View your website
ru: Посмотреть ваш новый сайт

# downloadExtension.dependencies.errorMessage
source: The dependencies of the following Extensions could not be resolved:
ru: Для следующих расширений не удалось решить зависимости:

# downloadExtension.dependencies.errorTitle
source: Dependencies could not be resolved
ru: Невозможно разрешить зависимости

# downloadExtension.dependencies.headline
source: The following dependencies have to be resolved before installation:
ru: Перед установкой необходимо разрешить следующие зависимости:

# downloadExtension.dependencies.resolveAutomatically
source: Shall these dependencies be resolved automatically?
ru: Можно ли автоматически разрешить эти зависимости?

# downloadExtension.dependencies.typeHeadline
source: <h3>Extensions marked for %s:</h3> %s
ru: <h3>Необходимо %s расширения:</h3> %s

# downloadExtension.dependencyType.download
source: download
ru: загрузить

# downloadExtension.dependencyType.install
source: install
ru: установить

# downloadExtension.dependencyType.update
source: update
ru: обновить

# downloadExtension.updateExtension.error
source: Error while updating extension
ru: Ошибка в процессе обновления расширения

# extConfTemplate.backToList
source: Back to list
ru: Назад к списку

# extConfTemplate.headline
source: Configure Extension
ru: Настроить расширение

# extConfTemplate.other
source: Other
ru: Прочие

# extensionList.activate
source: Activate
ru: Задействовать

# extensionList.clickToConfigure
source: (Click to configure)
ru: (нажмите для настройки)

# extensionList.configure
source: Configure
ru: Настройка

# extensionList.deactivate
source: Deactivate
ru: Отключить

# extensionList.dependenciesResolveDownloadError.title
source: Download Error
ru: Ошибка при загрузке

# extensionList.dependenciesResolveDownloadSuccess.header
source: Log
ru: Отчет

# extensionList.dependenciesResolveDownloadSuccess.item
source: Extensions
ru: Расширения

# extensionList.dependenciesResolveDownloadSuccess.message
source: Your installation of {0} was successful.
ru: Не удалась установка {0}.

# extensionList.dependenciesResolveFlashMessage.title
source: {0} installed.
ru: {0} установлено.

# extensionList.distribution.author
source: Author:
ru: Автор:

# extensionList.distribution.downloads
source: Downloads
ru: Количество загрузок

# extensionList.distribution.key
source: Key:
ru: Идентификатор:

# extensionList.distribution.lastUpdated
source: Last Update:
ru: Последнее обновление:

# extensionList.distribution.title
source: Title:
ru: Название:

# extensionList.distribution.version
source: Version:
ru: Версия:

# extensionList.downloadsql
source: Download SQL Dump
ru: Скачать данные SQL

# extensionList.downloadViewHelper.submit
source: Import and Install
ru: Импорт и установка

# extensionList.downloadzip
source: Download as zip
ru: Скачать zip архив

# extensionList.header.activate
source: A/D
ru: От./Вк.

# extensionList.header.author
source: Author
ru: Автор

# extensionList.header.description
source: Description
ru: Описание

# extensionList.header.extensionActions
source: Actions
ru: Действия

# extensionList.header.extensionKey
source: Key
ru: Ключ

# extensionList.header.extensionName
source: Extension
ru: Расширение

# extensionList.header.extensionState
source: State
ru: Состояние

# extensionList.header.extensionVersion
source: Version
ru: Версия

# extensionList.header.lastUpdate
source: Last Updated
ru: Последнее обновление

# extensionList.header.title.activate
source: Activate / Deactivate
ru: Отключить / Задействовать

# extensionList.header.title.update
source: Update
ru: Обновление

# extensionList.header.update
source: Upd.
ru: Обн.

# extensionList.header.uploadComment
source: Upload Comment
ru: Комментарии по загрузке

# extensionList.header.version
source: Version
ru: Версия

# extensionList.installDistribution
source: Install
ru: Установить

# extensionList.installedFlashMessage.message
source: %s was installed!
ru: %s было установлено!

# extensionList.installImpexp
source: Please install the Import/Export (impexp) extension to enable distribution support.
ru: Для включения поддержки развёртки установите расширение Импорт/экспорт Import/Export (impexp).

# extensionList.loading
source: Loading form...
ru: Загрузка формы...

# extensionList.officialDistribution
source: Official distribution
ru: Официальный дистрибутив

# extensionList.overwriteExtension
source: Overwrite
ru: Перезаписать

# extensionList.overwritingDisabled
source: Extension is already available and overwriting was not enabled
ru: Расширение уже имеется на сервере, а перезапись не была разрешена

# extensionList.removalConfirmation.message
source: The extension is currently installed. Uninstall extension?
ru: Расширение в данный момент задействовано. Удалить расширение?

# extensionList.removalConfirmation.question
source: Are you sure you want to remove the extension?
ru: Подтверждаете удаление расширения?

# extensionList.removalConfirmation.title
source: Extension Removal
ru: Удаление расширения

# extensionList.remove
source: Remove
ru: Удалить

# extensionList.remove.message
source: Extension "%s" was removed successfully!
ru: Успешно удалено расширение "%s"!

# extensionList.search
source: Search:
ru: Найти:

# extensionList.showAllVersions.author
source: Author
ru: Автор

# extensionList.showAllVersions.category
source: Category
ru: Категория

# extensionList.showAllVersions.downloads
source: Downloads
ru: Количество загрузок

# extensionList.showAllVersions.extensionKey
source: Extension key
ru: Идентификатор

# extensionList.showAllVersions.label
source: Show all versions
ru: Показать все версии

# extensionList.showAllVersions.lastUploaded
source: Last uploaded
ru: Дата последней загрузки

# extensionList.showAllVersions.manual
source: Manual
ru: Руководство пользователя

# extensionList.showAllVersions.readOnline
source: Read online
ru: Читать онлайн

# extensionList.showAllVersions.version
source: Version
ru: Версия

# extensionList.uninstall.dependencyError
source: Cannot deactivate extension '%s' - The extension(s) '%s' depend on it.
ru: Невозможно деактивировать расширение '%s' - другие расширения (%s) зависят от него.

# extensionList.update
source: Update
ru: Обновить

# extensionList.updateConfirmation.message
source: Update Comments:
ru: Комментарии по обновлению:

# extensionList.updateConfirmation.questionVersionComments
source: Version Comments
ru: Комментарии по версии

# extensionList.updateConfirmation.title
source: Update?
ru: Обновить?

# extensionList.updateDisabled
source: An update is available but this operation is currently disabled
ru: Обновление доступно, но эта операция сейчас невозможна

# extensionList.updateFlashMessage.body
source: %s was updated!
ru: %s загружено!

# extensionList.updateFlashMessage.message
source: {0} updated!
ru: {0} обновлено!

# extensionList.updateFlashMessage.title
source: Extension Update
ru: Обновление расширения

# extensionList.updateFromTer.buttonLabel
source: Update now
ru: Обновить сейчас

# extensionList.updateFromTerFlashMessage.title
source: Update Extension List
ru: Обновление списка расширений

# extensionList.updateFromTer.lastUpdate.label
source: Last update:
ru: Последнее обновление:

# extensionList.updateFromTer.lastUpdate.noInfo
source: unknown
ru: нет данных

# extensionList.updateFromTer.lastUpdate.noTimeOfLastUpdate
source: No last update time known.
ru: Время последнего обновления неизвестно.

# extensionList.updateFromTer.lastUpdate.timeSinceLastUpdateLabel
source: Time since last update:
ru: Время с последнего обновления:

# extensionList.updateFromTer.never
source: Never
ru: Никогда

# extensionList.update.script
source: Execute the update script
ru: Выполнить скрипт обновления

# extensionList.updateToVersion
source: Update to version %s
ru: Обновление до версии %s

# extensionList.uploadExtension
source: Upload Extension .t3x/.zip
ru: Загрузить расширение в виде .t3x/.zip

# extensionList.uploadFlashMessage.message
source: %s was uploaded!
ru: {0} загружено!

# extensionList.uploadFlashMessage.title
source: Extension Upload
ru: Загрузка расширения

source: Extension Manager
ru: Расширения

source: Get Extensions
ru: Получить расширения

source: Install Extension
ru: Установить расширение

source: Manage Extensions
ru: Управление расширениями

# report.status.existingExtensions.insecureExtensionExists.message
source: The following extensions were found on your system, but are currently not installed. Please delete the extensions using the extension manager:<br><br>%s
ru: В текущей системе были найдены следующие не задействованные на текущий момент расширения. Удалите их через модуль управления расширениями: <br><br>%s

# report.status.existingExtensions.insecureExtensionExists.value
source: %s insecure extension(s) found
ru: Найдено %s небезопасное(ых) расширение(ий)

# report.status.existingExtensions.title
source: Security status of existing, but not loaded extensions
ru: Статус безопасности имеющихся, но не задействованных расширений

# report.status.existingOutdatedExtensions.outdatedExtensionExists.message
source: The following extensions were found on your system, but are currently not installed. Please make sure they are compatible with your system before installing them:<br><br>%s
ru: Следующие устаревшие расширения присутствуют в системе, но не задействованы. Убедитесь, что они совместимы с вашей сборкой перед их активацией:<br><br>%s

# report.status.existingOutdatedExtensions.outdatedExtensionExists.value
source: %s outdated extension(s) found
ru: найдено %s устаревших расширений

# report.status.existingOutdatedExtensions.title
source: Outdated status of existing, but not loaded extensions
ru: Устаревшие расширения среди имеющихся, но не задействованных

# report.status.loadedExtensions.insecureExtensionLoaded.message
source: The following extensions are insecure and usage might damage your system. Please update these extensions as soon as possible or remove them from your system:<br><br>%s
ru: Небезопасны следующие расширения и их использование может повредить системе. По возможности быстрее обновите их или удалите из своей системы:<br><br>%s

# report.status.loadedExtensions.insecureExtensionLoaded.value
source: %s insecure extension(s) found
ru: Найдено %s небезопасное(ых) расширение(ий)

# report.status.loadedExtensions.title
source: Security status of loaded extensions
ru: Статус безопасности загруженных расширений

# report.status.loadedOutdatedExtensions.outdatedExtensionLoaded.message
source: The following extensions are outdated and may not be compatible with your installation. Please make sure these extensions are compatible and ask the extension author to publish updates:<br><br>%s
ru: Следующие расширения устарели и могут быть несовместимы с вашей сборкой. Убедитесь, что эти расширения совместимы, и попросите их автора выпустить обновления:<br><br>%s

# report.status.loadedOutdatedExtensions.outdatedExtensionLoaded.value
source: %s outdated extension(s) found
ru: найдено %s устаревших расширений

# report.status.loadedOutdatedExtensions.title
source: Outdated status of loaded extensions
ru: Устаревшие расширения среди загруженных

# report.status.mainRepository.notFound.message
source: The typo3.org extension repository was not found. Please import the main typo3.org extension repository in the install tool wizard.
ru: Не найден репозиторий расширений на typo3.org. Импортируйте основной репозиторий расширений на typo3.org в мастере install tool.

# report.status.mainRepository.notFound.value
source: Error
ru: Ошибка

# report.status.mainRepository.notUpToDate.message
source: The Main Repository extension list is older than 7 days. Please update it in the Extension manager or Scheduler.
ru: Список расширений основного репозитория старше недели. Обновите его в модуле управления расширениями или в Планировщиками.

# report.status.mainRepository.notUpToDate.value
source: Extension list is not up to date!
ru: Не актуален список расширений!

# report.status.mainRepository.title
source: Update status of typo3.org main repository extension list
ru: Статус обновления списка расширений основного репозитория typo3.org

# searchTemplate.resetSearchButton
source: Reset Search
ru: Сбросить поиск

# searchTemplate.searchAgain
source: Search again
ru: Повторить поиск

# searchTemplate.searchExtensions
source: Search extensions
ru: Поиск расширений

# searchTemplate.submitButton
source: Go
ru: Отправить

# searchTemplate.yourSearch
source: Your search
ru: Вы ищите

# showAllVersions
source: Show all versions of
ru: Показать все версии для

# task.updateExtensionListTask.description
source: Update TER extension list on a regular basis. Once a day is a good interval.
ru: Регулярное обновление списка доступных в TER расширений. Хороший выбор – раз в день.

# task.updateExtensionListTask.name
source: Update extension list
ru: Обновление списка расширений

# updateScript.headline
source: Update script for %s
ru: Скрипт обновления для %s

# updateScript.none
source: No update necessary.
ru: Обновление не требуется.

# uploadTemplate.extensionLabel
source: Extension
ru: Расширение

# uploadTemplate.uploadButton
source: Upload!
ru: Загрузить!
