Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/scheduler/Resources/*.locallang.1416085778.xlf
Languages: ru

# testTask.name
source: Scheduler test task
ru: Планировщик тестовой задачи

# testTask.description
source: The Scheduler test task just sends a mail to a given email address. It is designed to be used for testing purposes.
ru: Планировщик тестовой задачи просто отправляет письмо на заданный электронный адрес. Он разработан для тестирования.

# sleepTask.name
source: Scheduler sleep task
ru: Планировщик отложенной задачи

# sleepTask.description
source: This task does nothing but put PHP to sleep for a number of seconds. It is designed to test multiple executions.
ru: Эта задача просто откладывает PHP на заданное количество секунд. Разработан для тестирования выполнения нескольких задач.

# cachingFrameworkGarbageCollection.name
source: Caching framework garbage collection
ru: Сбор мусора схемы кеширования

# cachingFrameworkGarbageCollection.description
source: This task calls the garbage collection of configured caching framework caches which use one of the selected backends. This will free some space in cache backends which do not have an internal garbage collection. In case of the default database backend it is advisable to run this task once a day when the database is mostly idle.
ru: Эта задача по сбору мусора в кеша по одной из схем кеширования, выбранной во внутреннем интерфейсе. Это высвободит немного места за счет кеша внутреннего интерфейса, не имеющего внутреннего буфера. Для базы данных внутреннего интерфейса по умолчанию, целесообразно запускать эту задачу ежедневно, при наименьшей загрузке базы.

# fileIndexing.name
source: [OBSOLETE] File Abstraction Layer: Indexing job
ru: File Abstraction Layer: работа по индексации

# fileIndexing.description
source: Runs indexing tasks based on an indexing configuration and a storage/folder information.
ru: Настройка запуска задач по индексации и информация о хранилище/папке.

# fileStorageIndexing.name
source: File Abstraction Layer: Update storage index
ru: File Abstraction Layer: обновление индекса хранилища

# fileStorageIndexing.description
source: Updates the Index/Cache Data of a Storage; only needed if changes to the storage are possible outside the backend (FTP, RemoteStorages).
ru: Обновление данных индекса/кеша хранилища; необходимо лишь при изменении хранилища извне внутреннего интерфейса (FTP, RemoteStorages).

# fileStorageExtraction.name
source: File Abstraction Layer: Extract metadata in storage
ru: File Abstraction Layer: извлечение метаданных в хранилище

# fileStorageExtraction.description
source: Extracts metadata for all files in storage which have been changed since last run.
ru: Извлечение метаданных для всех файлов хранилища, изменившихся с прошлого запуска.

# tableGarbageCollection.name
source: Table garbage collection
ru: Таблица с мусором

# recyclerGarbageCollection.name
source: Fileadmin garbage collection
ru: Таблица мусора Fileadmin

# recyclerGarbageCollection.description
source: This task empties all "_recycler_" folders below fileadmin. This helps free some space in the file system.
ru: Эта задача очищает все папкиl "_recycler_" расположенные в директории fileadmin. Это освобождает место в файловой системе.
