Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/scheduler/Resources/*.locallang.1415814985.xlf
Languages: ru

# .alttitle
source: Scheduler
ru: Планировщик

# .description
source: The Scheduler provides an interface to register and manage recurring or one-time tasks.
ru: Интерфейс для регистрации и управления повторяющихся или единичных задач.

# .syntax
source: The Scheduler uses a single cron job to handle all registered tasks. It is thus very convenient as only one cron job needs to be set up and all task frequencies can be managed from the BE module.
ru: Планировщик использует единственное cron задание для обработки всех зарегистрированных задач. Очень удобно установить единственное cron задание и управлять частотой выполнения всех задач из модуля внутреннего интерфейса.

# task_class.alttitle
source: Class of the task
ru: Класс задач

# task_class.description
source: Choose a class from the list of available tasks
ru: Выберете класс из списка доступных задач

# task_class.details
source: Some tasks are provided by the TYPO3 Core itself. Others come from extensions. See the manual to learn how to create your own tasks and register them with the Scheduler.
ru: Некоторые задачи определяются самим ядром TYPO3. Смотрите руководство, чтобы научиться создавать собственные задачи и регистрировать их в планировщике.

# task_disable.alttitle
source: Disable task
ru: Отключение задач

# task_disable.description
source: Check this box to disable the automatic, scheduled execution of this task. It can still be launched manually from the BE module.
ru: Включите этот флажок для отключения автоматического запланированного выполнения данной задачи. Ее все еще можно будет выполнить вручную из модуля внутреннего интерфейса.

# task_type.alttitle
source: Type of task
ru: Тип задачи

# task_type.description
source: Choose whether the task must happen a single time or will be repeated
ru: Выберете, должна ли задача выполняться один раз или повторяться

# task_start.alttitle
source: Start of task
ru: Начало задачи

# task_start.description
source: Enter a start date and time for the task
ru: Введите начальную дату и время для задачи

# task_start.details
source: Date must be entered in a standard format like HH:mm dd-mm-YYYY or YYYY-mm-dd HH:mm. Natural keywords can also be used, like "now" or "tomorrow". Date and time must correspond to the server's time zone.
ru: Дата должна вводиться в стандартном формате, вроде ЧЧ:мм дд-мм-ГГГГ или ГГГГ-мм-дд ЧЧ:мм. Также можно использовать обычные слова, вроде "now" или "tomorrow". Дата и время должны соответствовать часовому поясу сервера.

# task_end.alttitle
source: End of task
ru: Окончание задачи

# task_end.description
source: Enter an end date and time for the task, can be blank
ru: Введите дату и время для окончания выполнения задачи

# task_end.details
source: Date must be entered in a standard format like HH:mm dd-mm-YYYY or YYYY-mm-dd HH:mm. Natural keywords can also be used, like "now" or "tomorrow". Date and time must correspond to the server's time zone. Can be left blank, if task is not supposed to end at any point.
ru: Дата должна вводиться в стандартном формате, вроде ЧЧ:мм дд-мм-ГГГГ или ГГГГ-мм-дд ЧЧ:мм. Также можно использовать обычные слова, вроде "now" или "tomorrow". Дата и время должны соответствовать часовому поясу сервера. Можно оставить пустым, если задача не имеет срока окончания.

# task_frequency.alttitle
source: Frequency of task
ru: Частота повторения задачи

# task_frequency.description
source: Enter a frequency, either in seconds or using a cron-like syntax (minutes, hours, day of month, months and day of week)
ru: Введите частоту повторения задачи в секундах или используйте cron-подобный синтаксис (минуты, часы, день месяца, месяц и день недели)

# task_frequency.details
source: The frequency of the task can be simply entered as a number of seconds. Alternatively it is possible to use the same syntax as for cron jobs. This is simply a list of five numbers or the wildcard "*", separated by blanks. The five numbers are (in order) minutes, hours, day of month, months and day of week. Examples: */5 * * * * means every 5 minutes 30 22 * * * means every day at 22:30 The Scheduler supports the full cron syntax.
ru: Частота задачи может быть введена, как количество секунд. В качестве альтернативы можно использовать синтаксис для ввода заданий cron. Это просто список из пяти чисел или шаблона "*", через пробел. Эти пять чисел (по порядку) – минуты, часы, день месяца и день недели. Примеры: */5 * * * * значит, каждые 5 минут 30 22 * * * значит, каждый день, в 22:30 Планировщик поддерживает полный синтаксис cron.

# task_frequency.seeAlso
source: Wikipedia reference|http://en.wikipedia.org/wiki/Cron
ru: Ссылка на википедию|http://ru.wikipedia.org/wiki/Cron

# task_multiple.alttitle
source: Multiple executions
ru: Множественное исполнение

# task_multiple.description
source: Choose whether a task can be running several times simultaneously or not
ru: Выберете, может ли задача выполняться несколько раз одновременно или нет

# task_email.alttitle
source: Email address
ru: Адрес email

# task_email.description
source: Enter a recipient for the mails sent by the test task
ru: Введите адрес получателя письма, отосланного тестовой задачей

# task_sleepTime.alttitle
source: Sleep time
ru: Время отсрочки

# task_sleepTime.description
source: Enter a number of seconds during which the task will just sleep.
ru: Введите количество секунд, на которые будет отсрочено выполнение задачи.

# task_cachingFrameworkGarbageCollection_selectedBackends.alttitle
source: Select backends
ru: Выбор внутренних интерфейсов

# task_cachingFrameworkGarbageCollection_selectedBackends.description
source: If a cache uses one of the selected backends, the garbage collection will be called for this cache.
ru: Если кеширование использует один из выбранных интерфейсов, для него будет вызвана уборка мусора.

# task_tableGarbageCollection_numberOfDays.alttitle
source: Number of days
ru: Количество дней

# task_tableGarbageCollection_numberOfDays.description
source: Delete rows from selected table that are older than given number of days.
ru: Удаление записей из выбранных таблиц, которые старше заданного количества дней.

# task_tableGarbageCollection_table.alttitle
source: Select table
ru: Выберите таблицу

# task_tableGarbageCollection_table.description
source: Select one of the registered tables to be cleaned up with this task.
ru: Выберите одну из зарегистрированных таблиц, для очистки в процессе выполнения задачи.

# task_tableGarbageCollection_allTables.alttitle
source: Clean up all tables
ru: Очистить все таблицы

# task_tableGarbageCollection_allTables.description
source: If selected, all configured tables are cleaned. The selection below is ignored.
ru: При выборе, очищаются все настроенные таблицы. Выбранное ниже игнорируется.

# task_recyclerGarbageCollection_numberOfDays.alttitle
source: Number of days
ru: Количество дней

# task_recyclerGarbageCollection_numberOfDays.description
source: Delete files in _recycler_ folders that are older than the given number of days.
ru: Удалить файлы в папках _recycler_, которые старше указанного количества дней.
