Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/setup/*.locallang_csh_mod.xlf
Languages: it, ru

# .alttitle
source: User > Setup module
it: Utente > modulo Setup
ru: Пользователь > Настройки

# .description
source: The Setup module allows the backend user to customize TYPO3 for his own login sessions. This includes the backend language and various other interface features.
it: il modulo Setup permette agli utenti backend di personalizzare TYPO3 per le proprie sessioni di attività. Questo include la lingua ed altre caratteristiche dell'interfaccia del backend.
ru: Модуль настройки позволяет внутреннему пользователю настраивать TYPO3. К таким настройкам относятся язык системы и настройка интерфейса.

# .details
source: <b>Notice [For Admins]:</b> These settings can all be overridden or have their default values changed by "User TSconfig". To read more about this concept, see the link below!
it: <b>Nota [per gli Amministratori]:</b> Questi settaggi possono essere tutti sovraselezionati e avare diverse impostazioni di default utilizzando "user TSconfig". Per approfondire questo aspetto, segui il link sottostante!
ru: <b>Примечание [Для Администраторов]:</b> Эти настройки могут быть принудительно изменены или возвращены к значениям по умолчанию изменением "User TSconfig". Чтобы узнать больше об этой возможности - пройдите по ссылке ниже.

# .image_descr
source: The Setup module is selected in the left menu. This is how the Setup module interface looks like - a list of options to configure.
it: Il modulo Setup é selezionato nel menù di sinistra. Ecco come appare il modulo Setup - una lista di ozioni da configurare.
ru: модуль Настройки выбирается в меню слева. Так выглядит настройка интерфейса - список опций для настройки.

# language.alttitle
source: Backend Language selection
it: Selezione della lingua del backend
ru: Выбор языка системы

# language.description
source: Select the backend language you prefer. Most parts of TYPO3s backend (for regular users) are translated into other languages.
it: Seleziona la lingua che preferisci. La maggior parte del backend di TYPO3 é tradotta anche in altre lingue.
ru: Выберите нужный язык системы. БОльшая часть системы TYPO3 (для простых пользователей) переведена на другие языки.

# language.image_descr
source: TYPO3 is translated into around 40 languages. English is the default language and all labels must be available in English first and foremost. This screenshot shows translations for Hebrew, Arabic, Russian and Chinese.
it: TYPO3 é tradotto in circa 40 lingue. L'inglese é la lingua di default ed <u>ogni</u> label deve innazitutto essere disponibile in inglese. Questo screenshot mostra traduzioni in Ebraico, Arabo, Russo e Cinese.
ru: TYPO3 переведена более чем на 40 языков. Английский является языком по умолчанию и все надписи существуют на английском и доступны в начале и в любой момент. Эти скриншоты показывают перевод на иврит, арабский, русский и китайский.

# option_beUser_email.alttitle
source: Your email address
it: La tua email
ru: Ваш email

# option_beUser_email.description
source: Make sure this is a valid email address for you. This is the contact address that the backend administrator will use if he needs to contact you. Also, the TYPO3 system might need to send you messages at various times and this will be the recipient address.
it: Accertati che sia un tuo valido indirizzo email. Questo é l'indirizzo di contatto che l'amministratore del backend userà se necessiterà di contattarti.
ru: Убедитесь, что ввели правильный адрес электронной почты. Это контактный адрес, по которому в вами сможет связаться администратор. Также по этому адресу будут отправляться различные системные сообщения из TYPO3.

# option_beUser_realName.alttitle
source: Your real name
it: Il tuo nome
ru: Ваше настоящее имя

# option_beUser_realName.description
source: Enter your real name here.
it: Inserisci il tuo nome reale
ru: Введите настоящее ваше имя.

# option_condensedMode.alttitle
source: Condensed Mode
it: Modalità Condensed
ru: Компактный режим

# option_condensedMode.description
source: If set, the backend will not load the Web-submodules and File-submodules in a frameset but allow the page and folder trees to load the submodule in the main content frame. This allows for a better display on small screens.
it: Se attivata, il backend non caricherà i sottomoduli Web e File in un frameset, ma permetterà alle pagine e ai pagetree di caricare i sottomoduli nel frame principale. Questa opzione permette una miglior visualizzazione sui schermi piccoli.
ru: В этом режиме дерево страниц и содержание отображаются попеременно. Это позволяет улучшить отображение на маленьких экранах.

# option_condensedMode.image_descr
source: In this example Condensed Mode is enabled. The page tree is <em>not</em> shown in the normal navigation frame but rather in the full content frame to the right of the menu. When a page title is clicked in the page tree the module page (here the Web > List module) will be loaded in the <u>same</u> frame of the backend. In this way Condensed Mode saves horizontal screen space since the navigation frame is removed - but it takes an extra click if you need to go to another page.
it: In questo esempio è abilitato il Modo Condensato. L'albero delle pagine <em>non</em> è mostrato nel normale frame di navigazione ma piuttosto nel frame del contenuto completo sulla destra del menu. Quando un titolo di pagina è cliccato nell'albero delle pagine il modulo page (qui il modulo Web > List) sarà caricato nello <u>stesso</u> frame del backend. In questo modo il Modo Condensato risparmia dello spazio orizzontale dello schermo in quanto è rimosso il frame di navigazione - ma questo richiede un click extra nel caso si debba andare in un'altra pagina.
ru: В этом примере используется компактный режим. Дерево страниц показано <em>не</em> в обычном фрейме навигации, а в полнофункциональном фрейме, справа от меню. При щелчке по заголовку страницы в дереве страниц, загружается модуль страница (здесь — модуль Веб > Список) в <u>то же</u> фрейм во внутреннем интерфейсе. Таким образом, компактрый режим сохраняет пространство по горизонтали, путем удаления фрейма навигации, но при этом увеличивается количество дополнительных щелчков для перехода к другой странице.

# option_copyLevels.alttitle
source: Recursive Copy
it: Copia Ricorsiva
ru: Рекурсивное копирование

# option_copyLevels.description
source: When you copy a page, subpages can also be copied along if you set this option. The number you set here defines the number of levels under a page to include in a copy operation.
it: Quando copi una pagina, se hai selezionato questa opzione verranno copiate automaticamente anche tutte le relative sottopagine. Il numero che inserisci qui definisce il numero di livelli di profondità da includere in un'operazione di copia.
ru: Установив этот параметр, можно скопировать подстраницы вместе с копируемой страницей. Установленное здесь число означает число уровней, которые будут копироваться.

# option_disableCMlayers.alttitle
source: Disable Popup Context Menus
it: Disabilita i popup menù contestuali.
ru: Отключить всплывающее контекстное меню

# option_disableCMlayers.description
source: When an icon for a file or database record is shown inside the TYPO3 backend you can often click on the icon and a contextual menu will appear over the icon with options related to it. You can disable this behaviour by this option. However you probably don't want to do that.
ru: Обычно щелчок по значку отображаемых во внутреннем интерфейсе TYPO3 файлов или записей вызывает контекстное всплывающее меню. Этот параметр отключает эту возможность. Наверняка это вам не понадобиться.

# option_disableCMlayers.image_descr
source: This is the context menu (or "Clickmenu") of a page in the page tree. Notice that it is activated by a regular "left-click" opposite to the normal "right-click" activation known from most Operating Systems.
ru: Это контекстное меню страницы в дереве страниц. Помните, что оно появляется при щелчке левой кнопкой мыши, в противоположность обычному поведению операционной системы, при активации контекстного меню при щелчке правой кнопкой.

# option_edit_docModuleUpload.alttitle
source: Enable File Uploads in editing forms
it: Permetti l'Upload di files dalle form di editing.
ru: Загрузка файлов непосредственно в документе

# option_edit_docModuleUpload.description
source: This option will enable an "Upload" box for each field in TYPO3 records where you can attach a file or image. Most likely you don't want to disable this since it is usually just a nice thing to have.
ru: Этот параметр включает блок "загрузки" для каждого поля в записях TYPO3, в которые можно вставить файл или изображение. Вероятно вы не откажетесь от этой удобной возможности.

# option_edit_docModuleUpload.details
source: If you disable the Upload box there is still the TYPO3 Element Browser left for attaching files and images.
ru: При отключении блока загрузки, все еще будет доступен проводник элемнтов TYPO3 слева, для прикрепления файлов или изображений.

# option_edit_RTE.alttitle
source: Enable Rich Text Editor
it: Abilita RTE (Rich Text Editor)
ru: Включить редактор сложного текста RTE

# option_edit_RTE.description
source: If set, the Rich Text Editor in TYPO3 will be enabled for you. Normally you wouldn't want to disable this option.
it: Se selezionata, il Rich Text Editor sarà abilitato. Normalmente vorra ilasciare questa opzione selezionata.
ru: При включении будет досупен редактор сложного текста RTE. Обычно этот параметр не отключают.

# option_edit_showFieldHelp.alttitle
source: Context Sensitive Help mode
it: Modalità del CSH (aiuto contestuale)
ru: Режим контекстной справки

# option_edit_showFieldHelp.description
source: Defines the mode of Context Sensitive Help (CSH) in TYPO3. The default is that small help icons are shown everywhere a help item is available. You can click the icon and help will appear in a window for you.
it: Definisce la modalità dell'Aiuto In Linea (CSH:Context Sensitive Help) di Typo3. Di default sono mostrate delle piccole icone di help ovunque ci sia dell'aiuto disponibile. Puoi qundi cliccare sull'icona e si aprirà una nuova finestra.
ru: Определяет режим контекстно зависимой справки в TYPO3. По умолчанию используется маленький значок, отображаемый везде, где справка доступна. Щелчок по нему вызывает всплывающее окно со справкой.

# option_edit_showFieldHelp.details
source: Alternatively you can select that descriptions are shown inline. This is useful for people who are still learning how TYPO3 works and want to browse the backend with descriptions shown directly. Finally experienced users will want to totally disable the help icons if they seem to just bloat the backend interface. Context Sensitive Help is also available as a full user manual in the Help>Manual module.
ru: Альтернативно, можно показывать описание полностью. Это полезно при обучении работе с TYPO3. И наконец, опытные пользователи могут отключить справку совсем, включая значок. Контекстно зависимая справка доступна как полноценное руководство пользователя в модуле Справка > Справочник.

# option_edit_showFieldHelp.image_descr
source: The default mode, "Display help icon only", will show the help icons with no additional text. When "Display full text message" is selected you will see a short description shown together with the help icon and framed into a box. Clicking the help icon always links to the full description of the element shown in a pop-up window.
ru: В режиме по умолчанию, "показывать лишь значок справки", будет виден лишь ее значок, без дополнительного текста. Режим "показать текст полностью" означает заключенное в рамку краткое описания рядом со значком справки. Щелчок по значку откроет полное описание элемента во всплывающем окне.

# option_edit_wideDocument.alttitle
source: Wide document background
it: Background documenti estesto
ru: Широкий фон документа

# option_edit_wideDocument.description
source: Setting this option will enlarge the default width of record editing forms in TYPO3 by around 50%
it: Attivando questa opzione si allargherà lo spazio in TYPO3, per la modifica delle form, di circa il 50%
ru: Включение этого параметра, увеличивает место для редактирования формы в TYPO3 примерно на 50%.

# option_emailMeAtLogin.alttitle
source: Notify by login
it: Notifica il login
ru: Оповещение о регистрации

# option_emailMeAtLogin.description
source: If you set this option you will receive an email from TYPO3 each time you (or "someone") logs in using your username. You might like to receive such a "warning" as a security measure so you will know if someone else picks up your password and uses your account.
ru: При включении этого параметра, сообщения будут отправляться на введенный здесь адрес электронной почты, когда вы (или кто-то под вашим именем) будете входить в систему. Это можно рассматривать как "предупреждение" системы безопасности о том, что кто-то зарегистрировался в системе под вашим именем.

# option_enableFlashUploader.alttitle
source: Enable Flash Uploader
it: Abilita il caricatore di file in Flash
ru: Включение загрузчика Flash

# option_enableFlashUploader.description
source: This option will enable a flash-based uploader that allows you to select multiple files at once when uploading files. If you enable this option, make sure that your browser has the latest Flash plugin (Flash 9 or higher) installed in order to make this feature work.
ru: Этот параметр включает загрузчик, работающий на технологии flash, позволяющий выбирать несколько файлов за раз для загрузки. При включении этого параметра, удостоверьтесь, что в браузере установлено расширение Flash последней версии (9 или выше).

# option_enableInstallTool.alttitle
source: Admin control for re-enabling Install Tool access
it: Controllo Amministratore per ri-abilitare l'accesso allo 'Strumento di installazione'
ru: Административный контроль за доступом к инструментарию установки.

# option_enableInstallTool.description
source: By clicking this button, a file typo3conf/ENABLE_INSTALL_TOOL is created (or removed if it already exists). It unlocks the access to the Install Tool (password is still needed!) and will be removed automatically after 1 hour.
ru: При щелчке по этой кнопке, будет создан файл typo3conf/ENABLE_INSTALL_TOOL (или, соответственно удален, если он существовал). При этом разблокируется доступ к инструментарию установки (пароль для него все еще будет нужен!). Файл автоматически удаляется через 1 час.

# option_flexibleTextareas_MaxHeight.alttitle
source: Maximal Height of flexible textareas
it: Altezza massima dell'area flessibile di testo
ru: Максимальная высота изменяемых текстовых областей

# option_flexibleTextareas_MaxHeight.description
source: Define the maximal height of flexible textareas (in Pixel).
it: Definisce la massima altezza di un'area flessibile di testo(in pixel).
ru: Максимальная высота изменяемой текстовой области (в пикселях).

# option_helpText.alttitle
source: Show help text when applicable
it: Mostra l'aiuto quando possibile
ru: По возможности показать справку

# option_helpText.description
source: If set, some help texts will appear by default. Applies to the "Legend" text in the Web>Access module for instance.
it: Se abilitati, alcuni testi di aiuto appariranno di default. Per esempio si applica ai testi "Legenda" nel modulo Web>Accesso
ru: При включении, по умолчанию будет показан текст справки. Например, применяется в тексте "Легенда" модуля Веб > Доступ.

# option_maxTitleLen.alttitle
source: Maximum title length
it: Lunghezza massima dei titoli
ru: Максимальная длина заголовка

# option_maxTitleLen.description
source: TYPO3 will often crop long titles of records etc. so only the first X characters are shown. Often the number of shown characters depends on this variable. For instance the length of page titles in the page tree is determined by this value.
it: TYPO3 spesso taglierà i titoli dei record etc. in modo tale che siano mostrati solo i primi X caratteri. Spesso il numero dei caratteri mostrati dipende da questa variabile. Per esempio la lunghezza del titolo di pagina nell'albero di navigazione è determinato da questo valore.
ru: Часто TYPO3 обрезает длинные заголовки записей и т.п., при этом будут показаны лишь X начальных символов. Как правило, это количество показываемых символов зависит от этого значения. Например, длина заголовка страниц в дереве страниц.

# option_maxTitleLen.image_descr
source: In this case the Maximum Title length is set to 10 - and the result is that titles in the page tree - as well as other places in the backend - will be cropped after 10 characters, then suffixed by "...". The default value is "30".
it: In questo caso la lunghezza Massima del Titolo è impostata a 10 - e il risultato è che il titolo nell'albero delle pagine - così come in altri posti nel backend - sarà tagliato dopo 10 caratteri, e verrà aggiunto "...". Il valore di default è "30".
ru: Здесь максимальная длина заголовка установлена 10, в результате, как видно на картинке, заголовки были обрезаны до 10 символов, после чего поставлено многоточие. Значение по умолчанию — 30.

# option_newPasswordAgain.alttitle
source: Change password, confirm
it: Cambio password, conferma
ru: Подтверждение изменения пароля

# option_newPasswordAgain.description
source: Confirm the new password by entering it again, exactly like above. If the two new passwords do not match, the password will not be changed.
it: Conferma la nuova password inserendola di nuovo, esattamente come scritta qui sopra. Se le due password non corrispondono esattamente, la password non sarà modificata.
ru: Подтвердите новый пароль, введя его снова, точно также, как в предыдущее поле. При несовпадении введенных символов пароль не будет изменен.

# option_newPassword.alttitle
source: Change password
it: Cambia password
ru: Изменение пароля

# option_newPassword.description
source: Enter a new password for your backend account:
it: Inserisci una nuova password per il tuo account backend:
ru: Введите новый пароль для вашей учетной записи:

# option_newPassword.details
source: The passwords are encrypted to an MD5 hash when you leave the field so no plain text password is sent over the wire.
ru: Пароль шифруется по алгоритму MD5, таким образом информация в явном виде передаваться не будет.

# option_noMenuMode.alttitle
source: Navigation Mode
it: Modalità di navigazione
ru: Режим Навигации

# option_noMenuMode.description
source: Setting alternative backend menu modes
it: Seleziona modalità alternative per il menù del moduli backend
ru: Настройка альтернативного режима меню во внутреннем интерфейсе

# option_noMenuMode.details
source: By default you navigate between backend modules with the menu in the left frame. By this option you can select alternative navigation modes: <b>Selectorbox in top frame:</b> If set, the backend will not load the left menu frame but rather put a selector-box menu in the topframe. This saves a lot of space on small screens. <b>Icons in top frame</b> This option shows all menu items in the top frame as a horizontal list of icons. This is for experienced users only who knows the order of modules and can recognize them based on their icon.
it: Solitamente si naviga tra i moduli di backend con il menu nel frame sinistro. Con questa opzione potete selezionare un modo alternativo di navigazione: <b>Selectorbox in top frame:</b> Se settato, il backend non caricherà il frame con il menu a sinistra, ma piuttosto un menu con selector-box nella sezione alta della pagina. In questo modo si guadagna molto spazio sugli schermi piccoli. <b>Icone nel top frame</b> Questa opzione mostra tutte le voci di menu nella sezione alta della pagina come lista orizzontale di icone. Questo è solo per un utente esperto che conosce l'ordine dei moduli e può riconoscerli basandosi sulle loro icone.
ru: По умолчанию, перемещение по модулям внутреннего интерфейса осуществляется через меню слева. Здесь можно включить альтернативную модель навигации: <b>Выпадающее меню сверху:</b> При этом, меню слева не будет отображаться, но сверху появится выпадающее меню. Это сохраняет пространство на маленьких экранах. <b>Значки сверху</b> При этом все элементы меню отображаются в виде значков сверху. Этот режим предназначен только для опытных пользователей, определяющих нужный модуль по виду значка.

# option_noMenuMode.image_descr
source: The "Selectorbox" menu. Selecting an item makes the backend jump to that module. The "Icons" menu. As you can see you will need to know the icons by heart. You can also position the mouse over the icon and the tool-tip text will reveal the module name.
ru: "Выпадающее" меню. Выбирая элемент, попадаете в нужный модуль. Меню "Значки". Как можно заметить, нужно знать, что за модуль скрывается за определенным значком. Чтобы понять это, можно поместить указатель мыши над значком, при этом появиться всплывающая подсказка с названием модуля.

# option_recursiveDelete.alttitle
source: Recursive Delete
it: Eliminazione Ricorsiva
ru: Рекурсивное удаление

# option_recursiveDelete.description
source: You cannot delete a page with subpages unless this flag is set. Be careful - setting this option means that TYPO3 will allow a whole tree of pages to be deleted in one go!
it: Non puoi eliminare una pgina che ha delle sottopagine, a menoi che questa opzione sia selezionata. Fare molta attenzione: abilitando questa opzione si permetterà a Typo3 di eliminare in un colpo solo tutto l'albero delle pagine.
ru: Если этот параметр не установлен, то удалить страницу будет невозможно, если у нее есть подстраницы. Будьте осторожны, включение этого параметра означает, что TYPO3 позволит удалить все дерево страниц одним щелчком мыши!

# option_recursiveDelete.details
source: You should also consider the performance issues involved when deleting a large page tree. It might take a considerable amount of time to do that and if PHP times out before the operation is finished the results might be unpredictable.
it: Devi considerare un problema di performance che si crea quando si cancella un grande albero di navigazione. Potrebbe essere richiesto molto tempo per farlo e se il PHP va in timeout prima che l'operazione finisca, il risultato potrebbe non essere prevedibile.
ru: Также нужно помнить, что удаление большого количества страниц влияет на производительность сервера. Операция может занять много времени, либо, при исчерпании лимита времени для операций PHP, результаты могут оказаться непредсказуемыми.

# option_resizeTextareas.alttitle
source: Make Textareas Resizable
it: Rende ridimensionabile l'area di testo
ru: Изменять размер текстовых областей

# option_resizeTextareas.description
source: This option will make textareas resizable. You will see the resize mouse cursor if you move mouse to the outer border of textarea.
ru: Этот параметр отвечает за изменение размеров текстовых областей. При подведении курсора мышки к краю текстовой области, ее размер можно будет изменить.

# option_resizeTextareas_Flexible.alttitle
source: Make Textareas Flexible
it: Rende flessibile l'area di testo
ru: Сделать текстовые области гибкими

# option_resizeTextareas_Flexible.description
source: This option will make textareas flexible. The height will grow automatically while typing. Limit is the maximal height set (default 600).
ru: Этот параметр отвечает за размер текстовых областей. Их высота будет автоматически увеличиваться по мере набора текста. Можно установить ограничения на максимальную их высоту (по умолчанию – 600 пикселей)

# option_resizeTextareas_MaxHeight.alttitle
source: Maximal Height of Textarea
it: Altezza massima dell'area di testo
ru: Максимальная высота текстовой области
