Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/setup/*.locallang_csh_mod.xlf
Languages: it, ru

# option_resizeTextareas_MaxHeight.description
source: Define the maximal height of textarea (in Pixel).
it: Definisce la massima altezza dell'area di testo (in pixel).
ru: Определение максимальной высоты текстовой области (в пикселях).

# option_showThumbs.alttitle
source: Show Thumbnails by default
it: Mostra Thumbnails (miniature) di default
ru: По умолчанию показывать эскизы картинок

# option_showThumbs.description
source: In modules like the "Web > List" and "File > Filelist" you can enable the display of thumbnails of files (images/fonts) and records (if images are attached) with a checkbox. Setting this option will enable the display by default.
it: Nei moduli come "Web > Lista" e "File > Lista File" puoi abilitare la visualizzazione delle miniature dei file (immagini/font) e record (se le immagini sono allegate) con un checkbox. Abilitando questa opzione si attiverà la visualizzazione di default.
ru: В таких модулях, как "Веб > Список" и "Файл > Список файлов" можно включить отображение эскизов файлов (изображений/шрифтов) и записей (если присутствует изображение). Этот параметр включает отображение эскизов в подобных модулях по умолчанию.

# option_showThumbs.image_descr
source: When thumbnails display is enabled, files attached to records will be shown in the "Web > List" module like this.
it: Quando è abilitata la visualizzazione delle miniature, i file agganciati ai record saranno mostrati nel modulo "Web > Lista" come questo.
ru: При включении отображения эскизов, файлы, прикрепленные к записям будут отображаться в модулях, подобных "Веб > Список".

# option_startModule.alttitle
source: Start module
it: Modulo di avvio
ru: Стартовый модуль

# option_startModule.description
source: Let you select the module that is called when you login in the Backend The default module is "About Modules".
it: Seleziona il modulo che è visualizzato quando effettui il login al backend. Il modulo di default è "About Modules"
ru: Возможно выбрать модуль, загружаемый при входе во внутренний интерфейс. По умолчанию загружается модуль "О модулях"

# reset.alttitle
source: Reset all Values to default
it: Resetta ai valori di default
ru: Сброс значений к значениям по умолчанию

# reset.description
source: If you select this option all settings in this module will be reset to the default settings of the system.
it: Se si seleziona questa opzione, tutti i settaggi di questo modulo saranno ripristinati ai valori di default del sistema.
ru: Этот параметр сбрасывает все настройки к значениям по умолчанию.

# reset.details
source: This does not apply to user name, email and password settings of course.
it: Questa operazione non modifica il nome utente, l'email e la password.
ru: Это конечно не затронет имя пользователя, его email и пароль.

# simuser.alttitle
source: Simulate backend user
it: Simula utente backend
ru: Имитация внутреннего пользователя

# simuser.description
source: This option allows "admin"-users to change settings for another backend user in the system.
it: Questa opzione permette agli utenti "admin" di cambiare i settaggi di un altro utente backend nel sistema.
ru: Этот параметр позволяет пользователям-администраторам изменить настройки, имитируя другого внутреннего пользователя системы.

# _.seeAlso
source: User TSconfig SETUP | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Setup/Index.html
it: TSconfig Utente | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/Setup/Index.html
