Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/ext/flatmgr/pi1/*.locallang.xlf
Languages: de

source: vacant day
de: frei

source: vacant weekend
de: freies Wochenende

source: bookedDay
de: gebucht

source: booked weekend
de: gebuchtes Wochenende

# Jan
source: January
de: Januar

# Feb
source: February
de: Februar

# Mar
source: March
de: März

source: May
de: Mai

# Jun
source: June
de: Juni

# Jul
source: July
de: Juli

# Oct
source: October
de: Oktober

# Dec
source: December
de: Dezember

# Tue
source: T
de: D

# Wed
source: W
de: M

# Thu
source: T
de: D

# availableFlats
source: vacation flats
de: Ferienwohnungen

source: edit booking
de: Buchungen editieren

# bookingDataOf
source: Booking data of flat
de: Buchungen der Ferienwohnung

# date from
source: from
de: vom

# date to
source: until
de: bis

# insert booking
source: New booking
de: Neue Buchung

# insert flat
source: New flat
de: Neue Ferienwohnung

# insert room
source: New room
de: Neues Zimmer

source: delete this booking record
de: Buchungsatz löschen

source: to the bookings
de: zu den Buchungen

source: save record
de: speicher diesen Datensatz

source: edit record
de: editiere diesen Datensatz

source: rebook record
de: Umbuchen

source: delete record
de: Lösche diesen Datensatz

source: back to the flats
de: Zurück zur Ferienwohnungsliste

source: availability check
de: Buchungsanfrage

# startOfBooking
source: arrival
de: Anreise:

# endOfBooking
source: departure
de: Abreise:

# allFlatCategories
source: all categories
de: Alle

# flatCategory
source: Category
de: Kategorie

# availableFlatsHeader
source: Available Flats for the time
de: Verfügbare Ferienwohnung(en) für den Zeitraum

# availableFrom
source: from:
de: vom

# availableTo
source: to:
de: bis

source: Booked from:
de: gebucht von:

# no available flat
source: No available flat(s) for the desired time available!
de: Keine Ferienwohnung(en) für den gewünschten Zeitraum verfügbar!

source: next vacant period
de: Nächste Buchungsmöglichkeit

# foreignFlats
source: available flats of other sites
de: Weitere verfügbare Ferienwohnungen

source: available flat
de: Verfügbar

source: available foreign flat
de: Extern Verfügbar

source: available rooms
de: Zimmer

source: next foreign vacant period
de: Nächste externe Buchungsmöglichkeit

# deleteFlatConfirmation
source: Delete the data record of flat
de: Lösche den Datensatz der Ferienwohnung

# deleteRoomConfirmation
source: Delete the data record
de: Lösche den Datensatz

# deleteBookingConfirmation
source: Delete the data record of booking from
de: Lösche den Buchungsdatensatz vom

source: overbooked
de: Tag überbucht

source: bookingCalendar
de: Buchungskalender

source: booking request
de: Buchungsanfrage

source: utilisation calendar
de: Auslastungskalender

source: all flats
de: alle Ferienwohnungen

source: toggle additional fields
de: zusätzliche Felder

source: customernumber:
de: Kundennummer

# grownups
source: number of grownups
de: Anzahl Erwachsene

# childs
source: number of children
de: Anzahl Kinder

source: Agent
de: Vermittler

# newBookingHeader
source: Insert new booking
de: Neue Buchung erfassen

source: New booking inserted
de: Die neue Buchung wurde gespeichert

# bookingRecordDeleted
source: Booking record has been deleted!
de: Der Buchungsdatensatz wurde gelöscht!

source: category
de: Kategorie

# bookedBy
source: booked from
de: Gebucht von

# flatCapacity
source: Capacity [persons]
de: Personenanzahl

# roomCapacity
source: Capacity [persons]
de: Personenanzahl

source: Name of the flat
de: Name der Ferienwohnung

source: Name of the room
de: Zimmername

source: rebook
de: Umbuchen

# rebooking header
source: Rebooking
de: Umbuchung der Buchung

source: from
de: vom

source: to
de: bis

# on
source: on to
de: auf

source: Customer
de: Kunde

# illegaleCharacters
source: Illegale character in
de: Illegale Zeichen in

source: Room
de: Zimmer

source: Edit rooms
de: Zimmer editieren

source: Rooms of
de: Zimmer von

# showRooms
source: Show all rooms
de: Zeige alle Zimmer

source: HideRooms
de: Verberge zusätzliche Zimmer

source: Flat
de: Ferienwohnungen

source: Bungalow
de: Bungalows/Villen

source: Living space
de: Nutzfläche

source: Landarea
de: Grundstücksfläche

# capacityText
source: Persons
de: Anzahl Personen

# Pool
source: Swimmingpool
de: Pool

source: Landing
de: Bootsanlegeplatz

# PetsAllowed
source: Pets on request
de: Haustiere auf Anfrage

source: Beach
de: Strand

source: Handicapped accessible
de: Behindertengerecht

source: Internet with costs
de: kostenpflichtiges Internet

# InternetFree
source: Internet without costs
de: Internet kostenfrei

source: Airconditioner
de: Klimanalge

source: Airconditioner with costs
de: kostenpflichtige Klimaanlage

# minPrice
source: from
de: ab

# minPriceUnit
source: €/Week
de: €/Woche

source: Week prices
de: Wochenpreise

source: Peakseason
de: Hauptsaison

source: Lowseason
de: Zwischensaison

source: Savingseason
de: Nebensaison

# arrivalDay
source: Arrival day in peakseason
de: An- und Abreisetag während der Hauptsaison

# Fr
source: Friday
de: Freitag

# Sa
source: Saturday
de: Samstag

# Su
source: Sunday
de: Sonntag

source: Caution
de: Kaution in bar bei Anreise

source: Additional
de: Zuzüglich

source: endcleaning
de: Endreinigung

# singleViewFooter
source: bedlinen and towels is to be bring along or can be rented. Costs per person: Bedlinen 12 euro towel package 10 euro baby-travel bed or childrens chair a`10.--/week or as "baby-travel-package" from our equipment with travel-bed/high chair and Buggy "Quinny" together 35.--/week more Services on order of request (pictures by service): GARMIN outdoor, Internet, BBQ
de: Optionale Zusatzleistungen: Siehe unter Service. Die abgebildete Bettwäsche auf den Fotos sind Beispiele aus unserem anmietbaren Sortiment

source: On request
de: auf Anfrage

# noSpecials
source: No Offers right now
de: Zu Zeit keine Angebote vorhanden

source: --> Back to list
de: --> Zurück zur Gesamtliste

source: Registered customer
de: Stammkundenrabatt 5%

source: Early bird rebate1
de: Frühbucherrabatt (Buchung vor Februar 5%)

source: Early bird rebate2
de: Frühbucherrabatt (Buchung vor März 3%)

# startOfCalculation
source: Booking start
de: Buchungsbegin

# endOfCalculation
source: Booking end
de: Buchungsende

source: Calculate now
de: Berechnen

source: Booking not available!
de: Buchung für diesen Zeitraum nicht verfügbar! Es existiert eine Buchung vom

source: Invalid dates
de: Ungültige Termine

# onlyOneEarlyBirdRebate
source: Please select only one early bird rebate!
de: Bitte nur einen Frühbucherrabatt auswählen!

# flatmgrcalcPrice
source: Total amount:
de: Gesamtpreis:

# storeClosed
source: Store closed on saturday and sunday!
de: Geschäft am Samstag und Sonntag geschlossen!

# deliveryTitle
source: Delivery
de: Übergabepauschale

# orderSelectorTotalWeight
source: Total weight
de: zul. Gesamtgewicht

# orderSelectorCapacity
source: Capacity
de: Personenanzahl

# orderSelectorMinPrice
source: Price
de: Preis

# noSeasonDataAvailable
source: No season data available for the selected year!
de: Keine Saisondaten für das gewählte Jahr verfügbar!

source: Delivery A
de: Pauschale A

source: Delivery B
de: Pauschale B

source: Delivery C
de: Pauschale C

# tentOption
source: book tent
de: Vorzelt buchen (99 €)

# flatmgrcalcOfficalPrice
source: Price
de: Preis

source: Booked not enough days!
de: Mindestmietdauer unterschritten!

source: Booked not enough whitsun days!
de: Mindestmietdauer für Pfingstenferien unterschritten!

source: Booked not enough summer days!
de: Mindestmietdauer für Sommerferien unterschritten!

# bookingMinDays
source: days min. booking
de: Tage Mindestmietdauer

# bookingMinDaysWhitsun
source: days min. booking whitsun
de: Tage Mindestmietdauer Pfingstferien

# bookingMinDaysSummer
source: days min. booking summer
de: Tage Mindestmietdauer Sommerferien

# lastMinuteRebate
source: Last minute booking
de: Last minute Buchung

# noCleaningOutside
source: without cleaning outside
de: Ohne Außenreinigung

# longTimeBookingRebate1
source: Longtime booking rebate 21 days
de: Langzeit Buchungsrabatt 21 Tage

# longTimeBookingRebate2
source: Longtime booking rebate 28 days
de: Langzeit Buchungsrabatt 28 Tage

source: Only one longtime booking rebate
de: Nur ein Langzeitbuchungstrabatt möglich

source: Follow up booking
de: Direkte Folgebuchung (10 € Rabatt, max. 1 Werktag Standzeit)
