Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/extensions/TableOperations/*.locallang_csh.xlf
Languages: ru

# TO_toggle_borders.details
source: Clicking the "Toggle borders" button makes the boundaries of all tables in the editing area visible or, if they are currently visible, the button being highlighted as active, hides these boundaries. This applies only when editing content and has no effect when the element is rendered in the frontend. This button may be configured so that it is activated when the element is opened for editing.
ru: По щелчку на кнопке "Переключить границы" границы всех таблиц в области редактирования становятся видны, либо, если они уже были видны, скрываются. Это влияет лишь на редактирование содержимого и не имеет никакого влияния на вывод содержимого на страницы сайта. Кнопку можно настроить так, чтобы она становилась активной, если элемент открывается для редактирования.

# TO_toggle_borders.image_descr
source: "Toggle borders" icon.
ru: Значок "Переключить границы".

# verticalAlignment.alttitle
source: Vertical alignment
ru: Вертикальная выключка

# verticalAlignment.description
source: Select the vertical alignment of content within a cell.
ru: Выберете вертикальную выключку содержимого внутри ячейки.

# Width_unit.alttitle
source: Width unit
ru: Единицы ширины

# Width_unit.description
source: Select the width unit.
ru: Выберете единицы для измерения ширины.
