Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/extensions/TableOperations/*.locallang_csh.xlf
Languages: ru

# .alttitle
source: htmlArea RTE > Table Operations
ru: htmlArea RTE > Табличные операции

# backgroundColor.alttitle
source: Background color
ru: Цвет фона

# backgroundColor.description
source: Select the color of the background.
ru: Выберете цвет фона.

# backgroundImage.alttitle
source: URL of background image
ru: URL для фонового изображения

# backgroundImage.description
source: Enter the URL of the background image.
ru: Введите URL фонового изображения.

# borderColor.alttitle
source: Border color
ru: Цвет границ

# borderColor.description
source: Select the border color.
ru: Выберете цвет границ.

# borderStyle.alttitle
source: Border style
ru: Стиль границ

# borderStyle.description
source: Select the border style.
ru: Выберете стиль границ.

# borderWidth.alttitle
source: Border width
ru: Ширина границ

# borderWidth.description
source: Enter the border width in pixels.
ru: Введите ширину границ в пикселях.

# caption.alttitle
source: Table caption
ru: Заголовок таблицы

# caption.description
source: Enter the description of the nature of the table.
ru: Введите описание таблицы.

# caption.details
source: The description entered in this field becomes the content of the table caption. By default, the table caption is center-aligned above a table.
ru: Введённое в это поле описание становится содержимым заголовка таблицы. По умолчанию заголовок таблицы выравнен по центру над таблицей.

# cellPadding.alttitle
source: Cell padding
ru: Поля ячейки

# cellPadding.description
source: Enter the numer of pixels of space between content and border in cells.
ru: Величина полей в пикселях, отделяющих границы ячеек от содержимого.

# cellSpacing.alttitle
source: Cell spacing
ru: Интервал между ячейками

# cellSpacing.description
source: Enter the numer of pixels of space between adjacent cells.
ru: Введите количество пикселей для интервала между смежными ячейками.

# Class_selector.alttitle
source: Style selector
ru: Блок выбора стиля

# Class_selector.description
source: Apply a style to the current element or remove the style that was last applied.
ru: Применяет стиль к текущему элементу или удаляет последний применённый стиль.

# collapsedBorders.alttitle
source: Collapsed borders
ru: Слитые границы

# collapsedBorders.description
source: Select whether table borders should be collapsed, detached or default.
ru: Выберете, должны ли границы ячеек таблицы быть слитыми, раздельными или по умолчанию.

# columnCellsType.alttitle
source: Type of cells
ru: Тип ячеек

# columnCellsType.description
source: Select the type of the cells of this column.
ru: Выбор типа ячеек текущего столбца.

# .description
source: This feature offers multiple tools for creating and editing tables in the RTE editing area.
ru: Этот функционал предлагает несколько инструментов для создания и правки таблиц в области редактирования RTE.

# .details
source: When this feature is enabled, an "Insert table" button is shown in the editor toolbar. A number of buttons may also appear, usually as the last line of the toolbar. The editor may also be configured so that table operations options appear only in the context menu. All buttons that may be configured are shown below.
ru: При включении, в панели инструментов выводится кнопка"Вставить таблицу". Обычно в нижней части панели могут появится ещё несколько кнопок. Можно настроить редактор так, чтобы параметры для работы с таблицами выводились лишь в контекстном меню. Ниже показаны все кнопки, которые возможно настроить.

# frames.alttitle
source: Frames
ru: Рамки

# frames.description
source: Select which sides should have a border.
ru: Выберете, с каких сторон должны быть видны границы.

# Height_unit.alttitle
source: Height unit
ru: Единицы высоты

# Height_unit.description
source: Select the height unit.
ru: Выберете единицы для измерения высоты.

# .image_descr
source: "Insert table" icon. Clicking it opens a dialogue that allows to insert a table at the current cursor position. "Table properties" icon. When the cursor is inside a table, clicking it opens a dialogue that allows to edit the properties of the table. "Re-apply table styles" icon. When the cursor is inside a table, clicking it re-calculates the odd/even and counting styles of the table. "Toggle borders" icon. Clicking it shows or hides the borders of all tables in the editing area. "Row properties" icon. When the cursor is inside a table row, clicking it opens a dialogue that allows to edit the properties of the row. "Insert row before" icon. When the cursor is inside a table row, clicking it inserts a new row above this row. "Insert row after" icon. When the cursor is inside a table row, clicking it inserts a new row below this row. "Delete row" icon. When the cursor is inside a table row, clicking it deletes the row from table. "Split row" icon. When the cursor is inside a table cell that was merged over two or more rows, clicking it splits the cell into as many rows as were merged. "Column cells properties" icon. When the cursor is inside a table column, clicking it opens a dialogue that allows to edit the properties of the cells of the column. "Insert column before" icon. When the cursor is inside a table column, clicking it inserts a new column to the left of this column. "Insert column after" icon. When the cursor is inside a table column, clicking it inserts a new column to the right of this column. "Delete column" icon. When the cursor is inside a table column, clicking it deletes the column from the table. "Split column" icon. When the cursor is inside a table cell that was merged over two or more columns, clicking it splits the cell into as many columns as were merged. "Cell properties" icon. When the cursor is inside a table cell, clicking it opens a dialogue that allows to edit the properties of the cell. "Insert cell before" icon. When the cursor is inside a table cell, clicking it inserts a new column to the left of this cell. "Insert cell after" icon. When the cursor is inside a table cell, clicking it inserts a new column to the right of this cell. "Delete cell" icon. When the cursor is inside a table cell, clicking it deletes the cell from the table. "Split cell" icon. When the cursor is inside a table cell that was merged over columns and rows, clicking it splits the cell into as many rows and columns as were merged. "Merge cells" icon. When some table cells are selected, clicking it merges the cells into one cell.
ru: Значок "Вставить таблицу". По щелчку открывается диалог вставки таблицы в позиции курсора. Значок "Свойства таблицы". Если курсор находится внутри таблицы, щелчок открывает диалог правки свойств таблицы. Значок "Повторная стилизация таблицы". Если курсор находится внутри таблицы, по щелчку производится рекалькуляция нечётных/чётных и подсчитываемых стилей таблицы. Значок "Переключить границы". По щелчку выводятся или скрываются рамки всех таблиц в области редактирования. Значок "Свойства строки". Если курсор находится внутри строки таблицы, по щелчку открывается диалог правки свойств строки. Значок "Вставить строку перед". Если курсор находится внутри строки таблицы, по щелчку вставляется новая строка над текущей. Значок "Вставить строку после". Если курсор находится внутри строки таблицы, по щелчку вставляется новая строка под текущей. Значок "Удалить строку". Если курсор находится внутри строки таблицы, по щелчку эта строка удаляется. Значок "Разбить строку". Если курсор находится внутри ячейки таблицы, по щелчку строка разбивается на две. Значок "Свойства столбца". Если курсор находится внутри столбца таблицы, по щелчку открывается диалог правки свойств столбца. Значок "Вставить столбец перед". Если курсор находится внутри столбца таблицы, по щелчку вставляется новый столбец перед текущим. Значок "Вставить столбец после". Если курсор находится внутри столбца таблицы, по щелчку вставляется новый столбец после текущего. Значок "Удалить столбец". Если курсор находится внутри столбца таблицы, по щелчку этот столбец удаляется. Значок "Разбить столбец". Если курсор находится внутри ячейки таблицы, по щелчку столбец разбивается на два. Значок "Свойства ячейки". Если курсор находится внутри ячейки таблицы, по щелчку открывается диалог правки свойств ячейки. Значок "Вставить ячейку перед". Если курсор находится внутри ячейки таблицы, по щелчку вставляется новая ячейка перед текущей. Значок "Вставить ячейку после". Если курсор находится внутри ячейки таблицы, по щелчку вставляется новая ячейка после текущей. Значок "Удалить ячейку". Если курсор находится внутри ячейки таблицы, по щелчку эта ячейка удаляется. Значок "Разбить ячейку". Если курсор находится внутри ячейки таблицы, по щелчку ячейка разбивается на две. Значок "Слить ячейки". Если выбраны смежные ячейки таблицы, по щелчку они сливаются в одну.

# InsertTable.alttitle
source: Insert table
ru: Вставить таблицу

# InsertTable.description
source: Create a new table and insert it into the editing area.
ru: Создаётся новая таблица внутри области редактирования.

# InsertTable.details
source: Clicking the "Table properties" button opens a dialogue window that allows to create a new table and insert it into the editing area at the current cursor position.
ru: Щелчок по кнопке "Вставить таблицу" открывает диалог создания новой таблицы, которая помещается в области редактирования по местоположению курсора.

# InsertTable.image_descr
source: "Insert table" icon.
ru: Значок "Вставить таблицу".

# numberOfColumns.alttitle
source: Number of columns
ru: Количество столбцов

# numberOfColumns.description
source: Enter the number of columns of the table to be created.
ru: Введите количество столбцов для вновь создаваемой таблицы.

# numberOfColumns.details
source: Enter in this field the number of columns that the table should have when it is created.
ru: Введите в это поле количество столбцов для вновь создаваемой таблицы.

# numberOfRows.alttitle
source: Number of rows
ru: Количество строк

# numberOfRows.description
source: Enter the number of rows of the table to be created.
ru: Введите количество строк создаваемой таблицы.

# numberOfRows.details
source: Enter in this field the number of rows that the table should have when it is created.
ru: Введите в это поле количество строк для вновь создаваемой таблицы.

# rowGroup.alttitle
source: Row group
ru: Группировка строк

# rowGroup.description
source: Select to which table part this row should belong.
ru: Выберете, к какой части таблицы должна относиться эта строка.

# rowGroup.details
source: The row may belong either to the header, body or footer of the table.
ru: Строка может относится к заголовку, телу или итоговой части таблицы.

# Row_height.alttitle
source: Row height
ru: Высота строки

# Row_height.description
source: Enter the row height using the selected height unit.
ru: Введите высоту строки в выбранных единицах измерения.

# Row_width.alttitle
source: Row width
ru: Ширина строки

# Row_width.description
source: Enter the row width using the selected width unit.
ru: Введите ширину строки в выбранных единицах измерения.

# rules.alttitle
source: Rules
ru: Правила

# rules.description
source: Select where rules should be displayed.
ru: Выберете, где должны отображаться правила.

# summary.alttitle
source: Table summary
ru: Сводка по таблице

# summary.description
source: Enter a summary of the table purpose and structure.
ru: Введите сводную информацию по целям и структуре таблицы.

# Table_body_class_selector.alttitle
source: Table body style selector
ru: Блок выбора стиля тела таблицы

# Table_body_class_selector.description
source: Apply a style to the body part of the table or remove the style that was last applied.
ru: Применяет стиль к телу таблицы или удаляет последний применённый стиль.

# Table_class_selector.alttitle
source: Table style selector
ru: Блок выбора стиля таблицы

# Table_class_selector.description
source: Apply a style to the table or remove the style that was last applied.
ru: Применяет стиль к таблице или удаляет последний применяемый стиль.

# tableFloat.alttitle
source: Table float
ru: Обтекание таблицы

# tableFloat.description
source: Select whether and how the table should float.
ru: Выберете, должна ли таблица быть плавающей, и, если да, то как.

# Table_footer_class_selector.alttitle
source: Table footer style selector
ru: Блок выбора стиля итоговой части таблицы

# Table_footer_class_selector.description
source: Apply a style to the footer part of the table or remove the style that was last applied.
ru: Применяет стиль к итоговой части таблицы или удаляет последний применённый стиль.

# Table_header_class_selector.alttitle
source: Table header style selector
ru: Блок выбора стиля заголовка таблицы

# Table_header_class_selector.description
source: Apply a style to the header part of the table or remove the style that was last applied.
ru: Применяет стиль к заголовку таблицы или удаляет последний применённый стиль.

# tableHeaders.alttitle
source: Header cells
ru: Ячейки заголовки

# tableHeaders.description
source: Select the location of table header cells.
ru: Выберете местоположение ячеек-заголовков для таблицы.

# tableHeaders.details
source: By selecting an option from the list, specify whether the table should have header cells and where they should be located. The options are: 1. No header cells: the table will not have any header cells 2. Header cells on top: only the cells of the topmost row will be header cells and this row will belong to the header part of the table 3. Header cells on left: only the cells of the leftmost column will be header cells 4. Header cells on top and left: the second and third option will both apply.
ru: Выбранный из списка параметр определяет, нужны ли таблице ячейки-заголовки, и, если да, то где они должны находиться. Возможны варианты: 1. Без заголовков: таблица не будет иметь никаких ячеек-заголовков 2. Заголовки вверху: заголовками станут ячейки верхней строки 3. Заголовки слева: заголовками станут ячейки левой строки 4. Заголовки вверху и слева: объединение второго и третьего параметров выше.

# Table_height.alttitle
source: Table height
ru: Высота таблицы

# Table_height.description
source: Enter the table height using the selected height unit.
ru: Высота таблицы в выбранных единицах изменения.

# tableStyle.alttitle
source: Table styles
ru: Стили таблицы

# tableStyle.description
source: Apply stlyles to the table and to its parts.
ru: К таблице или её частям применяется стилизация.

# tableStyle.details
source: The "Style" fieldset allows to apply styles to the table and to each of the table parts, i.e. header, body and footer. A selector is displayed for each part that exists in the current table.
ru: Набор полей "Стиль" позволяет стилизовать таблицу и каждую из её частей, например, заголовок, тело или итоговую часть. Для каждой из существующей частей текущей таблицы выводится блок выбора.

# Table_width.alttitle
source: Table width
ru: Ширина таблицы

# Table_width.description
source: Enter the table width using the selected width unit.
ru: Ширина таблицы в выбранных единицах изменения.

# textAlignment.alttitle
source: Text alignment
ru: Выключка текста

# textAlignment.description
source: Select the vertical alignment of text within a cell.
ru: Выберете вертикальную выключку текста в ячейке.

# textColor.alttitle
source: Text color
ru: Цвет текста

# textColor.description
source: Select the color of the text.
ru: Выберете цвет для текста.

# TO_col_prop.alttitle
source: Column cells properties
ru: Свойства ячеек столбца

# TO_col_prop.description
source: Edit the properties of the cells of the table column in which the cursor is currently positioned.
ru: Правка свойств ячеек столбца таблицы, в которых находился курсор.

# TO_col_prop.details
source: Clicking the "Column cells properties" button opens a dialogue window that allows to edit the properties of the cells of the table column in which the cursor is currently positioned. The values of the properties will be applied to all the cells of the column.
ru: Щелчок по кнопке "Свойства ячеек столбца" открывает диалог правки свойств ячеек таблицы, в которых был помещён курсор. Значения свойств будут распространяться на все ячейки столбца.

# TO_col_prop.image_descr
source: "Column cells properties" icon.
ru: Значок "Свойства ячеек столбца"

# TO_column_insert_before.alttitle
source: Insert column before
ru: Вставить столбец перед

# TO_column_insert_before.description
source: Insert a new column to the left the current table column.
ru: Вставка нового столбца слева от текущего.

# TO_column_insert_before.image_descr
source: "Insert column before" icon.
ru: Значок "Вставить столбец перед"

# TO_row_delete.alttitle
source: Delete row
ru: Удалить строку

# TO_row_delete.description
source: Delete the current table row.
ru: Удаление текущей строки таблицы.

# TO_row_delete.details
source: Clicking the "Delete row" button deletes the table row in which the cursor is currently positioned. If the deleted row was the last row of a part of the table, i.e. header, body or footer, then this part of the table is also deleted. If the deleted row was the last row of the table, then the table is deleted.
ru: Щелчок по кнопке "Удалить строку" удалит строку таблицы, в которой в текущий момент находится курсор. Если удаляемая строка была последней в одной из частей таблицы, например, заголовка, тела или итогов, то и эта часть также удаляется. Если удаляемая строка была последней в таблице, то удаляется и вся таблица.

# TO_row_delete.image_descr
source: "Delete row" icon.
ru: Значок "Удалить строку".

# TO_row_insert_above.alttitle
source: Insert row before
ru: Вставить строку перед

# TO_row_insert_above.description
source: Insert a new row above the current table row.
ru: Вставка новой строки над текущей строкой таблицы.

# TO_row_insert_above.details
source: Clicking the "Insert row before" button inserts a new row above the table row in which the cursor is currently positioned. The new row is of the same type, i.e. header or data, as the row in which the cursor is currently positioned, belongs to the same part of the table, i.e. header, body or footer, and has the same properties. The cells of the new row also have the same properties as the corresponding cells of the row in which the cursor is currently positioned.
ru: Щелчок по кнопке "Вставить строку перед" добавляет новую строку над той, в которой находится курсор. Новая строка имеет тот же тип, то есть заголовок или данные, что и строка, в которой находится курсор и относится к той же части таблицы, то есть - к заголовку, телу или итогам, и имеет те же свойства. Ячейки новой строки имеют те же свойства, что и соответствующие ячейки строки, в которой находится курсор.

# TO_row_insert_above.image_descr
source: "Insert row before" icon.
ru: Значок "Вставить строку перед".

# TO_row_insert_under.alttitle
source: Insert row after
ru: Вставить строку после

# TO_row_insert_under.description
source: Insert a new row after, or below, the current table row.
ru: Добавляет новую строку после или ниже текущей строки таблицы.

# TO_row_insert_under.details
source: Clicking the "Insert row after" button inserts a new row after, or below, the table row in which the cursor is currently positioned. The new row is of the same type, i.e. header or data, as the row in which the cursor is currently positioned, belongs to the same part of the table, i.e. header, body or footer, and has the same properties. The cells of the new row also have the same properties as the corresponding cells of the row in which the cursor is currently positioned.
ru: Щелчок по кнопке "Вставить строку после" добавляет новую строку под той, в которой находится курсор. Новая строка имеет тот же тип, то есть заголовок или данные, что и строка, в которой находится курсор и относится к той же части таблицы, то есть - к заголовку, телу или итогам, и имеет те же свойства. Ячейки новой строки имеют те же свойства, что и соответствующие ячейки строки, в которой находится курсор

# TO_row_insert_under.image_descr
source: "Insert row after" icon.
ru: Значок "Вставить строку после".

# TO_row_prop.alttitle
source: Row properties
ru: Свойства строки

# TO_row_prop.description
source: Edit the properties of the table row in which the cursor is currently positioned.
ru: Правка свойств строки таблицы, в которой на текущий момент находится курсор.

# TO_row_prop.details
source: Clicking the "Row properties" button opens a dialogue window that allows to edit the properties of the table row in which the cursor is currently positioned.
ru: По щелчку на кнопке "Свойства строки" открывается диалог правки свойств строки таблицы, в которой на текущий момент расположен курсор.

# TO_row_prop.image_descr
source: "Row properties" icon.
ru: Значок "Свойства строки".

# TO_row_split.alttitle
source: Split row
ru: Разбить строку

# TO_row_split.description
source: Split a table cell that was merged over two or more rows.
ru: Разбивает объединённую до этого ячейку на две или более строки.

# TO_row_split.details
source: When the cursor is inside a table cell that was merged over two or more rows, clicking the "Split row" button splits the cell into as many rows as were merged.
ru: Если курсор находится внутри ячейки таблицы, занимающей пространство двух или более строк, щелчок по кнопке "Разбить строку" приведёт к разбиению ячейки на несколько строк.

# TO_row_split.image_descr
source: "Split row" icon.
ru: Значок "Разбить строку"

# TO_table_prop.alttitle
source: Table properties
ru: Свойства таблицы

# TO_table_prop.description
source: Edit the properties of the table in which the cursor is currently positioned.
ru: Правка свойств таблицы, в которой на текущий момент находится курсор.

# TO_table_prop.details
source: Clicking the "Table properties" button opens a dialogue that allows to edit the properties of the table in which the cursor is currently positioned.
ru: По щелчку на кнопке "Свойства таблицы" открывается диалог правки свойств таблицы, в которой на текущий момент находится курсор.

# TO_table_prop.image_descr
source: "Table properties" icon.
ru: Значок "Свойства таблицы".

# TO_table_restyle.alttitle
source: Re-apply table styles
ru: Повторно применить стили к таблице

# TO_table_restyle.description
source: Re-apply odd/even and/or counting styles to the table in which the cursor is currently positioned.
ru: Переназначение нечётных/чётных и/или подсчитываемых стилей к таблице, в которой на текущий момент находится курсор.

# TO_table_restyle.details
source: If odd/even and/or counting styles have been applied to the table in which the cursor is currently positioned, some table operations may have broken the layout of the table. Clicking the "Re-apply table styles" button will re-calculate the odd/even and the counting styles, and re-apply the styles to the rows and/or columns of the table.
ru: Если к таблице, в которой на текущий момент находится курсор, были применены стили нечётные/чётные или подсчитываемые, то некоторые операции с таблице могут нарушить макет таблицы. Щёлкните по кнопке "Переназначение стилей таблицы" для рекалькуляции нечётных/чётных и подсчитываемых стилей для строк и столбцов.

# TO_table_restyle.image_descr
source: "Re-apply table styles" icon.
ru: Значок "Переназначение стилей таблицы".

# TO_toggle_borders.alttitle
source: Toggle borders
ru: Переключить границы

# TO_toggle_borders.description
source: Show/hide the borders of all tables in the editing area.
ru: Показать/скрыть границы для всех таблиц в области редактирования.
