Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/CharacterMap/*.locallang.xlf
Languages: ru

# #064
source: At
ru: знак обезьянка (собачка)

# aacute
source: Small a with acute accent
ru: латинская строчная буква А с острым ударением

# Aacute
source: Capital a with acute accent
ru: латинская заглавная буква А с острым ударением

# acirc
source: Small a with circumflex accent
ru: латинская строчная буква А с циркумфлексом (диакритический знак над гласной)

# Acirc
source: Capital a with circumflex accent
ru: латинская заглавная буква А с циркумфлексом (диакритический знак над гласной)

# acute
source: Spacing acute
ru: знак ударения

# aelig
source: Small ligature ae
ru: латинские строчные символы AE

# AElig
source: Capital ligature ae
ru: латинские заглавные символы AE

# agrave
source: Small a with grave accent
ru: латинская строчная буква А с тупым ударением

# Agrave
source: Capital a with grave accent
ru: латинская заглавная буква А с тупым ударением

# alefsym
source: Alef (first transfinite cardinal)
ru: алеф (первая буква семитских алфавитов)

# alpha
source: Greek small letter alpha
ru: греческая строчная буква альфа

# Alpha
source: Greek capital letter alpha
ru: греческая заглавная буква альфа

# and
source: Logical and
ru: логическое И

# ang
source: Angle
ru: угол

# aring
source: Small a with ring
ru: латинская строчная буква А с верхним кружком

# Aring
source: Capital a with ring
ru: латинская заглавная буква А с верхним кружком

# asymp
source: Almost equal to, asymptotic to
ru: асимптотически равно

# atilde
source: Small a with tilde
ru: латинская строчная буква А с тильдой

# Atilde
source: Capital a with tilde
ru: латинская заглавная буква А с тильдой

# auml
source: Small a with umlaut/diaeresis
ru: латинская строчная буква А с тремой (знак над гласной для произнесения ее отдельно от предшествующей гласной)

# Auml
source: Capital a with umlaut/diaeresis
ru: латинская заглавная буква А с тремой (знак над гласной для произнесения ее отдельно от предшествующей гласной)

# bdquo
source: Double low-9 quotation mark
ru: нижняя двойная кавычка

# beta
source: Greek small letter beta
ru: греческая строчная буква бета

# Beta
source: Greek capital letter beta
ru: греческая заглавная буква бета

# brvbar
source: Broken vertical bar
ru: разорванная вертикальная черта

# bull
source: Bullet
ru: маленький черный кружок

# cap
source: Intersection
ru: пересечение

# ccedil
source: Small c with cedilla
ru: латинская строчная буква C с седилем

# Ccedil
source: Capital c with cedilla
ru: латинская заглавная буква C с седилем

# cedil
source: Spacing cedilla
ru: седиль (орфографический знак)

source: Cent
ru: цент

# CharacterMapTooltip
source: Insert special character
ru: Вставить специальный символ

# chi
source: Greek small letter chi
ru: греческая строчная буква хи

# Chi
source: Greek capital letter chi
ru: греческая заглавная буква хи

# circ
source: Modifier letter circumflex accent
ru: символ циркумфлекса (диакритический знак над гласной)

source: Close
ru: Закрыть

# clubs
source: Club
ru: трефы

# cong
source: Congruent to
ru: приблизительно равно

# copy
source: Copyright
ru: знак авторского права

# crarr
source: Carriage return arrow
ru: возврат каретки

# cup
source: Union
ru: объединение

# curren
source: Currency
ru: денежная единица

source: Dagger
ru: кинжал

# Dagger
source: Double dagger
ru: двойной кинжал

# darr
source: Downwards arrow
ru: стрелка вниз

# dArr
source: Downwards double arrow
ru: двойная стрелка вниз

# deg
source: Degree
ru: градус

# delta
source: Greek small letter delta
ru: греческая строчная буква дельта

# Delta
source: Greek capital letter delta
ru: греческая заглавная буква дельта

# diams
source: Diamond
ru: бубны

# divide
source: Division
ru: знак деления

# eacute
source: Small e with acute accent
ru: латинская строчная буква E с острым ударением

# Eacute
source: Capital e with acute accent
ru: латинская заглавная буква E с острым ударением

# ecirc
source: Small e with circumflex accent
ru: латинская строчная буква E с циркумфлексом (диакритический знак над гласной)

# Ecirc
source: Capital e with circumflex accent
ru: латинская заглавная буква E с циркумфлексом (диакритический знак над гласной)

# egrave
source: Small e with grave accent
ru: латинская строчная буква E с тупым ударением

# Egrave
source: Capital e with grave accent
ru: латинская заглавная буква E с тупым ударением

# empty
source: Empty set
ru: пустое множество

# emsp
source: Em space
ru: длинный пробел

# ensp
source: En space
ru: короткий пробел

# epsilon
source: Greek small letter epsilon
ru: греческая строчная буква эпсилон

# Epsilon
source: Greek capital letter epsilon
ru: греческая заглавная буква эпсилон

# equiv
source: Equivalent
ru: тождественно равно

# eta
source: Greek small letter eta
ru: греческая строчная буква эта

# Eta
source: Greek capital letter eta
ru: греческая заглавная буква эта

# eth
source: Small eth, Icelandic
ru: латинские строчные символы ETH

# ETH
source: Capital eth, Icelandic
ru: латинские заглавные символы ETH

# euml
source: Small e with umlaut/diaeresis
ru: латинская строчная буква E с тремой

# Euml
source: Capital e with umlaut/diaeresis
ru: латинская заглавная буква E с тремой

source: Euro
ru: евро

# exist
source: There exists
ru: квантор существования

# fnof
source: Function
ru: курсивное f (функция)

source: For all
ru: квантор всеобщности

# frac12
source: Fraction 1/2
ru: дробь - одна вторая

# frac14
source: Fraction 1/4
ru: дробь - одна четверть

# frac34
source: Fraction 3/4
ru: дробь - три четверти

# frasl
source: Fraction slash
ru: косая дробная черта

# gamma
source: Greek small letter gamma
ru: греческая строчная буква гамма

# Gamma
source: Greek capital letter gamma
ru: греческая заглавная буква гамма

# ge
source: Greater than or equal to
ru: больше или равно

source: General
ru: Общее

# graphical
source: Shapes and arrows
ru: Формы и стрелки

# harr
source: Left right arrow
ru: стрелка влево-вправо

# hArr
source: Left right double arrow
ru: двойная стрелка влево-вправо

# hearts
source: Heart
ru: червы

# hellip
source: Horizontal ellipsis
ru: многоточие

source: HTML value:
ru: Значение HTML:

# iacute
source: Small i with acute accent
ru: латинская строчная буква I с острым ударением

# Iacute
source: Capital i with acute accent
ru: латинская заглавная буква I с острым ударением

# icirc
source: Small i with circumflex accent
ru: латинская строчная буква I с циркумфлексом

# Icirc
source: Capital i with circumflex accent
ru: латинская заглавная буква I с циркумфлексом

# iexcl
source: Inverted exclamation mark
ru: перевернутый восклицательный знак

# igrave
source: Small i with grave accent
ru: латинская строчная буква I с тупым ударением

# Igrave
source: Capital i with grave accent
ru: латинская заглавная буква I с тупым ударением

# image
source: Imaginary part of complex number
ru: мнимая часть комплексного числа

# infin
source: Infinity
ru: бесконечность

# InsertCharacter-Tooltip
source: Insert special character
ru: Вставить специальный символ

# InsertSoftHyphen-Tooltip
source: Insert soft hyphen
ru: Вставить мягкий перенос

source: Insert special character
ru: Вставить специальный символ

# int
source: Integral
ru: интеграл

# iota
source: Greek small letter iota
ru: греческая строчная буква иота

# Iota
source: Greek capital letter iota
ru: греческая заглавная буква иота

# iquest
source: Inverted question mark
ru: перевернутый вопросительный знак

# isin
source: Is element of
ru: принадлежит множеству

# iuml
source: Small i with umlaut/diaeresis
ru: латинская строчная буква I с тремой

# Iuml
source: Capital i with umlaut/diaeresis
ru: латинская заглавная буква I с тремой

# kappa
source: Greek small letter kappa
ru: греческая строчная буква каппа

# Kappa
source: Greek capital letter kappa
ru: греческая заглавная буква каппа

# lambda
source: Greek small letter lambda
ru: греческая строчная буква лямбда

# Lambda
source: Greek capital letter lambda
ru: греческая заглавная буква лямбда

# laquo
source: Left angle quotation mark
ru: левая двойная угловая скобка

# larr
source: Leftwards arrow
ru: стрелка влево

# lArr
source: Leftwards double arrow
ru: двойная стрелка влево

# ldquo
source: Left double quotation mark
ru: левая двойная кавычка

# le
source: Less than or equal to
ru: меньше или равно

# lowast
source: Asterisk operator
ru: оператор звездочка

# loz
source: Lozenge
ru: ромб

# lsaquo
source: Single left angle quotation
ru: открывающая угловая кавычка

# lsquo
source: Left single quotation mark
ru: левая одиночная кавычка

source: Mathematical
ru: Математические

# mdash
source: Em dash
ru: длинное тире

source: Micro
ru: микро

# minus
source: Minus sign
ru: знак минус

# mu
source: Greek small letter mu
ru: греческая строчная буква мю

# Mu
source: Greek capital letter mu
ru: греческая заглавная буква мю

# nabla
source: Gradient
ru: набла

# nbsp
source: Non-breaking space
ru: неразрывный пробел

# ndash
source: En dash
ru: тире

# ne
source: Not equal to
ru: не равно

# ni
source: Contains as member
ru: является членом

# not
source: Negation
ru: знак отрицания

# notin
source: Is not an element of
ru: не принадлежит множеству

# nsub
source: Not subset of
ru: не подмножество

# ntilde
source: Small n with tilde
ru: латинская строчная буква N с тильдой

# Ntilde
source: Capital n with tilde
ru: латинская заглавная буква N с тильдой

# nu
source: Greek small letter nu
ru: греческая строчная буква ню

# Nu
source: Greek capital letter nu
ru: греческая заглавная буква ню

# oacute
source: Small o with acute accent
ru: латинская строчная буква O с острым ударением

# Oacute
source: Capital o with acute accent
ru: латинская заглавная буква O с острым ударением

# ocirc
source: Small o with circumflex accent
ru: латинская строчная буква O с циркумфлексом

# Ocirc
source: Capital o with circumflex accent
ru: латинская заглавная буква O с циркумфлексом

# oelig
source: Small ligature OE
ru: латинские строчные символы OE

# OElig
source: Capital ligature OE
ru: латинские заглавные символы OE

# ograve
source: Small o with grave accent
ru: латинская строчная буква O с тупым ударением

# Ograve
source: Capital o with grave accent
ru: латинская заглавная буква O с тупым ударением

# omega
source: Greek small letter omega
ru: греческая строчная буква омега

# Omega
source: Greek capital letter omega
ru: греческая заглавная буква омега

# omicron
source: Greek small letter omicron
ru: греческая строчная буква омикрон

# Omicron
source: Greek capital letter omicron
ru: греческая заглавная буква омикрон

# oplus
source: Direct sum
ru: прямая сумма

# or
source: Logical or
ru: логическое ИЛИ

# ordf
source: Feminine ordinal indicator
ru: женский порядковый числитель

# ordm
source: Masculine ordinal indicator
ru: мужской порядковый числитель

# oslash
source: Small o with slash
ru: латинская строчная буква O со штрихом

# Oslash
source: Capital o with slash
ru: латинская заглавная буква O со штрихом

# otilde
source: Small o with tilde
ru: латинская строчная буква O с тильдой

# Otilde
source: Capital o with tilde
ru: латинская заглавная буква O с тильдой

# otimes
source: Vector product
ru: векторное произведение

# ouml
source: Small o with umlaut/diaeresis
ru: латинская строчная буква O с тремой

# Ouml
source: Capital o with umlaut/diaeresis
ru: латинская заглавная буква O с тремой

# para
source: Paragraph
ru: символ параграфа

# part
source: Partial differential
ru: знак дифференциала

# permil
source: Per mille
ru: знак промилле

# perp
source: Orthogonal to, perpendicular to
ru: перпендикулярно

# phi
source: Greek small letter phi
ru: греческая строчная буква фи

# Phi
source: Greek capital letter phi
ru: греческая заглавная буква фи

# pi
source: Greek small letter pi
ru: греческая строчная буква пи

# Pi
source: Greek capital letter pi
ru: греческая заглавная буква пи

# piv
source: Greek pi symbol
ru: греческий символ пи

# plusmn
source: Plus-or-minus sign
ru: знак плюс-минус

source: Pound
ru: фунт стерлингов

# prime
source: Prime, minutes, feet
ru: одиночный штрих - минуты и футы

# Prime
source: Double prime, seconds, inches
ru: двойной штрих - секунды и дюймы

# prod
source: Product
ru: знак произведения

# prop
source: Proportional to
ru: пропорционально

# psi
source: Greek small letter psi
ru: греческая строчная буква пси

# Psi
source: Greek capital letter psi
ru: греческая заглавная буква пси

# quot
source: Quotation mark
ru: двойная кавычка

# radic
source: Square root
ru: радикал (квадратный корень)

# raquo
source: Right angle quotation mark
ru: правая двойная угловая скобка

# rarr
source: Rightwards arrow
ru: стрелка вправо

# rArr
source: Rightwards double arrow
ru: двойная стрелка вправо

# rdquo
source: Right double quotation mark
ru: правая двойная кавычка

# real
source: Real part of complex number
ru: действительная часть комплексного числа

# reg
source: Registered trademark
ru: знак зарегистрированной торговой марки

# rho
source: Greek small letter rho
ru: греческая строчная буква ро

# Rho
source: Greek capital letter rho
ru: греческая заглавная буква ро

# rsaquo
source: Single right angle quotation
ru: закрывающая угловая кавычка

# rsquo
source: Right single quotation mark
ru: правая одиночная кавычка

# sbquo
source: Single low-9 quotation mark
ru: нижняя одиночная кавычка

# scaron
source: Small s with caron
ru: латинская строчная буква S с птичкой

# Scaron
source: Capital s with caron
ru: латинская заглавная буква S с птичкой

# sdot
source: Dot operator
ru: оператор точка

# sect
source: Section
ru: параграф

# shy
source: Soft hyphen
ru: место возможного переноса (мягкий перенос)

# sigma
source: Greek small letter sigma
ru: греческая строчная буква сигма

# Sigma
source: Greek capital letter sigma
ru: греческая заглавная буква сигма

# sigmaf
source: Greek small letter final sigma
ru: греческая строчная буква сигма (конечная)

# sim
source: Varies with, similar to
ru: оператор тильда

# spades
source: Spade
ru: пики

# sub
source: Proper subset of
ru: подмножество

# sube
source: Subset of or equal to
ru: подмножество или равно

source: Sum
ru: знак суммирования

# sup
source: Proper superset of
ru: надмножество

# sup1
source: Superscript 1
ru: верхний индекс "один"

# sup2
source: Superscript 2
ru: верхний индекс "два"

# sup3
source: Superscript 3
ru: верхний индекс "три"

# supe
source: Superset of or equal to
ru: надмножество или равно

# szlig
source: Small sharp s, German
ru: строчное двойное S, немецкое

# tau
source: Greek small letter tau
ru: греческая строчная буква тау

# Tau
source: Greek capital letter tau
ru: греческая заглавная буква тау

# there4
source: Therefore
ru: следовательно

# theta
source: Greek small letter theta
ru: греческая строчная буква тета

# Theta
source: Greek capital letter theta
ru: греческая заглавная буква тета

# thetasym
source: Greek small letter theta symbol
ru: греческий строчный символ тета

# thinsp
source: Thin space
ru: узкий пробел

# thorn
source: Small thorn, Icelandic
ru: латинская строчная буква thorn

# THORN
source: Capital THORN, Icelandic
ru: латинская заглавная буква THORN

# tilde
source: Small tilde
ru: тильда

# times
source: Multiplication
ru: знак умножения

# trade
source: Trademark
ru: знак торговой марки

# uacute
source: Small u with acute accent
ru: латинская строчная буква U с острым ударением

# Uacute
source: Capital u with acute accent
ru: латинская заглавная буква U с острым ударением

# uarr
source: Upwards arrow
ru: стрелка вверх

# uArr
source: Upwards double arrow
ru: двойная стрелка вверх

# ucirc
source: Small u with circumflex accent
ru: латинская строчная буква U с циркумфлексом

# Ucirc
source: Capital u with circumflex accent
ru: латинская заглавная буква U с циркумфлексом

# ugrave
source: Small u with grave accent
ru: латинская строчная буква U с тупым ударением

# Ugrave
source: Capital u with grave accent
ru: латинская заглавная буква U с тупым ударением

# uml
source: Spacing diaeresis
ru: трема (знак над гласной для произнесения ее отдельно от предшествующей гласной)

# upsih
source: Greek upsilon with hook symbol
ru: греческая буква ипсилон с крючком

# upsilon
source: Greek small letter upsilon
ru: греческая строчная буква ипсилон

# Upsilon
source: Greek capital letter upsilon
ru: греческая заглавная буква ипсилон

# uuml
source: Small u with umlaut/diaeresis
ru: латинская строчная буква U с тремой

# Uuml
source: Capital u with umlaut/diaeresis
ru: латинская заглавная буква U с тремой

# weierp
source: Power set (Weierstrass p)
ru: рукописная P

# xi
source: Greek small letter xi
ru: греческая строчная буква кси

# Xi
source: Greek capital letter xi
ru: греческая заглавная буква кси

# yacute
source: Small y with acute accent
ru: латинская строчная буква Y с острым ударением

# Yacute
source: Capital y with acute accent
ru: латинская заглавная буква Y с острым ударением

source: Yen
ru: иена или юань

# yuml
source: Small y with umlaut/diaeresis
ru: латинская строчная буква Y с тремой

# Yuml
source: Capital y with umlaut/diaeresis
ru: латинская заглавная буква Y с тремой

# zeta
source: Greek small letter zeta
ru: греческая строчная буква дзета

# Zeta
source: Greek capital letter zeta
ru: греческая заглавная буква дзета

# zwj
source: Zero width joiner
ru: соединитель нулевой ширины

# zwnj
source: Zero width non-joiner
ru: разделитель нулевой ширины
