Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lowlevel/dbint/*.locallang.xlf
Languages: ru

source: Advanced query
ru: Дополнительный запрос

source: being checked...
ru: проверены...

source: Check now!
ru: Проверить!

# checkScript
source: You can also run the check as a shell script using CLI if the processing takes longer than the PHP max_execution_time allows.
ru: Также можно запустить проверку, как сценарий оболочки, используя CLI, если проверка занимает больше времени, чем позволяет PHP max_execution_time.

# checkScript_check_description
source: To check the reference index use
ru: Для проверки справочного указателя используйте:

# checkScript_headline
source: Using the command line interface
ru: Использование интерфейса командной строки

# checkScript_information
source: If you run these commands from the command line, make sure that a BE user with the name _cli_lowlevel exists.
ru: Если эти команды запускаются из командной строки, убедитесь, что существует внутренний пользователь с именем _cli_lowlevel exists.

# checkScript_more
source: Make sure that a BE user with the name _cli_lowlevel exists. For more details see: /path/to/your/typo3/sysext/lowlevel/HOWTO_clean_up_TYPO3_installations.txt
ru: Удостоверьтесь, что существует внутренний пользователь с именем _cli_lowlevel. За дополнительной информацией обратитесь: /path/to/your/typo3/sysext/lowlevel/HOWTO_clean_up_TYPO3_installations.txt

# checkScript_moreDetails
source: For more details see
ru: За деталями обратитесь:

# checkScript_update_description
source: To update the reference index use
ru: Для обновления справочного указателя используйте:

# checkScript_update_example
source: php /path/to/your/typo3/cli_dispatch.phpsh lowlevel_refindex -e
ru: hp /path/to/your/typo3/cli_dispatch.phpsh lowlevel_refindex -e

# clickToTestRefIndex
source: Click here to test reference index
ru: Щелкните для тестирования справочного указателя:

# clickToUpdateRefIndex
source: Click here to update reference index
ru: Щелкните для обновления справочного указателя:

source: Count
ru: Количество

source: Count results
ru: Количество результатов

source: CSV Export
ru: Экспорт в CSV

source: Database Relations
ru: Отношения в базе данных

# deleted_pages
source: Marked-deleted pages
ru: Помеченные удаленными страницы:

# directories
source: Dirs
ru: Дир.:

# directoriesTooDeep
source: ERROR: Directories deeper than the following number of levels
ru: ОШИБКА: директория глубже текущего количества уровней:

# doktype
source: Document types
ru: Типы документов:

# doktype_value
source: Document types (value)
ru: Типы документов (количество)

# dontUseOrigValues
source: Don't use original values in brackets as prefix for labelled results
ru: Не использовать исходные значения в скобках, как префикс для отметок результатов

source: Enter regex pattern
ru: Ввод шаблона regex:

source: Explain query
ru: Объяснить запрос

source: Files
ru: Файлы:

# filesearch
source: Search all filenames for pattern
ru: Поиск образца во всех файлах

# filesearch_description
source: Will search recursively for filenames in the PATH_site (subdirs to the website path) matching a certain regex pattern.
ru: Поиск по названиям файлов в корневой директории сайта и всех его поддиректориях.

# files_many_ref
source: Files referenced from more than one record
ru: Файлы, связанные с несколькими записями:

# files_no_file
source: Missing files
ru: Ошибочные файлы:

# files_no_ref
source: Files with no references at all (delete them!)
ru: Фалы вообще без связей (удалите их!):

source: Find filename
ru: Поиск названия файла

# fixLostRecord
source: Click to move this lost record to rootlevel (pid=0)
ru: Щелкните для перемещения этой потерянной записи на корневую страницу (pid=0)

source: Full search
ru: Поиск во всем

# group_db
source: Group fields
ru: Группировать поля:

source: Hidden pages
ru: Скрытые страницы:

source: is missing!
ru: ошибка!

source: Label
ru: Метка

# manageRefIndex
source: Manage Reference Index
ru: Управление справочным указателем

source: Matching files
ru: Соответствующие файлы:

source: [ MENU ]
ru: [ МЕНЮ ]

source: No files found.
ru: Файлы не найдены.

source: not checked.
ru: не проверено.

source: Pages
ru: Страницы:

source: Pattern
ru: Шаблон

# rawSearch
source: Raw search in all fields
ru: Прямой поиск по всем полям

# records
source: Records Statistics
ru: Статистика записей

# records_description
source: This shows some statistics for the records in the database. This runs through the entire page-tree and therefore it will also load the server heavily!
ru: Статистический обзор записей базы данных. Необходима обработка всех страниц, что составить достаточную нагрузку для сервера!

source: Record Statistics
ru: Статистика записей

source: Referenced from
ru: Ссылка от:

# referenceIndex_buttonCheck
source: Check reference index
ru: Проверить индексы ссылок

# referenceIndex_buttonUpdate
source: Update reference index
ru: Обновить индексы ссылок

# referenceIndex_description
source: TYPO3's reference index keeps track of the relations between records. As it can happen that the reference index contains outdated values, you can check and update it here.
ru: Индексы ссылок TYPO3 хранят отношения между записями. Может случиться, что в индексы ссылок попадут старые значения, здесь можно проверить это и обновить.

source: references
ru: ссылки:

# refindex
source: Check and update global reference index
ru: Проверить и обновить глобальный индекс связей

# refindex_description
source: Allows you to maintain the reference index kept by TYPO3.
ru: Позволяет управлять индексом связей, поддерживаемым TYPO3.

source: Relations
ru: Связи

# relations_description
source: This will analyse the content of the tables and check if there are 'empty' relations between records or if files are missing from their expected position.
ru: Анализирует содержимое страниц и проверяет наличие 'пустых' связей между записями или ошибки в расположении файлов.

source: Result
ru: Результат:

# search
source: Search whole Database
ru: Поиск по всей базе данных

# searchButton
source: Search
ru: Поиск

# search_description
source: This searches through all database tables and records for a text string.
ru: Этот поиск задействует все таблицы и записи для поиска текстовой строки.

source: Searching for filenames
ru: Поиск названий файлов:

source: Search options
ru: Параметры поиска:

# select_db
source: Select fields
ru: Выбрать поля:

source: Select records
ru: Выбор записей

# showDeleted
source: Show even deleted entries (with undelete buttons)
ru: Показать даже удаленные записи (с кнопками для восстановления)

# showSQL
source: Show SQL parts
ru: Показать части SQL

# sortOptions
source: Sort selectbox-options for relations by label and not by value
ru: Упорядочить выбор параметров для отношений по меткам, а не по значениям

source: Table name
ru: Название таблицы

source: Tables
ru: Таблицы:

# title
source: Database integrity check
ru: Проверка целостности базы данных

# total_lost
source: Records total / lost
ru: Записи всего / потеряно

# total_pages
source: Total number of pages
ru: Общее количество страниц:

source: Total Page Tree
ru: Все дерево страниц

# tree
source: The Page Tree
ru: Дерево страниц:

# tree_description
source: This shows all pages in the system in one large tree. Beware that this will probably result in a very long document which will also take some time for the server to compute!
ru: Отображение всех страниц в системе в виде большого дерева. Помните, что список может быть очень большим и может потребоваться много времени для просчета и отображения страниц!

source: Update now!
ru: Обновить немедленно!

# updateRefIndex
source: Update reference index
ru: Обновить справочный указатель

# useFormattedStrings
source: Use formatted strings, labels and dates instead of original values for results
ru: Использовать для результатов форматированные строки, метки и даты вместо исходных значений

source: XML Export
ru: Экспорт в XML
