Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/linkvalidator/modfuncreport/*.locallang.1415814894.xlf
Languages: it

# menu.introduction
source: Introduction
it: Introduzione

# menu.checkLinks
source: Check Links for validity
it: Verifica se i link sono validi

# menu.overview
source: Overview of links on website
it: Panoramica dei link di questo sito

# overview.header
source: Overview - choose options to check the links
it: Panoramica - scegli le opzioni per verificare i links

# overview.all.header
source: Total amounts in tt_content
it: Totale generale in tt_content

# overview.all.records
source: Records with ext. links:
it: Record con link esterni:

# overview.all.links
source: External links:
it: Link esterni:

# overview.branch.header
source: Amounts from actual branch in tt_content
it: Totale dal ramo corrente di tt_content

# overview.branch.records
source: Records with ext. links:
it: Records con link esterni:

# overview.branch.links
source: External links:
it: Link esterni:

# overview.attention.header
source: Attention:
it: Attenzione:

# overview.attention.text
source: Checking links may take up to several minutes. Checking ONE link can last up to 3 seconds.
it: La verifica dei link può richiedere diversi minuti. La sola verifica di un link può richiedere fino a 3 secondi.

source: Report
it: Rapporto

# CheckLink
source: Check Links
it: Verifica i links

# report.statistics.header
source: Show these types of broken links
it: Mostra questi di link malfunzionanti

# checklinks.statistics.header
source: Check these types of broken links
it: Verifica questi tipi di link malfunzionanti

# report.func.title
source: Show this level
it: Mostra questo livello

# checklinks.func.title
source: Check this level
it: Verifica questo livello

# overviews.nbtotal
source: Broken links total:
it: Totale di link malfunzionanti:

# hooks.db
source: Internal Links:
it: Link Interni:

# hooks.file
source: File Links:
it: Link a files:

# hooks.external
source: External Links:
it: Link esterni:

# hooks.linkhandler
source: Linkhandler Links:
it: Gestore dei links:

# label_refresh
source: Refresh display
it: Aggiorna lo schermo

# label_update
source: Check links
it: Verifica i links

# list.header
source: Listing of broken links
it: Elenco dei link malfunzionanti

# list.tableHead.path
source: Path
it: Percorso

# list.tableHead.element
source: Element
it: Elemento

# list.tableHead.linktarget
source: URL / Link Target
it: URL / destinazione del link

# list.tableHead.linkmessage
source: Error message
it: Messaggio di errore

# list.tableHead.lastCheck
source: Last check
it: Ultima verifica

# list.edit
source: Edit element containing this broken link
it: Edita gli elementi che contengono i link malfunzionanti

# list.field
source: (Field: %s)
it: (Campo: %s)

# list.no.headline
source: no headline
it: nessuna headline

# list.report.pagedeleted
source: Page '###title###' (###uid###) is deleted.
it: La pagina '###title###' (###uid###) è stata cancellata.

# list.report.pagenotvisible
source: Page '###title###' (###uid###) is not visible.
it: La pagina '###title###' (###uid###) non è visibile.

# list.report.pagenotexisting
source: Page (###uid###) does not exist.
it: La pagina(###uid###) non esiste.

# list.report.contentmoved
source: Element '###title###' (###uid###) is not located on page ###wrongpage###, but on page ###rightpage###.
it: Elemento '###title###' (###uid###) non si trova nella pagina ###wrongpage###, bensì nella pagina ###rightpage###.

# list.report.contentdeleted
source: Element '###title###' (###uid###) is deleted.
it: Elemento '###title###' (###uid###) è stato cancellato.

# list.report.contentnotvisible
source: Element '###title###' (###uid###) is not visible.
it: Elemento '###title###' (###uid###) non è visibile.

# list.report.contentnotexisting
source: Element (###uid###) does not exist.
it: Elemento (###uid###) non esiste.

# list.report.rowdeleted
source: ###title### row (###uid###) is deleted.
it: riga ###title### (###uid###) è stata cancellata.

# list.report.rowdeleted.default.title
source: Linked
it: Collegato a

# list.report.rownotexisting
source: Row (###uid###) does not exist.
it: La riga (###uid###) non esiste.

# list.report.noinformation
source: No information about the error is available.
it: Non esistono informazioni più precise su questo errore.

# list.report.noresponse
source: External Link not reachable.
it: Link esterno non raggiungibile.

# list.report.redirectloop
source: A redirect loop occurred. (%s: %s)
it: Si è verificato un problema causato da una redirezione circolare (%s: %s)

# list.report.pageforbidden403
source: Accessing this address is not allowed (403).
it: L'accesso a questo indirizzo non è consentito (403).

# list.report.pagenotfound404
source: The requested url was not found (404).
it: L'url richiesto non è stato trovato (404).

# list.report.externalerror
source: External Link returned HTTP error code (%s).
it: Il link esterno ha restituito un codice di errore HTTP (%s).

# list.report.filenotexisting
source: File doesn't exist.
it: Il file non esiste.

# list.report.timeout
source: Operation timeout. The specified time-out period was reached according to the conditions.
it: Timeout nella elaborazione. Il periodo massimo per la elaborazione è stato raggiunto.

# list.report.internalerror500
source: Internal Server Error (500)
it: Errore interno al Server (500)

# list.report.couldnotresolvehost
source: Could not resolve host. The given remote host was not resolved.
it: L'host non può essere risolto. L'host remoto inserito non è stato risolto.

# list.report.errornetworkdata
source: Failure with receiving network data.
it: Errore nel ricevere dati via rete.

# list.report.otherhttpcode
source: An error occurred (%s): "%s".
it: Si è verificato un errore (%s): "%s".

# list.report.httpexception
source: Exception: %s
it: Eccezione: %s

# list.no.broken.links.title
source: No broken links to show!
it: Non esistono link malfunzionanti da mostrare!

# list.no.broken.links
source: There are no broken links to be displayed.
it: Non esistono link malfunzionanti da visualizzare.

# no.access.title
source: No access!
it: Mancato accesso!

# no.access
source: You do not have access to these listings.
it: Non hai accesso a questi elenchi.
