Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/linkvalidator/modfuncreport/*.locallang_csh.xlf
Languages: ru

# checkboxes.description
source: Click the following checkboxes to consider or to ignore the corresponding broken links.
ru: Поставьте соответствующие флажки для учета или игнорирования соответствующих неработающих ссылок.

# tablehead_path.description
source: Path to the content element, which contains the broken link.
ru: Путь к элементу содержимого, содержащему неработающую ссылку.

# tablehead_element.description
source: Type of the element containing the broken link, its headline and the field in which the broken link is located.
ru: Тип элемента, содержащего неработающую ссылку, его заголовок и поле, в котором находится неработающая ссылка.

# tablehead_headlink.description
source: The linking text.
ru: Текст ссылки.

# tablehead_linktarget.description
source: URL to which the broken link is pointing.
ru: URL, на который указывает неработающая ссылка.

# tablehead_linkmessage.description
source: Status of that link.
ru: Статус ссылки.

# tablehead_lastcheck.description
source: Date and time of the last update of the information in each table row.
ru: Дата и время последнего обновления информации в каждой из строк таблицы.

# task_page.alttitle
source: Start page of the task
ru: Начальная страница задачи

# task_page.description
source: UID of the start page for this task.
ru: UID начальной страницы этой задачи.

# task_depth.alttitle
source: Depth of the task
ru: Глубина задачи

# task_depth.description
source: Level of pages the task should check.
ru: Уровень страниц, который должна проверять задача.

# task_configuration.alttitle
source: Special TSconfig code
ru: Специфичный код TSconfig

# task_configuration.description
source: TSconfig Code which defines settings for linkvalidator to be used for this task.
ru: Код TSconfig, определяющий настройки проверки ссылок и используемый для этой задачи.

# task_email.alttitle
source: Email address
ru: Адрес email

# task_email.description
source: Email address to which an email report is sent.
ru: Адрес email, на который отправлен отчет.

# task_emailonbrokenlinkonly.alttitle
source: Mailing option
ru: Параметры почты

# task_emailonbrokenlinkonly.description
source: Only send an email, if new broken links were found.
ru: Отсылать письмо, только если найдены новые неработающие ссылки.

# task_emailfile.alttitle
source: Email template file
ru: Файл шаблона для письма

# task_emailfile.description
source: Define a template to be used for the email.
ru: Шаблон, используемый для письма.
