Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/linkvalidator/modfuncreport/*.locallang.xlf
Languages: ru

# menu.introduction
source: Introduction
ru: Введение

# menu.checkLinks
source: Check Links for validity
ru: Проверка ссылок

# menu.overview
source: Overview of links on website
ru: Обзор ссылок на сайте

# overview.header
source: Overview - choose options to check the links
ru: Обзор – выберете параметры для проверки ссылок

# overview.all.header
source: Total amounts in tt_content
ru: Общее количество в tt_content

# overview.all.records
source: Records with ext. links:
ru: Записей с внешн. ссылками:

# overview.all.links
source: External links:
ru: Внешние ссылки:

# overview.branch.header
source: Amounts from actual branch in tt_content
ru: Количество из фактической ветви в tt_content

# overview.branch.records
source: Records with ext. links:
ru: Записей с внешн. ссылками:

# overview.branch.links
source: External links:
ru: Внешние ссылки:

# overview.attention.header
source: Attention:
ru: Внимание:

source: Report
ru: Отчет

# CheckLink
source: Check Links
ru: Проверка ссылок

# report.statistics.header
source: Show these types of broken links
ru: Показать эти типы не работающих ссылок

# checklinks.statistics.header
source: Check these types of broken links
ru: Проверить эти виды не работающих ссылок

# report.func.title
source: Show this level
ru: Показать этот уровень

# checklinks.func.title
source: Check this level
ru: Проверить этот уровень

# overviews.nbtotal
source: Broken links total:
ru: Всего неработающих ссылок:

# hooks.db
source: Internal Links:
ru: Внутренние ссылки:

# hooks.file
source: File Links:
ru: Файловые ссылки:

# hooks.external
source: External Links:
ru: Внешние ссылки:

# hooks.linkhandler
source: Linkhandler Links:
ru: Ссылки обработчика:

# label_refresh
source: Refresh display
ru: Обновить

# label_update
source: Check links
ru: Проверка ссылок

# list.header
source: Listing of broken links
ru: Список неработающих ссылок

# list.tableHead.path
source: Path
ru: Путь

# list.tableHead.element
source: Element
ru: Элемент

# list.tableHead.headlink
source: Link
ru: Ссылка

# list.tableHead.linktarget
source: URL / Link Target
ru: URL / цель ссылки

# list.tableHead.linkmessage
source: Error message
ru: Сообщение об ошибке

# list.tableHead.lastCheck
source: Last check
ru: Последняя проверка

# list.edit
source: Edit element containing this broken link
ru: Править элемент с этой неработающей ссылкой

# list.field
source: (Field: %s)
ru: (Поле: %s)

# list.no.headline
source: no headline
ru: нет заголовка

# list.report.pagedeleted
source: Page '###title###' (###uid###) is deleted.
ru: Страница '###title###' (###uid###) удалена.

# list.report.pagenotvisible
source: Page '###title###' (###uid###) is not visible.
ru: Страница '###title###' (###uid###) скрыта.

# list.report.pagenotexisting
source: Page (###uid###) does not exist.
ru: Страница (###uid###) не существует.

# list.report.contentdeleted
source: Element '###title###' (###uid###) is deleted.
ru: Элемент '###title###' (###uid###) удален.

# list.report.contentnotvisible
source: Element '###title###' (###uid###) is not visible.
ru: Элемент '###title###' (###uid###) скрыт.

# list.report.contentnotexisting
source: Element (###uid###) does not exist.
ru: Элемент (###uid###) не существует.

# list.report.rowdeleted
source: ###title### row (###uid###) is deleted.
ru: ###title### строка (###uid###) удалена.

# list.report.rowdeleted.default.title
source: Linked
ru: Связанный

# list.report.rownotexisting
source: Row (###uid###) does not exist.
ru: Строка (###uid###) не существует.

# list.report.noinformation
source: No information about the error is available.
ru: Недоступна информация об ошибке.

# list.report.noresponse
source: External Link not reachable.
ru: Внешняя ссылка недоступна.

# list.report.redirectloop
source: A redirect loop occurred. (%s: %s)
ru: Цикличное перенаправление. (%s: %s)

# list.report.pageforbidden403
source: Accessing this address is not allowed (403).
ru: Нет доступа по этому адресу (403).

# list.report.pagenotfound404
source: The requested url was not found (404).
ru: Запрашиваемый url не найден (404).

# list.report.externalerror
source: External Link returned HTTP error code (%s).
ru: Внешняя ссылка возвратила код ошибки HTTP (%s).

# list.report.filenotexisting
source: File doesn't exist.
ru: Файл не существует.

# list.report.internalerror500
source: Internal Server Error (500)
ru: Внутренняя ошибка сервера (500)

# list.report.couldnotresolvehost
source: Could not resolve host. The given remote host was not resolved.
ru: Невозможно разрешить хост. Заданный удаленный хост не разрешен.

# list.report.errornetworkdata
source: Failure with receiving network data.
ru: Ошибка с получением сетевых данных.

# list.report.otherhttpcode
source: An error occurred (%s): "%s".
ru: Ошибка (%s): "%s".

# list.report.httpexception
source: Exception: %s
ru: Исключение: %s

# list.no.broken.links.title
source: No broken links to show!
ru: Нет неработающих ссылок!

# list.no.broken.links
source: There are no broken links to be displayed.
ru: Нет неработающих ссылок.

# no.access.title
source: No access!
ru: Нет доступа!

# no.access
source: You do not have access to these listings.
ru: Нет разрешений для доступа к этому списку.
