Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/sys_action/*.locallang_tca.xlf
Languages: it

# sys_action
source: Action
it: Azione

# sys_action.assign_to_groups
source: Assign action to groups:
it: Assegna azione ai gruppi:

# sys_action.hidden
source: Deactivated:
it: Disabilitato:

# sys_action.t1_allowed_groups
source: Groups which may be assigned through the action:
it: Gruppi che possono essere assegnati all'azione:

# sys_action.t1_copy_of_user
source: Template user:
it: Template per l'utente:

# sys_action.t1_create_user_dir
source: Create User Home Directory:
it: Crea la Home Directory per l'utente:

# sys_action.t1_userprefix
source: User prefix:
it: Prefisso utente:

# sys_action.t3_listPid
source: List pid:
it: Lista PID:

# sys_action.t3_tables
source: List only table:
it: Lista solo la tabella:

# sys_action.t4_recordsToEdit
source: Records to edit:
it: Recods da editare:

# sys_action.type.1
source: Create Backend User
it: Crea un utente di Backend

# sys_action.type.2
source: SQL query
it: Query SQL

# sys_action.type.3
source: Record list
it: Elenco dei record

# sys_action.type.4
source: Edit records
it: Edita record

# sys_action.type.5
source: New Record
it: Nuovo record

# tx_sys_action
source: Actions
it: Azioni
