Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/sys_action/*.locallang.xlf
Languages: it, ru

# action_BEu_db_mount
source: Pagetree starting points
it: Punti di partenza dell'albero delle pagine
ru: Точки доступа в дереве страниц

# action_BEu_hidden
source: Disable user
it: Disabilita utente
ru: Выключить пользователя

# action_BEu_password
source: Password
ru: Пароль

# action_BEu_realName
source: Real name
it: Nome
ru: Настоящее имя

# action_BEu_usergroups
source: Member of groups
it: Membro dei gruppi
ru: Член групп

# action_BEu_username
source: Login name
it: Login
ru: Имя пользователя (login)

# action_Create
source: Create Backend User
it: Crea utente backend
ru: Создать внутреннего пользователя

# action_createQuery
source: Create Query
it: Crea Query
ru: Создать запрос

# action_download_file
source: Click here to download the exported data in a file
it: Clicca qui per scaricare i dati in un file
ru: Нажмите здесь, чтобы сгрузить экспортированные данные в виде файла

# action_editQuery
source: Edit Query
it: Modifica Query
ru: Редактировать запрос

# action_emptyQuery
source: Query is empty, create one first!
it: La Query è vuota, prima ne devi creare una!
ru: Пустой запрос, сначала его нужно создать!

source: Action error!
it: Errore!
ru: Ошибка в действии!

# action_error-access
source: You don't have sufficient rights to see the records. Please ask the administrator to set those for you.
it: Non hai i privilegi sufficienti per veder questi records. Chiedi all'amminstratore di assegnarteli.
ru: Недостаточно прав для просмотра записей. Попросите администратора о назначении соответствующих прав.

# action_error-not-found
source: The action doesn't exist
it: L'azione richiesta non esiste
ru: Действия не существует

# action_not-found
source: No actions found
it: Nessuna azione trovata
ru: Действий не найдено

# action_not-found-description
source: Currently there are no actions yet defined!
it: Al momento nessuna azione è stata ancora definita!
ru: На данный момент действия еще не определены!

# action_notReady
source: Error: The action configuration is not finished.
it: Errore: L'azione di configurazione non e' terminata.
ru: Ошибка: не окончена настройка действия.

# action_noType
source: Error: The action had no type defined.
it: Errore: L'azione non ha un tipo definito.
ru: Ошибка: не был определен тип действия.

# action_t1_legend_configuration
source: Configuration
ru: Настройка

# action_t1_legend_generalFields
source: General fields
ru: Основные поля

# action_t1_listOfUsers
source: List of backend users
it: Elenco utenti backend
ru: Список внутренних пользователей

# action_t2_result
source: Result of query
it: Risultato della query
ru: Результат запроса

# action_t4_edit
source: Select record to edit:
it: Seleziona record da modificare:
ru: Выберите запись для правки:

# action_toolbaritem
source: Open System Actions
it: Azioni Open System
ru: Открытые системные действия

# action_Update
source: Update Backend User
it: Aggiorna utente backend
ru: Обновить данные внутреннего пользователя

# description
source: An 'Action' is a configuration of a specific task which may be performed by assigned usergroups via the Task Center.
it: Una 'Azione' è una configurazione di uno specifico compito che può essere eseguito da gruppi di utenti tramite il Task Center.
ru: "Действие" – это настройка определенной задачи, которая может быть назначена на определенную группу пользователей в Центре заданий.

# edit-sys_action
source: Edit record
it: Editare il record
ru: Править запись

# error-password-empty
source: The password is empty.
it: La password è vuota.
ru: Пустой пароль.

# error-username-empty
source: The username is empty.
it: Il nome utente è vuoto.
ru: Пустое имя пользователя.

# error-wrong-email
source: The E-mail address is wrong.
it: L'indirizzo e-mail è errato.
ru: Неверный адрес e-mail.

# error-wrong-user
source: You are not allowed to edit this user.
it: Non hai i permessi per modificare questo utente.
ru: Не разрешено редактировать этого пользователя.

# new-sys_action
source: Create a new action
it: Crea una nuova azione
ru: Создать новое действие

source: Success
it: Successo
ru: Успешно

# success-user-created
source: The user has been created.
it: L'utente è stato creato.
ru: Пользователь создан.

# success-user-updated
source: The user has been updated.
it: L'utente è stato aggiornato.
ru: Пользователь обновлен.

# sys_action
source: Action
it: Azione
ru: Действие
