Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/extensions/EditElement/*.locallang_csh.xlf
Languages: ru

# .alttitle
source: htmlArea RTE > Edit Element
ru: htmlArea RTE > Править элемент

# className.alttitle
source: Class attribute
ru: Атрибут class

# className.description
source: Choose a CSS class selector to be assigned to the element.
ru: Выберете CSS селектор class для элемента.

# .description
source: The "Edit element" dialogue allows to edit the general attributes of an element in the RTE editing area.
ru: Диалог "Правка элемента" позволяет отредактировать основные атрибуты элемента в области редактирования.

# .details
source: Clicking the "Edit element" icon in the RTE tool bar opens a dialogue that allows to edit the general attributes of an element. The dialogue allows to edit the id, title, class, lang and dir attributes, as well as the microdata attributes of the element. It also allows to specify handlers for keyboard and mouse events.
ru: Щелчок по значку "Править элемент" на панели инструментов, откроет диалог, позволяющий отредактировать основные атрибуты элемента: id, title, class, lang и dir. Кроме того, возможно определить обработчики для событий клавиатуры и мыши.

# events.alttitle
source: Event handlers
ru: Обработчики событий.

# events.description
source: Using this fieldset, edit handlers for keyboard and mouse events.
ru: Этот набор полей позволяет отредактировать обработку событий клавиатуры или мыши.

# id.alttitle
source: Id attribute
ru: Атрибут id

# id.description
source: Enter or edit the value of the id attribute of the element.
ru: Введите или отредактируйте значение атрибута id для элемента.

# .image_descr
source: "Edit element" icon in the editor tool bar.
ru: Значок "Править элемент" на панели инструментов.

# onclick.alttitle
source: Onclick event handler
ru: Обработчик события Onclick

# onclick.description
source: Enter or edit the script to be run on a mouse click.
ru: Введите или отредактируйте сценарий, запускаемые при щелчке левой кнопки мыши.

# ondblclick.alttitle
source: Ondblclick event handler
ru: Обработчик события Ondblclick

# ondblclick.description
source: Enter or edit the script to be run on a mouse double-click.
ru: Введите или отредактируйте сценарий, запускаемые при двойном щелчке левой кнопки мыши.

# onkeydown.alttitle
source: Onkeydown event handler
ru: Обработчик события Onkeydown

# onkeydown.description
source: Enter or edit the script to be run when a key is pressed.
ru: Введите или отредактируйте сценарий, запускаемые при нажатии клавиши.

# onkeypress.alttitle
source: Onkeypress event handler
ru: Обработчик события Onkeypress

# onkeypress.description
source: Enter or edit the script to be run when a key is pressed and released.
ru: Введите или отредактируйте сценарий, запускаемые при нажатии и удержании клавиши.

# onkeyup.alttitle
source: Onkeyup event handler
ru: Обработчик события Onkeyup

# onkeyup.description
source: Enter or edit the script to be run when a key is pressed and released.
ru: Введите или отредактируйте сценарий, запускаемые при отпускании клавиши.

# onmousedown.alttitle
source: Onmousedown event handler
ru: Обработчик события Onmousedown

# onmousedown.description
source: Enter or edit the script to be run when a mouse button is pressed.
ru: Введите или отредактируйте сценарий, запускаемые при нажатии любой кнопки мыши.

# onmousemove.alttitle
source: Onmousemove event handler
ru: Обработчик события Onmousemove

# onmousemove.description
source: Enter or edit the script to be run when the mouse pointer moves.
ru: Введите или отредактируйте сценарий, запускаемые при движении указателя мышки над элементом.

# onmouseout.alttitle
source: Onmouseout event handler
ru: Обработчик события Onmouseout

# onmouseout.description
source: Enter or edit the script to be run when mouse pointer moves out of the element.
ru: Введите или отредактируйте сценарий, запускаемые при покидании указателя мышки элемента.

# onmouseover.alttitle
source: Onmouseover event handler
ru: Обработчик события Onmouseover

# onmouseover.description
source: Enter or edit the script to be run when mouse pointer moves over the element.
ru: Введите или отредактируйте сценарий, запускаемые когда указатель мыши находится над элементом.

# onmouseup.alttitle
source: Onmouseup event handler
ru: Обработчик события Onmouseup

# onmouseup.description
source: Enter or edit the script to be run when a mouse button is released.
ru: Введите или отредактируйте сценарий, запускаемые при нахождении указателя мышки над элементом.

# .seeAlso
source: xEXT_rtehtmlarea_EditElement:id, xEXT_rtehtmlarea_EditElement:title, xEXT_rtehtmlarea_EditElement:className, xEXT_rtehtmlarea_Language:languageCombo, xEXT_rtehtmlarea_Language:directionCombo, xEXT_rtehtmlarea_MicrodataSchema, xEXT_rtehtmlarea_EditElement:events
ru: xEXT_rtehtmlarea_EditElement:id, xEXT_rtehtmlarea_EditElement:title, xEXT_rtehtmlarea_EditElement:className, xEXT_rtehtmlarea_Language:languageCombo, xEXT_rtehtmlarea_Language:directionCombo, xEXT_rtehtmlarea_EditElement:events

# title.alttitle
source: Title attribute
ru: Атрибут title

# title.description
source: Enter or edit the value of the title attribute of the element.
ru: Введите или отредактируйте значение атрибута title для элемента.
