Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/wizard_sortpages/*.locallang.xlf
Languages: ru

# no_subpages
source: Please select a page with subpages.
ru: Выберете страницу с вложенными страницами.

# wiz_changeOrder
source: Sort these pages by
ru: Отсортировать страницы по

# wiz_changeOrder_msg1
source: You're about to change the order of the above pages. Are you sure you want to continue?
ru: Вы изменяете порядок отображенных страниц. Вы уверены что хотите продолжить?

# wiz_changeOrder_REVERSE
source: Reverse current order
ru: Обратный порядок

# wiz_changeOrder_subtitle
source: Subtitle
ru: Подзаголовку

# wiz_changeOrder_tChange
source: Change-time
ru: Дате изменения

# wiz_changeOrder_tCreate
source: Create-time
ru: Дате создания

# wiz_changeOrder_title
source: Page title
ru: Названию страницы

# wiz_currentPageOrder
source: Current page order
ru: Текущий порядок страниц

# wiz_sort
source: Sort pages
ru: Сортировка страниц
