Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/linkvalidator/locallang.xlf
Languages: it, ru

# mod_linkvalidator
source: Linkvalidator
it: Validatore link
ru: Проверка ссылок

# tasks.validate.name
source: Linkvalidator
ru: Проверка ссылок

# tasks.validate.description
source: Search for broken links and store the result into the temporary table tx_linkvalidator_link in order to ease up the backend module.
it: Cerca i collegamenti incompleti e memorizza i risultati nella tabella temporanea tx_linkvalidator per velocizzare il modulo di backend.
ru: Поиск неверных ссылок и сохранение результата во временную таблицу tx_linkvalidator_link для облегчения внутреннего модуля.

# tasks.validate.page
source: Start page (uid)
it: Pagina iniziale (uid)
ru: Начальная страница (uid)

# tasks.validate.depth
source: Depth
it: Profondità
ru: Глубина

# tasks.validate.conf
source: Overwrite TSconfig
it: Sovrascrivi TSconfig
ru: Перезапись TSconfig

# tasks.validate.email
source: Send email report to
it: Invia report a
ru: Отчет на email

# tasks.validate.emailOnBrokenLinkOnly
source: Send email on new broken links only
it: Manda una email solo se trovati collegamenti incompleti
ru: Отсылать email лишь о вновь найденных ошибочных ссылках

# tasks.validate.emailTemplateFile
source: Email template file
it: File di template per l'Email
ru: Файл шаблона email

# tasks.validate.invalidEmail
source: Invalid email format!
it: Formato email non valido!
ru: Неверный формат email!

# tasks.validate.invalidPage
source: Invalid page uid, please enter a valid page uid!
it: UID di pagina non valido. Inserire un UID valido!
ru: Неверный uid страницы, введите верное значение uid!

# tasks.validate.invalidDepth
source: There is no depth set, please set it to one of the offered values!
it: Non è stata definita una opzione per la profondità; scegli uno tra i valori elencati!
ru: Глубина не настроена, выберете одно из предложенных значений!

# tasks.error.noSubject
source: No subject for the notification email
it: Nessun oggetto per la email di notifica
ru: Не установлена тема email уведомления

# tasks.error.invalidToEmail
source: Invalid format of one or more of the recipient email addresses!
it: Formato non valido oppure di uno o più email dei destinatari!
ru: Неверный формат одного или нескольких адресов email получателей!

# tasks.error.invalidFromEmail
source: Invalid format of the email address in the from header
it: Formato non valido dell'indirizzo email nel campo from della header
ru: Неверный формат адреса email в заголовке от (from)

# tasks.error.invalidTSconfig
source: Invalid TSconfig in the task configuration!
it: Codice TSconfig non valido nella configurazione del task!
ru: Неверный TSconfig в настройке задачи!

# tasks.error.invalidEmailTemplateFile
source: The email template file is not existing!
it: Il file di template per l'email non esiste!
ru: Нет файла шаблона email!
