Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/extensions/RemoveFormat/*.locallang_csh.xlf
Languages: ru

# all.alttitle
source: Remove format on all contents
ru: Очистка форматирования во всем тексте

# all.description
source: Select this option to perform the format removal operation on the whole contents of the editing area.
ru: Выберете эту возможность для очистки форматирования во всем тексте, находящемся в области редактирования.

# allHtml.alttitle
source: Remove all HTML format
ru: Полное удаление форматирования HTML

# allHtml.description
source: Check this option if you wish to remove all HTML format.
ru: Установите этот параметр, если нужно полностью удалить все форматирование HTML.

# allHtml.details
source: This option removes all HTML markup from the selected text.
ru: Этот параметр отвечает за полное удаление форматирования HTML из текста.

# .alttitle
source: htmlArea RTE > Remove Format
ru: htmlArea RTE > Очистить форматирование

# area.alttitle
source: Select the area to be cleaned
ru: Определение области для очистки

# area.description
source: The format removal operation may be applied either to the currently highlighted text or to the whole contents of the editing area.
ru: Операция очистки форматирования может применяться либо к выделенному в редакторе тексту, либо ко всему тексту полностью.

# area.details
source: Use one of these two radio buttons to select the area to which you wish to apply the format removal operation.
ru: Выберете одну из предоставленных возможностей для очистки содержимого.

# .description
source: The Remove Format feature offers options for cleaning up the HTML markup of the text being edited.
ru: Возможность очистки форматирования разметки HTML в редактируемом тексте.

# .details
source: This feature may be useful in order to clean up text that was copied from some external source and pasted into the editing area. The feature is accessed by clicking on the "Remove format" button in the editor tool bar. In the dialogue window that opens when the button is clicked: - First, select the area to be cleaned; - Second, choose the format removal options that you wish to be applied to the selected area; - Press the OK button for the format removal operation to be performed. The dialogue window will be automatically closed.
ru: Такая возможность полезна при вставке текста, скопированного в область редактирования из любых внешних источников. Функционал включается щелчком по кнопке "Очистить формат" в панели инструментов. Диалог, покрывающийся при щелчке по кнопке: - сначала определите область для очистки; - затем выберете параметры для очистки выбранной области; - нажмите OK для выполнения операции очистки. Окно диалога закроется автоматически.

# htmlFormat.alttitle
source: Remove all HTML inline markup and style
ru: Удаление форматирования всех встроенных HTML стилей и форматов

# htmlFormat.description
source: Check this option if you wish to remove all HTML inline markup and style.
ru: Установите этот параметр для удаления всей встроенной разметки и стилей HTML.

# htmlFormat.details
source: This option removes: - the following HTML elements, but keeps their textual contents: abbr, acronym, b, big, cite, code, em, font, i, q, s, samp, small, span, strike, strong, sub, sup, tt, u, var; - the following attributes on all HTML elements: align, bgcolor, cellpadding, cellspacing, class, frame, style.
ru: При этом удаляются: - следующие элементы HTML, с сохранение их текстового содержимого: abbr, acronym, b, big, cite, code, em, font, i, q, s, samp, small, span, strike, strong, sub, sup, tt, u, var; - следующие атрибуты во всех элементах HTML: align, bgcolor, cellpadding, cellspacing, class, frame, style.

# .image_descr
source: Remove format icon in the editor tool bar.
ru: Значок "Удалить форматирование" в панели инструментов редактора.

# images.alttitle
source: Remove images
ru: Удаление изображений

# images.description
source: Check this option if you wish to remove all images.
ru: Установите этот параметр, если нужно удалить все изображения.

# images.details
source: This option removes all images from the selected text.
ru: Этот параметр отвечает за полное удаление изображений из текста.

# msWordFormat.alttitle
source: Remove all MS Word markup and style
ru: Удаление разметки и стилей MS Word

# msWordFormat.description
source: Check this option if you wish to remove all MS Word markup and style.
ru: Установите этот параметр для удаления всей встроенной разметки и стилей MS Word.

# msWordFormat.details
source: This option removes: - all attributes on the following elements: b, em, i, li, p, strong, ul; - the following attributes on all HTML elements: align, class, style; - the following elements, but keeps their textual contents: div, f, formulas, link, lock, meta, path, shape, shapetype, span, stroke, ?xml, any element containing ":" in its name; - the following elements and their contents: style, title; - HTML comments; - img, imagedata tags; - xml tags; - the following elements whenever they have no textual contents: b, big, i, s, small, strike, tt, u; - double opening and double closing tags; - multiples spaces, replacing them by single spaces.
ru: При этом удаляются: - все атрибуты следующих элементов: b, em, i, li, p, strong, ul; - следующие атрибуты всех элементов HTML: align, class, style; - следующие элементы, с сохранение их текстового содержимого: div, link, meta, span, любые элементы, содержащие в своих названиях ":"; - следующие элементы и их содержимое: style, title; - комментарии HTML; - следующие элементы, если они не имеют текстового содержимого: b, big, i, s, small, strike, tt, u; - двойные открывающие и двойные закрывающие теги; - несколько пробелов заменяются на одиночный пробел.

# nonBreakingSpace.alttitle
source: Replace non-breaking spaces
ru: Замена неразрывных пробелов

# nonBreakingSpace.description
source: Check this option if you wish to replace non-breaking spaces with normal spaces.
ru: Установите этот параметр, если нужно заменить знак неразрывного пробела на обычный пробел.

# nonBreakingSpace.details
source: This option replaces any non-breaking space with a simple normal space.
ru: Этот параметр отвечает за замену знаков неразрывных пробелов на обычные пробелы.

# options.alttitle
source: Select the types of format to be removed
ru: Выбор типа удаляемого форматирования

# options.description
source: The format removal operation may remove various types of format.
ru: Возможно удаление форматирования различного типа.

# options.details
source: Check one or more of these check boxes to select the type(s) of format you wish to be removed.
ru: Выберете один или несколько типов форматирования, которое будет удалено.

# selection.alttitle
source: Remove format on selected text only
ru: Очистка форматирования только в выделенной области

# selection.description
source: Select this option to perform the format removal operation on the currently selected text only.
ru: Выберете эту возможность для очистки форматирования только лишь в выбранной области.

# typographicalPunctuation.alttitle
source: Replace typographical punctuation
ru: Замена типографской пунктуации

# typographicalPunctuation.description
source: Check this option if you wish to replace typographical punctuation with ASCII character codes.
ru: Установите этот параметр, если нужно заменить знаки типографской пунктуации на коды символов ASCII.

# typographicalPunctuation.details
source: This option replaces typographical punctuation entities with ASCII character codes. The following substitutions are performed: - replace horizontal ellipsis with three periods; - replace en-dash and em-dash with hyphen; - replace double low-9, left double and right double quotation mark with double quote; - replace left single, right single and single low-9 quotation mark with single quote; - replace single left/right-pointing angle quotation mark with single quote; - replace left/right-pointing double angle quotation mark (also known as left/right pointing guillemet) with double quote; - replace grave accent (spacing grave) and acute accent (spacing acute) with single quote.
ru: Этот параметр отвечает за замену типографских знаков пунктуации на коды символов ASCII. Заменяется следующее: - многоточие на знак многоточия; - короткое и длинное тире на дефис; - двойные нижние, левые, правые апострофы на двойные кавычки; - левые, правые, нижние апострофы на одинарные кавычки; - одиночный левый/правый угловой апостроф на одиночную кавычку; - двойные левые/правые угловые кавычки на на двойные кавычки; - наклонное ударение (основное ударение) и ударение на одинарную кавычку.
