Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/tstemplate/Resources/Private/Language/*.locallang_objbrowser.xlf
Languages: ru

# addButton
source: Add
ru: Добавить

# addKey
source: <b>Add key</b></a> "%s" to Object List
ru: <b>Добавить ключ</b></a> "%s" к Списку объектов

# addProperty
source: Add object property:
ru: Добавить свойство объекта:

source: All
ru: Все

source: Bad property!
ru: Ошибочное свойство!

source: Browse:
ru: Просмотр:

source: Clear?
ru: Очистить?

# clearButton
source: Clear
ru: Очистить

source: Clear object:
ru: Очистить объект:

source: Conditions
ru: Условия

# constantRoot
source: constants root
ru: корневые константы

source: Constants
ru: Константы

source: Crop lines
ru: Обрезка строк

source: Current template
ru: Текущий шаблон

source: Display comments
ru: Вывести комментарии

source: Display constants:
ru: Вывод констант:

source: Display options
ru: Вывод параметров

source: Edit:
ru: Править:

# editProperty
source: Edit object/property value:
ru: Правка значения объекта/свойства:

# errorShowDetails
source: Show details
ru: Подробно

# errorsWarnings
source: Errors and warnings
ru: Ошибки и предупреждения

# noCurrentTemplate
source: You cannot edit properties and values, if there's no current template.
ru: Невозможно править свойства и значение при отсутствии какого-либо шаблона.

# noSpaces
source: You must enter a property with characters a-z, A-Z and 0-9, no spaces!
ru: Название свойство должно включать символы a-z, A-Z и 0-9, без пробелов!

# nothingUpdated
source: Nothing was updated!
ru: Ничего не обновлено!

source: Object cleared
ru: Объект очищен

source: Object List:
ru: Список объектов:

# plainSubstitution
source: Plain substitution (default)
ru: Простая замена (по умолчанию)

source: Property added
ru: Свойство добавлено

# regExp
source: Regular expressions
ru: Регулярные выражения

# removeKey
source: Remove key from OL
ru: <b>Удалить ключ</b></a> "%s" из Списка объектов

source: Search:
ru: Поиск:

source: Set conditions
ru: Назначить условия

source: Setup
ru: Настройка

source: setup root
ru: корневая настройка

source: Sort alphabetically
ru: Упорядочить по алфавиту

# substitutedGreen
source: Substituted constants in green
ru: Заменённые константы зелёные

# unsubstitutedGreen
source: UN-substituted constants in green
ru: Заменённые константы выводятся зелёным

# updateButton
source: Update
ru: Обновить

source: Value updated
ru: Значение обновлено
