Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/beuser/Resources/Private/Language/*.locallang.xlf
Languages: ru

source: Active only
ru: Активный

source: Active Sessions
ru: Активные сессии

source: Admin
ru: Администратор

source: Admin only
ru: Только для администраторов

# allowedLanguages
source: Limit to languages
ru: Ограничить языками

source: Any
ru: Любой

source: Backend User Administration
ru: Управление пользователями

# backendUserGroup
source: User group
ru: Группа пользователей

# backendUserGroups
source: Member of groups
ru: Группы

source: Backend User Listing
ru: Список пользователей

source: Backend users
ru: Пользователи

source: Both
ru: Любой

source: [change-to mode]
ru: [режим перехода]

source: Compare
ru: Сравнить

source: Compare backend users
ru: Сравнить пользователей

source: Compare user list
ru: Сравнить списки пользователей

# confirm
source: Are you sure you want to delete this backend user %s?
ru: Вы уверены, что хотите удалить пользователя административной части %s?

source: DB mountpoints
ru: Точки монтирования базы данных

source: Disable
ru: Отключить

source: Disable IP lock
ru: Отключить ограничение по IP

# endDateAndTime
source: Stop
ru: Стоп

source: End session
ru: Завершение сессии

# fileMounts
source: File mountpoints
ru: Точки монтирования файловой системы

source: Filter
ru: Фильтр

source: Inactive only
ru: Неактивный

source: IP address
ru: IP адрес

source: Last access
ru: Последний доступ

source: Last login
ru: Последний вход

# loginBefore
source: Logged in before
ru: Вход до

source: Never
ru: Никогда

source: Never logged in
ru: Никогда не входил

source: No
ru: Нет

# normalUserOnly
source: Normal users only
ru: Только для обычных пользователей

source: Online users
ru: Пользователи онлайн

source: Really logout
ru: Подтверждаете выход

source: Real Name
ru: Настоящее имя

# section.compare
source: Compare
ru: Сравнить

# startDateAndTime
source: Start
ru: Старт

source: Status
ru: Статус

# switchBackMode
source: Switch to user
ru: Переключить на пользователя

source: Username
ru: Имя пользователия

source: Users
ru: Пользователи

source: Yes
ru: Да
