Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/DynamicCSS/*.locallang.xlf
Languages: it, ru

source: Action items
it: Attivit√†
ru: Действия

source: Component items
it: Componenti
ru: Компоненты

source: Default
it: Predefinito
ru: По умолчанию

source: Detail
it: Dettagli
ru: Деталь

# DynamicCSSStyleTooltip
source: Apply style to the containing paragraph
it: Applica stile al paragrafo contenitore
ru: Применить стиль к абзацу

# frame-frame1
source: Frame with grey background
it: Frame con sfondo grigio
ru: Рамка с серым фоном

# frame-frame2
source: Frame with yellow background
it: Frame con sfondo giallo
ru: Рамка с желтым фоном

source: Important
it: Importante
ru: Внимание

source: Name of person
it: Nome della persona
ru: Имя человека

source: Undefined
it: Non definito
ru: Неопределено
