Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_*_users.xlf
Languages: ru

# admin.description
source: 'Admin' users have TOTAL access to the system!
ru: Пользователи "администраторы" имеют ПОЛНЫЙ доступ к системе!

# admin.details
source: 'Admin' can do anything TYPO3 allows and this kind of user should be used only for administrative purposes. All daily handling should be done with regular users. 'Admin' users don't need to be members of any backend user groups. However you should be aware that any page created by an admin user without a group will not have any owner-group assigned and thus it will probably be invisible for other users. If this becomes a problem you can easily solve it by assigning a user group to the 'Admin' user anyway. This does of course not affect the permissions since they are unlimited, but the first group listed is by default the owner group of newly created pages. 'Admin' users are easily recognized as they appear with a red icon instead of the ordinary blue user-icon. You should probably not assign any other users than yourself as an 'Admin' user.
ru: "Администраторы" могут делать все, что позволяет TYPO3, поэтому этот тип пользователя должен использоваться лишь в целях управления системой в общем. Все обычные манипуляции должны осуществлять обычные пользователи. Пользователю "администратору" не нужно быть членом какой-либо группы внутренних пользователей. Но нужно помнить, что все страницы, созданные пользователями-администраторами, не являющимися членами каких-либо групп внутренних пользователей, не будут иметь группу-владельца, ввиду чего могут быть скрыты от остальных пользователей. Если это проблема, то можно легко ее избежать, сделав пользователя-"администратора" членом какой-либо группы (или групп). Конечно, это не повлияет на права пользователя, они и так ничем не ограничены, но первая в списке группа, в которую он входит, будет группой-владельцем создаваемых пользователем страниц. Пользователя "администратора" легко распознать по значку красного цвета, в то время как цвет значков обычных пользователей - синий. Обычно никого из пользователей, кроме себя не делают "администраторами".

# allowed_languages.description
source: Select which record languages the group members are limited to edit.
ru: Выберете, на каких языках доступно редактирование записей для пользователя.

# allowed_languages.details
source: You can also limit users to specific languages with user group settings. Please see the same field for backend user groups for more details.
ru: Ограничить доступ к редактированию языковых записей можно подобной настройкой в группах пользователей. Смотрите детальную информацию по тому же параметру в справке по группам внутернних пользователей.

# db_mountpoints.description
source: Assign startpoints for the users page tree.
ru: Начальная точка в дереве страниц для пользователя.

# db_mountpoints.details
source: The page tree used my all Web-submodules to navigate must have some points-of-entry defined. Here you should insert one or more references to a page which will represent a new root page for the page tree. This is called a 'Database mount'. <strong>Notice</strong> that backend user groups also has DB mounts which can be inherited by the user. So if you want a group of users to share a page tree, you should probably mount the page tree in the backend user group which they share instead.
ru: В дереве страниц, которое используют для навигации все подмодули Веб, должно иметь определенные начальные точки. Здесь можно определить одну или несколько ссылок на страницы, которые станут новыми корневыми страницами для дерева страниц. Они называются "Точки доступа к базе данных". <strong>Помните</strong>, что в группах внутренних пользователей также определяются точки доступа к БД, которые могут заимствоваться пользователями. Так, если нужно обеспечить доступ группе пользователей к какой-либо ветви дерева страниц, нужно просто сделать это точнкой доступа к БД в группе этих внутренних пользователей.

# db_mountpoints.image_descr
source: A DB mount is assigned to the user. Users can only operate on pages and records which are inside their DB mounts! When a page is mounted for a user it will become the root of their page tree. The user must have access to the page through the regular page permissions set in the Web > Access module.
ru: Точки доступа к БД назначаются для пользователя. Пользователи получают доступ лишь к тем страницам и записям на них, которые находятся внутри точек доступа к БД! При установке точки доступа, она становиться корнем дерева страниц. Пользователь должен иметь доступ к страницам, устанавливаемый в модуле Веб > Доступ.

# .description
source: This is the table of backend administration users. Backend users can login in the backend of TYPO3 and are typically producers of content on a website.
ru: Это таблица управления внутренними пользователями. Внутренние пользователи могут входить во внутренний интерфейс управления TYPO3 и, обычно, делают содержимое для сайта.

# .details
source: The main settings for a backend user is a username, password and group memberships. The username and password authenticates the user to the system. The group memberships enables the user to perform actions in TYPO3 since groups are the main source of permission settings for a backend user. Backend usergroups can also be understood as "roles". A usergroup can contain a configuration of permissions which allows the user to play a certain role in the system. <b>The "Admin" user</b> There is a special kind of user, the "Admin" user. This user has access to everything in TYPO3. There are no limits for Admin-users at all. You should normally have only a single or two admin-users in your system. Admin-users are the only users who can create other backend users. Alternatively you can create an "Action" which enables other normal users to do it as well (with certain restrictions of course). <b>Location</b> Backend users are always created in the root of the page tree (like Backend groups are). <b>Comparing Users</b> To manage and compare users, getting an overview of their access credentials etc. you can use the Tools > User Admin module (extension: beuser). It allows you to group users by various categories of permissions. You can also switch to another users account by a single click of a button.
ru: Основные параметры для внутренних пользователей - это имя пользователя, пароль и группы пользователей. По имени пользователя и паролю осуществляется идентификация в системе. Группы дают пользователю определенные в них права и возможность совершать предопределенные действия в TYPO3, ведь группы - это основной источник прав доступа для внутренних пользователей. Группы внутренних пользователей можно рассматривать в плане "ролей". Группы пользователей могут быть настроены так, чтобы позволить пользователю играть определенную роль в системе. <b>Пользователь "Администратор"</b> Существует специальный вид пользователей - "администратор". Эти пользователи имеют полный доступ ко всему в TYPO3. Для них нет никаких ограничений. Обычно существуют только один-два таких пользователя. Лишь пользователи-администраторы могут создавать других внутренних пользователей. Как альтернатива, можнно создать "действие", позволяющее другим, обычным пользователям, делать это (разумеется с определенными ограничениями). <b>Место размещения</b> Внутренние пользователи всегда создаются в корне дерева страниц (также, как и группы внутренних пользователей). <b>Сравнение пользователейЖ</b> Для управления и сравнения пользователей, получения предствления об их правах доступа и т.д., можно использовать модуль Сервис управления > Управление пользователями (расширение: beuser). Здесь возможно группировать пользователей по различным категориям и правам доступа. Возможно имитировать учетную запись одним щелчком по кнопке.

# disable.description
source: This option will temporarily disable the user from logging in.
ru: Тем самым можно временно запретить пользователю входить в систему.

# disableIPlock.description
source: Disable the lock of the backend users session to the remote IP number.
ru: Выключить блокировку сессии внутреннего пользователя по удаленному IP адресу.

# disableIPlock.details
source: You will have to disable this lock if backend users are accessing TYPO3 from ISDN or modem connections which may shutdown and reconnect with a new IP. The same would be true for DHCP assignment of IP numbers where new IP numbers are frequently assigned.
ru: Можно убрать такую блокировку, если внутренний пользователь входит в TYPO3 по ISDN или модему, которые могут переподключаться, меняя адрес IP. То же самое верно для назначения адресов IP в DHCP, где часто назначается новый IP адрес.

# email.description
source: Enter the email address of the user.
ru: Введите email адрес пользователя.

# email.details
source: This address is rather important to enter because this is where messages from the system is sent. <strong>Notice</strong> the user is able to change this value by himself from within the User>Setup module.
ru: Это довольно важный параметр, так как по нему будут отправляться служебные сообщения из системы. <strong>Помните</strong>, что пользователь может сам изменить это значение из модуля Сервис пользователя > Персональные настройки.

# endtime.description
source: Enter the date from which the account is disabled.
ru: Дата, с которой учетная запись будет отключена.

# file_mountpoints.description
source: Assign startpoints for the file folder tree.
ru: Установите точки доступа к структуре файлов.

# file_mountpoints.details
source: The file folder tree is used by all File-submodules to navigate between the file folders on the webserver. Notice as with 'DB mounts' the file folder mounts may be inherited from the member groups of the user. See Backend Groups for details
ru: Дерево папок используется всеми подмодулями Файл для перемещения по файловой структуре на сервере. Помните, что "точки доступа к файлам" также, как и "точки доступа к БД", заимствоваться из групп пользователей. За деталями обратитесь в раздел Группы внутренних пользователей

# fileoper_perms.description
source: Select file operation permissions for the user.
ru: Выберете разрешенные для пользователя операции с файлами.

# fileoper_perms.details
source: These settings relate to the functions found in the File>List module as well as general upload of files. <strong>Notice</strong> that backend user groups also have file operation permissions which automatically apply to the user if he's member of an accordant group. So if you want a group of users share identical file operation permissions, you should probably define them in a backend user group instead.
ru: Эти параметры относятся к функциям модуля Файл > Список, также как и к общей загрузке файлов. <strong>Помните</strong>, что группы внутренних пользователей также имеют разрешения на операции с файлами, которые автоматически применяются к пользователям соответствующих групп. Поэтому, если нужно дать группе пользователей одинаковые права, то лучше их определить для соответствующей группы внутренних пользователей.

# _fileoper_perms.seeAlso
source: be_users:file_mountpoints, be_group:file_permissions
ru: be_users:file_mountpoints, be_group:fileoper_perms

# file_permissions.description
source: Select file operation permissions for the user.
ru: Выберете разрешенные для пользователя операции с файлами.

# file_permissions.details
source: These settings relate to the functions found in the File>List module as well as general upload of files. <strong>Notice</strong> that backend user groups also have file operation permissions which automatically apply to the user if he's member of an accordant group. So if you want a group of users share identical file operation permissions, you should probably define them in a backend user group instead.
ru: Эти настройки относятся как к функциям модуля Файл>Список, так и к общей загрузке файлов. <strong>Обратите внимание</strong>, что группы внутренних пользователей также имеют настройки доступа к файлам, которые автоматически распространяются на входящих в группы пользователей. Так, если нужно, чтобы часть пользователей имела идентичные права на операции с файлами, лучше создать специальную группу и включить в неё пользователей, чем настраивать права для отдельных пользователей.

# file_permissions.seeAlso
source: be_users:file_mountpoints, be_group:file_permissions
ru: be_users:file_mountpoints, be_group:fileoper_perms

# .image_descr
source: Backend users are found in the root of the page tree. "Admin" backend users can always be recognized on their icon being red while normal users have a blue icon. The editing form of a backend users record. The "Tools > User Admin" module where you can get an overview of the users on the system and what permissions they have. Click the "SU" button to switch to a users account.
ru: Внутренние пользователи находятся в корне дерева страниц. Пользователя-администратора всегда можно отличить по его значку, красного цвета, в то время как у нормальных пользователей значок синий. Форма редактирования записей внутренних пользователей. Модуль "Сервис управления > Управление пользователями", где возможно получить представление о пользователях, их правах в системе. Щелкните по кнопке "SU" для переключения на учетную запись другого пользователя.

# lang.description
source: Select the <i>default</i> language.
ru: Выберете язык <i>по умолчанию</i>.

# lang.details
source: This determines the language of the backend interface for the user. All mainstream parts available for regular users are available in the system language selected. 'Admin'-users however will experience that the 'Admin'-only parts of TYPO3 is in english. This includes all submodules in "Tools" and the Web>Template module. <b>Notice</b> this is only setting the default language. As soon as the user has logged in the language must be changed through the User>Setup module. Also you will have to install the corresponding language pack which can be found as an extension on TYPO3.org with the prefix "csh_XX" where XX is the TYPO3 language key.
ru: Тем самым для пользователя будет определяться язык во внутреннем интерфейсе. Все основные части, доступные для обычных пользователей будут представлены на выбранном системном языке. Пользователи-"администраторы", однако, увидят, что "административная" часть TYPO3 на английском языке. Сюда входят все подмодули в "Сервисе управления" и в модуле Веб > Шаблон. <b>Notice</b> this is only setting the default language. As soon as the user has logged in the language must be changed through the User>Setup module. Also you will have to install the corresponding language pack which can be found as an extension on TYPO3.org with the prefix "csh_XX" where XX is the TYPO3 language key.

# lastlogin.description
source: This field shows the user's last log in date.
ru: Это поле показывает последнюю дату посещения пользователя.

# lockToDomain.description
source: Enter the host name from which the user is forced to login.
ru: Введите название хоста, с которого должен входить пользователь.

# lockToDomain.details
source: A TYPO3 system may have multiple domains pointing to it. Therefore this option secures that users can login only from a certain host name.
ru: В системе TYPO3 может быть несколько указывающих на нее доменов. Таким образом, этот параметр определяет, с какого именно должен входить пользователь.

# options.description
source: Select if the user should inherit page tree or folder tree mountpoints from member groups.
ru: Выберете, может ли пользователь наследовать точки доступа к БД или к файлам из групп внутренних пользователей.

# options.details
source: It's a great advantage to let users inherit mountpoints from membergroups because it makes administration of the same mountpoints for many users extremely easy. If you don't check these options, you must make sure the mount points for the page tree and file folder tree is set specifically for the user.
ru: Это очень большое преимущество, позовлить пользователям наследовать точки доступа из групп, так как делает управление пользователями чрезвычайно простым. Если этот параметр не включен, убедитесь, что для пользователя настроены точки доступа.

# password.description
source: Enter the password for the backend username above (Notice the value you enter <i>will</i> be readable in the field!).
ru: Введите пароль для введенного выше имени пользователя (помните, что введенное значение <i>будет</i> показано в этом поле!).

# password.details
source: The password is required. Before the password is sent to the server it's md5-hashed, so the password value itself is not transferred over the Internet. This is true both when editing the password and when the user logs in. While this principle does not reveal the raw password it is <i>not</i> the same as real encryption. If you need the highest degree of security you should install the TYPO3 backend on a secure server. The password is stored in the database as an md5-hash and thus it's not possible to extract the original password from the database either. This means that 'lost passwords' must be substituted with a new password for the user. <b>Notice</b> When you enter the password in the password field it is initially visible in clear text! First when the password field focus is lost will the password become a "list of dots". <b>User changing password</b> Users can change their password from the User > Setup module
ru: Пароль обязателен. Перед пересылкой на сервер, пароль хешируется по алгоритму md5, и само значение в открытом виде не передается по сети. Это происходит и при редактировании пароля и при входе пользователя. Но в то же время, то, что пароль не виден, <i>не</i> то же самое, что шифрование. Если нужно обеспечить высокую степень защиты, сама система TYPO3 должна находиться на защищенном сервере. Пароль в базе данных храниться как md5-хеш, поэтому невозможно изъять оригинальный пароль из самой базы данных. Это означает, что "потерянный пароль" должен быть заменен на новый. <b>Примечание</b> При начальном вводе пароля, он отображается как обычный текст! Но при переходе на другое поле, он отобаржается в виде "жирных точек". <b>Изменение пароля пользователем</b> Пользователи могут изменить свой пароль из модуля Сервис пользователя > Персональные настройки.

# realName.description
source: Enter the ordinary name of the user, eg. John Doe.
ru: Введите настоящее имя пользователя, например Иван Васильев.

# realName.details
source: <strong>Notice</strong> the user is able to change this value by himself from within the User>Setup module.
ru: <strong>Помните</strong>, что пользователь может сам изменить это значение из модуля Сервис пользователя > Персональные настройки.

# starttime.description
source: Enter the date from which the account is active.
ru: Дата, с которой будет активна учетная запись.

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
ru: Введите дополнительный TSconfig для пользователя.

# TSconfig.details
source: This field allows you to extend the configuration of the user in severe details. A brief summary of the options include a more detailed configuration of the backend modules, setting of user specific default table field values, setting of Rich Text Editor options etc.
ru: Это поле позволяет более детально настроить пользователей. Краткий список доступных параметров включает более детальную настройку внутренних модулей, настройки определененных по умолчанию полей в таблицац, настройки Rich Text Editor и т.п.

# usergroup.description
source: Assign backend user groups to the user.
ru: Группы, в которые входит пользователь.

# usergroup.details
source: The backend user groups defines the permissions which the backend user will inherit. So unless the backend user is an 'Admin' user, he needs to be a member of one or more user groups in order to have practically any permissions assigned. The properties set in the user groups are mostly added together. The first (top) group in the list is the group which will, by default, be the owner of pages the user creates.
ru: Группы внутренних пользователей определяют прова доступа, которые из них заимствуют пользователи этих групп. Поэтому, если пользователь не является "администратором", ему требуется стать членом хотя бы одной группы для заимствования из них соответствующих прав. Набор свойств из групп главным образом суммируются. Первая (главная) группа в списке, становиться группой, владеющей по умолчанию страницами, создаваемыми пользователем.

# userMods.description
source: Select available backend modules for the user.
ru: Выберете доступные для пользователя модули внутреннего интерфейса.

# userMods.details
source: This determines which 'menu items' are available for the user in the backend. Notice that the same list of modules may be configured for the backend user groups and that these will be inherited by the user in addition to the modules you select here. It's highly likely that you should not set any modules for the user himself but rather select the modules in the backend groups he's a member of. However this list provides a great way to add a single module for specific users.
ru: Определяет, какие "элементы меню" будут доступны для пользователя во внутреннем интерфейсе. Помните, что одни и те же списки модулей можно настроить для групп внутренних пользователей, и они будут наследоваться пользователями, в добавок к тем, которые выбраны здесь. Крайне рекомендуется не выбирать модули в настройках самого пользователя, а выбирать доступные модули в группах внутренних пользователей, а затем делать пользователей их членами. Тем не менее, этот список позволяет дать конкретному пользователю доступ к определенному модулю.

# username.description
source: Enter the login name of the backend user.
ru: Введите имя пользователя внутреннего интерфейса

# username.details
source: A username is required and must be in lowercase without spaces in it. Furthermore the username must be unique. If it is not unique a number will be appended automatically.
ru: Имя пользователя — обязательный параметр и должно вводиться в нижнем регистре без пробелов. Кроме того, имя пользователя должно быть уникальным. Если такое имя уже имеется, к нему автоматически добавляется номер.
