Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_file_list.xlf
Languages: ru

# bigControlPanel
source: Extended view
ru: Расширенный вид

# c_file
source: File Name
ru: Название файла

# c_fileext
source: Type
ru: Тип

# clipBoard
source: Show clipboard
ru: Показать Буфер обмена

# clip_deleteMarked
source: Delete marked
ru: Удалить выделенные

# clip_deleteMarkedWarning
source: Are you sure you want to delete all marked files from this folder?
ru: Вы уверены, что хотите удалить все выделенные файлы из этой папки?

# clip_markRecords
source: Mark All/Mark none
ru: Выделить все/Снять выделение

# clip_paste
source: Paste in clipboard content
ru: Вставить содержимое Буфера обмена

# clip_pasteInto
source: Paste into: Clipboard content is inserted into this folder
ru: Вставка внутрь: вставить содержимое Буфера обмена в эту папку

# clip_selectMarked
source: Transfer the selection of files to clipboard
ru: Переместить выделенные файлы в Буфер обмена

# c__REF_
source: Ref
ru: Связь

# c_rw
source: RW
ru: Чт.Зап.

# c_size
source: Size
ru: Размер

# c_tstamp
source: Last Modified
ru: Дата

# displayThumbs
source: Display thumbnails
ru: Показать миниатюры картинок

source: files
ru: файлы

# folderNotFoundMessage
source: The folder "%s" cannot be accessed. Trying to use parent folder(s).
ru: Не может быть получен доступ к папке "%s".

# folderNotFoundTitle
source: Folder not found.
ru: Доступ к папке запрещён.

# localDriverFlexform_basePath
source: Base path:
ru: Базовый путь:

# localDriverFlexform_caseSensitive
source: Uses case sensitive identifiers
ru: Используются чувствительные к регистру идентификаторы

# localDriverFlexform_pathType
source: Path type:
ru: Тип пути:

# localDriverFlexform_pathType_absolute
source: absolute
ru: абсолютный (от корня файловой системы) /

# localDriverFlexform_pathType_relative
source: relative
ru: относительный ../fileadmin/

# mlang_labels_tabdescr
source: This is the file administration system in TYPO3. It allows you to access the file mounts of your login. Through this module you can upload, copy, move an delete files on the server.
ru: Это система управления файлами. Она позволяет работать с файлами, находящимися в зоне вашего доступа. С ее помощью можно загружать на сервер файлы, копировать, перемещать и удалять их.

# mlang_labels_tablabel
source: Listing of files in the directory
ru: Список файлов в каталоге

# mlang_tabs_tab
source: Filelist
ru: Список файлов

# paramError
source: Parameter Error:
ru: Ошибка параметра:

# read
source: R
ru: Чт

source: Recycler
ru: Корзина

# role_folder_recycler
source: Recycler
ru: Корзина

# role_folder_temporary
source: Temporary files
ru: Временные файлы

# storageNotBrowsableMessage
source: You are trying to access a folder in a storage that is not browsable.
ru: Вы пытаетесь получить доступ к папке в хранилище, которое невозможно просмотреть.

# storageNotBrowsableTitle
source: Access denied.
ru: Доступ запрещён.

# targetNoDir
source: Target was not a directory!
ru: Цель не является директорией!

# temp
source: Temporary files
ru: Временные файлы

# write
source: W
ru: Зп
