Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: ru

# new_pages.image_descr
source: Between each page in the tree you find small icons that point out a place for a new page. Select a position by clicking one of these icons. To access the "Create new page wizard" in the first place, just click the link in the Create new record dialog.
ru: Маленький значок находиться между любыми соседними страницами в дереве, указывая на возможное положение новой страницы. Выбрать позицию можно щелкнув по одному из таких значков. Для доступа к "Мастеру создания новой страницы" просто щелкните по ссылке в диалоге создания новой записи.

# new_regular.alttitle
source: Create new record
ru: Создание новой записи

# new_regular.description
source: This list shows the types of records (database tables) you can create on the page. Click a table name to select the type.
ru: В этом списке показаны возможные типы записей (таблиц базы данных), которые вы можете создать на странице. Щелкните по названию таблицы и выберете тип.

# pagetree.alttitle
source: The Page Tree
ru: Дерево страниц

# pagetree.description
source: This is the hierarchical organization of pages in TYPO3. Typically websites are build so they reflect the page structure in the page tree directly in the website navigation.
ru: Это иерархическая организация страниц в TYPO3. Обычно сайты делают так, чтобы структура его страниц отражала навигацию по нему.

# pagetree.details
source: The page tree works like a file system. Each page is like a directory where you can store files. In TYPO3 you store database records inside of each page. Some of these records, typically called "Content Elements", contains the website content of pages. Other records can be from plugins like a glossary or a guestbook and they are only displayed indirectly by a plugin inserted as a Content Element. Some backend users will see only a part of the page tree for a website. This feature allows the administrator to configure backend users with different responsibilities for maintaining branches of the page tree. <b>Navigating the tree</b> Simply click the +/- buttons to expand and contract the branches of the tree. If you click the page icons you should see a context menu pop up. It will contain options specifically for that page. Clicking the title of a page is another option. It will load the right frame of the Web main module with the selected sub-module. The content shown in the right frame will be related to the page clicked.
ru: Дерево страниц подобно файловой структуре. Каждая страница — это папка файловой системы, где хранятся файлы. В TYPO3 каждая страница соответствует записи в базе данных. Некоторые из таких записей обычно называют "элементами содержимого", содержимого страниц сайта. Другие записи берутся из расширений, типа глоссария или гостевой книги, и они выводятся через расширение, вставленное на страницу как элемент содержимого этой страницы. Некоторые внутренние пользователи могут видеть лишь часть дерева страниц сайта. Эта возможность позволяет администраторам настраивать внутренних пользователей, для работы с определенными ветвями дерева страниц. <b>Перемещение по дереву страниц</b> Просто щелкните по кнопкам +/- для развертки/свертки ветвей дерева. Щелчок по значку страницы выведет контекстное всплывающее меню. Его пункты соответствуют действиям, которые можно совершить со страницей. Щелчок по названию страницы приведет к другому действию. В правое окно будет загружен выбранный из меню подмодуль основного модуля. Показанное содержимое будет соответствовать выбранной странице.

# pagetree.image_descr
source: An example of a Page Tree in TYPO3. The page tree is available under any of the Web sub-modules in the menu. Clicking the icon of a page displays a context sensitive menu with options for that particular page. Clicking the title of a page in the page tree will load the right frame with the current submodule. The page id is passed to the module so it displays content related to the page you clicked. Holding the mouse pointer over a page icon for a few seconds will display tool-tip information telling you details about the state of the page. Here a page is access restricted and you will be told which group the access is set for by the tool-tip.
ru: Пример дерева страниц в TYPO3. Дерево страниц доступно из любых подмодулей меню. Щелчок по значку страницы выведет контекстное меню, относящееся к действиям со страницей. Щелчок по заголовку страницы в дереве страниц загрузить текущий подмодуль в правое окно. Id страницы передается в модуль, для вывода содержимого выбранной страницы. Задержав указатель мышки над значком страницы, можно во всплывающей подсказке узнать информацию о данной странице. Здесь можно узнать, что доступ к странице открыт определенной группе внутренних пользователей.

# perm_module.alttitle
source: Viewing page permissions
ru: Просмотр прав доступа

# perm_module.description
source: This view will tell you about the page permissions in the page tree.
ru: В этом режиме можно увидеть права на доступ к страницам в дереве страниц.

# perm_module.details
source: There are two modes you can select: <b>User overview:</b> This will show you the permissions for <em>your</em> login. So the green/red indicators will reflect the combined user/group/everyone permissions that apply to your login! If there is a grey background behind the indicators it tells you that you are the owner of the page. <b>Permissions</b> Shows the permissions settings for owner / group / everybody. You will be able to edit these settings by clicking the edit icon next to the page title. Only an owner of a page (or the "Admin"-user) can change permissions for the page.
ru: Можно выбрать два режима: <b>Обзор пользователей:</b> При этом можно увидеть <em>свои</em> права доступа к выбранной странице. Так зеленые/красные метки отражают суммарные права доступа из параметров пользователя/группы/всех, относительно себя, как внутреннего пользователя! Серый фон меток говорит о том, что вы являетесь владельцем страницы. <b>Права доступа</b> Показываются права доступа для владельца / группы / всех. Отредактировать их можно через значок редактирования рядом с заголовком страницы. Права доступа могут менять лишь владельцы страницы (или пользователь-"администратор").

# perm_module_setting.alttitle
source: Setting permissions for a page
ru: Установка прав доступа для страницы

# perm_module_setting.description
source: Select the owner user and group plus the permissions for each in the matrix. Only an owner of a page (or the "Admin"-user) can change permissions for the page.
ru: Выберете пользователя и группу владельца и права доступа для каждого в таблице. Права доступа могут менять лишь владельцы страницы (или пользователь-"администратор").

# perm_module_setting.details
source: Setting permissions is done in five categories for owner / group / everybody so it works much like permissions for files and folders in many operating systems. <b>Show page</b> If set, a user can see the page and its content in the backend. The user can also copy the content but not move, delete or edit. <b>Edit content</b> Allows users to add, delete, change and move records (other than page records) on this page. This permission must be given if users should be allowed to create Content Elements etc. on the page. <b>Edit page</b> Allows a user to edit the page record itself. This could be changing the page title or moving the page to another location. <b>Delete page</b> If set, a user is allowed to delete the page and the content on the page. <b>New pages</b> Allows users to create sub-pages to this page.
ru: Установка прав доступа делается для пяти категорий для владельца / группы / всех, также , как права доступа к файлам и папкам в большинстве операционных систем. <b>Показать страницу</b> Если включено, пользователь может просматривать страницу и ее содержимое во внутреннем интерфейсе. Пользователю также позволено копировать содержимое, но не перемещать, удалять и редактировать его. <b>Редактировать содержимое</b> Пользователям позволяется добавлять, удалять, изменять или перемещать записи (кроме записей страниц) на этой странице. Такие разрешения могут быть даны, если пользователю разрешено создавать элементы содержимого и т.п. на странице. <b>Редактировать страницу</b> Пользователям позволено редактировать запись самой страницы. Можно отредактировать название страницы или переместить ее в другое место. <b>Удалить страницу</b> Если включено, то пользователь сможет удалить саму страницу и ее содержимое. <b>Новые страницы</b> Пользователь сможет создавать подстраницы на текущей странице.

# perm_module_setting.image_descr
source: In this matrix you can set permissions for owner, group and everybody in the five categories available.
ru: В этой таблице можно устанавливать права доступа для пользователя, группы и всех в пяти доступных категориях.

# shortcuts.alttitle
source: Backend Shortcuts
ru: Ссылки во внутреннем интерфейсе

# shortcuts.description
source: You can create shortcuts to modules in TYPO3 quite easily. The treat is that you can jump between screens in TYPO3 in <em>one</em> click rather than multiple clicks through backend modules etc. The frame also contains a field for entering a page or record id to edit or just search records.
ru: Довольно легко можно создавать ссылки на модули TYPO3. При этом возможно перемещаться между ними гораздо быстрее, используя <em>один</em> щелчок, вместо нескольких. Окно содержит также поля для ввода id страницы или элемента для редактирования или просто для поиска записей.

# shortcuts.details
source: In order to create a shortcut it must be supported by the module you want to create the shortcut to. Whether shortcuts are supported can be seen in the bottom of a module. If there is a small "shortcut" icon you can click it to create the shortcut. In the shortcut frame you can also enter a page id to edit in the "Edit Page ID" box. This will load the current page module with the id provided in the box. Only "Admin"-users can access the shortcut frame in TYPO3 by default. Other users must have it enabled by the User TSconfig option, "options.shortcutFrame = 1". See link below for details (Admins). Editing pages from an id is easy with the shortcut frame. Simply enter an integer number and that page will be loaded for editing. If you enter "[table]:[id]" then it will try to edit a record from the [table] table, for example "tt_content:123" will look for content element 123 (for admins only). Finally, if you enter a string that doesn't match a page or other record the Web>List module will be invoked doing a search in the first database mount you have.
ru: Для создания ссылки, нужна поддержка со стороны модуля, для которого эта ссылка создается. Если создание ссылок поддерживается, то внизу модуля будет присутствовать значок. Щелкнув по нему, можно создать ссылку на модуль. В окне ссылок также возможно ввести id страницы в поле "Редактировать ID страницы" для ее редактирования. При этом загрузится текущий модуль со страницей, введенной в это поле. По умолчанию только пользователи-"администраторы" имеют доступ к окну ссылок в TYPO3. Для других пользователей эта возможность должна быть разрешена через их TSconfig, "options.shortcutFrame = 1". Подробности можно найти по ссылке ниже (для администраторов). Редактировать страницы через id в окне ссылок очень легко. Просто вводите ее номер и нужная страница открывается для редактирования. Введя "[table]:[id]", можно попытаться отредактировать таблицу [table], например ввод "tt_content:123" приведет к поиску элемента содержимого 123 (только для администраторов). И наконец, если будет введена строка, не соответствующая странице или записи, модуль Веб>Список произведет поиск по первой установленной точке доступа к базе данных.

# shortcuts.image_descr
source: To create a shortcut to a page, just click the short cut icon usually found in the bottom of pages. You will have to confirm the creation of the shortcut. It is nothing dangerous - only annoying to clean up if you happen to create shortcuts against your own will. Just answer "OK" here. When you answer "OK" you should immediately see the shortcut frame reload and a new icon (the module icon) appear. If you click this icon you will now jump to the page you created the shortcut from! You can name shortcuts, you can even group them and share them. If you want to edit or delete a shortcut you select the "Edit" checkbox and then click the shortcut icon. This will reload the shortcut frame so you get a field for entering a title. You can also delete all shortcuts in a "group" - here, just click the "0" (zero) to the left of the icons and you will remove all shortcuts in the group.
ru: Для создания ссылки на страницу, просто щелкните по значку ссылки, обычно находящемуся внизу страниц. Создание ссылки нужно будет подтвердить. Ничего опасного не произойдет, просто это способ защиты от необдуманных действий. Просто ответьте "OK". После чего окно ссылок перезагрузится и появится новый значок (значок модуля). Щелкнув по этому значку можно переместиться на страницу для которой он создавался! Ссылкам можно давать имена, группировать и даже делиться с другими пользователями. Для редактирования или удаления ссылки, выберете значок ссылки и щелкните по ярлыку "Редактировать". При этом появиться окно, в котором возможно отредактировать название ссылки, удалить ее или добавить в какую-либо группу. Также возможно удалить все ссылки в группе, для этого просто щелкните по значку "0" (ноль) слева от значков.

# tcatree
source: TYPO3 TCA tree
ru: Дерево TYPO3 TCA

# tcatree.collapseAll
source: Collapse All
ru: Свернуть все

# tcatree.enableRecursiveSelection
source: enable recursive selection
ru: включить рекурсивный выбор

# tcatree.expandAll
source: Expand All
ru: Развернуть все

# tcatree.filter.contains
source: contains
ru: содержит

# tcatree.filter.startsWith
source: starts with
ru: начать с

# tcatree.findItem
source: Find Item
ru: Найти элемент

# TCEforms.alttitle
source: TYPO3 Editing Forms
ru: Формы редактирования TYPO3

# TCEforms_cacheSelector.alttitle
source: Forms Menu
ru: Меню в формах

# TCEforms_cacheSelector.description
source: This is alternative ways to select "Save"/"Close" operations for records. You can also select "clear-cache" operations if you are allowed access to them.
ru: Альтернатива выбора операций "Сохранить"/"Закрыть" для записей. Можно, если доступно, также выбрать операцию "очистить кеш"

# TCEforms_cacheSelector.details
source: Clearing the cache for pages and clearing all cache can be done from this menu as well. If you wonder why content on the frontend webpage seems to be different from what is in the database you might need to clear the page cache by using one of these options. If cache options are not available for you, you should ask your administrator to enable it for you. (Admins: See link below to TSconfig.)
ru: Из этого меню можно очищать кеш страниц или весь кеш. Если содержимое на сайте отличается от того, что находится в базе данных, нужно очистить кеш страниц, используя одну из этих операций. Если параметры для работы с кешем для вас недоступны, нужно попросить администратора включить их для вас. (Администрирование: смотрите ссылку на TSconfig ниже.)

# TCEforms.description
source: All records in TYPO3 is edited through a standardized form interface like the one you see here. No matter if you edit pages, content elements, guestbook items or user records you will use the same familiar interface.
ru: Все записи в TYPO3 редактируются через стандартный интерфейс, вроде показанного здесь. Независимо от того, редактируются ли страницы, элементы содержимого, элементы гостевой книги или записи пользователей, интерфейс всегда будет примерно одинаков.

# TCEforms.details
source: <b>Saving content</b> Just press one of the save-buttons in the top of bottom of the form. There are some variants allowing you to "Save and close document" or "Save document and View page". The latter will save the document and open a new window where the affected page is shown (be sure to disable pop-up blockers for this function!) <b>Editing multiple records at a time</b> From the Web>List module you can activate editing of multiple records at a time. This is done when you list a single table and enable multiple columns for display (see Web>List module for details) - then icons will link you to a form with multiple records displayed, possibly with only certain fields available for editing. <b>Frontend Editing</b> Another way of editing records in TYPO3 is using the website frontend. Depending on your user credentials you will see small pencil icons in the frontend. When you click these you will be guided to a form where you can also change the content. <b>Customize the forms [for Admins]</b> You can customize the TCEforms in many ways using User TSconfig and Page TSconfig. See links below.
ru: <b>Сохранение содержимого</b> Просто нажмите вверху страницы на одну из кнопок-дискет для сохранения. Доступно несколько вариантов "Сохранить и закрыть документ" или "Сохранить документ и просмотреть страницу". Последний вариант сохранит документ и откроет новое окно с редактируемой страницей (убедитесь, что всплывающие окна не заблокированы!) <b>Одновременное редактирование нескольких записей</b> В модуле Веб>Список можно включить редактирование нескольких записей за раз. Это возможно при выборе одной таблицы и включения для отображения нескольких колонок (детально смотрите модуль Веб>Список) - при этом возможно редактирование выбранных полей сразу в нескольких записях. <b>Редактирование во внешнем интерфейсе</b> Другая возможность редактирования записей в TYPO3, редактирование непосредственно на страницах сайта. В зависимости от прав пользователя и настроек, на страницах сайта будут показаны маленькие значки карандаша. Щелчком по ним можно открыть форму для редактирования соответствующего элемента для редактирования. <b>Настройка форм [для Администраторов]</b> Возможно настроить TCEforms через TSconfig пользователя и TSconfig страницы. Смотрите ссылки ниже.

# TCEforms_docSelector.alttitle
source: Document Selector
ru: Выбор документов

# TCEforms_docSelector.description
source: Here you can switch between "open documents" in TYPO3.
ru: Здесь можно переключаться между "открытыми документами" в TYPO3.

# wizard_forms_wiz.alttitle
source: Forms Wizard
ru: Мастер создания форм

# wizard_forms_wiz_buttons.alttitle
source: Form Wizard buttons
ru: Кнопки мастера создания форм

# wizard_forms_wiz_buttons.description
source: Use the refresh button to update the form (without saving it), for instance if you changed a field type or so. When you are done you should click one of the real save buttons to save and return to the form from which you entered the wizard. The information from this wizard should then be saved into the field the wizard was associated with.
ru: Используйте кнопку обновления для обновления состава формы (без ее сохранения), например при изменении типа поля и т.п. Закончив редактирование, нужно нажать на одну из кнопок для сохранения и возвращения к форме, с которой был вызван мастер. При этом, информация из мастера будет введена в соответствующее поле, связанное с ним.

# wizard_forms_wiz.description
source: The Form Wizard enables you to create form elements through a nice interface rather than "coding" a certain syntax for the elements.
ru: Мастер создания форм дает возможность создавать формы через удобный интерфейс, вместо "кодирования" элементов.

# wizard_forms_wiz.details
source: To the left in the form wizard you can add, delete and move items in the form around. In the Element Type column you can select between various kinds of form elements such as regular input fields, text areas, selector boxes, checkboxes etc. Each form element also has a label field where you can enter a title for the field. Some fields also provide the possibility of checking for "required" values. In the "Detailed" configuration column the options will depend on the form field type selected in the "Element type" column. The options here can be to enter elements for a selector box or enter the width of an input field. The "Field:" box is important since it defines the technical name of the form field. This is the name that people will see when they receive an email from the mail form. <b>Custom applications of the form wizard</b> The most typical application of the Form wizard is with Content Elements of the type "Form" but the wizard can be used for other custom applications as well. Technical details about this is available in the links below.
ru: В левой части мастера возможно добавлять, удалять и перемещать элементы в форме. В колонке "Тип элемента" можно выбирать различные доступные типы элементов формы, такие как обычное поле для ввода текста, текстовое поле, блоки выбора и т.п. Для каждого элемента предусмотрено поле для его метки, в которое можно ввести, например название поля. Для некоторых полей предусмотрена проверка "требуемых" значений. Параметры в колонке "Подробные настройки" определяются типом выбранного элемента в колонке "Тип элемента". Это могут быть элементы для блока выбора, ширина поля для ввода текста. Важно значение поля "Поле:", так как оно определяет техническое название данного поля формы. Это название будут видить люди, получающие email, отправленный из почтовой формы. <b>Дополнительное применение мастера создания форм</b> Наиболее часто мастер создания форм применяется в элементах содержимого типа "Форма", но его можно использовать и для других целей. Технические детали можно найти по ссылке ниже.

# wizard_forms_wiz_formmail_info.alttitle
source: Mailform Info Fields
ru: Информационные поля почтовой формы

# wizard_forms_wiz_formmail_info.description
source: These fields specifically apply to the usage of the form wizard with Content Elements of the type "Form". They allow you to enter information like the subject line of the email sent, the recipient address and whether the sent email should be in HTML or not.
ru: Это специальные поля, применяющиеся в мастере создания форм для элементов содержимого типа "Форма". Они позволяют вводить информацию о теме письма, адресе получателя и о том, нужно ли отправлять письмо в формате HTML или нет.

# wizard_forms_wiz_formmail_info.details
source: Notice: In order to enter a recipient address you need access to the "Subheader" field in the Content Elements. Yes, its quite strange, but so it is. Ask your administrator for access if you don't have it.
ru: Примечание: для ввода получателя, понадобится доступ к полю "подзаголовок" в элементе содержимого. Это довольно странное требование, но оно существует. Попросите администратора предоставить доступ к этому полю по этой причине.

# wizard_forms_wiz.image_descr
source: This is how the form wizard looks in action. Using the form fields for setting up forms rather than coding them is much easier. Usually you enter the Form Wizard by clicking the form wizard icon next for a text field like this. Notice the contents of the field to the left of the icon - this is the "raw codes" that the Form Wizard saves you from editing manually!
ru: Так выглядит мастер создания форм. Используя поля для настройки формы, создать ее гораздо проще, чем напрямую кодировать. Обычно мастера создания форм вызывается щелчком по значку рядом с текстовым полем, вроде показанного здесь. Помните, что содержимое текстового поля слева от значка — это код, который создает мастер создания форм!

# wizard_table_wiz.alttitle
source: Table wizard
ru: Мастер создания таблиц

# wizard_table_wiz_buttons.alttitle
source: Table wizard buttons
ru: Кнопки мастера создания таблиц
