Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: ru

# history_log.image_descr
source: You can access the History/Undo log from the Web>List module when in "Extended view" mode. Alternatively you can access it under "More options..." in the clickmenu of an element. The History log shows visually the changes between each step of editing.
ru: Просмотреть журнал истории/отмен можно через модуль Веб>Список в режиме "Расширенный вид". Либо через пункт контекстного меню элемента "Дополнительные параметры...". Журнал истории визуально показывает различия на каждом этапе редактирования.

# history_sum.alttitle
source: History Summary
ru: Общая история

# history_sum.description
source: This shows the total difference between the selected state in history to the current state of this element.
ru: Здесь отображается общее отличие между выбранным в истории и текущим состояниями элемента.

# history_sum.details
source: You can browse forth and back in the history using the arrow buttons in the upper left corner. You can also save a state in history by the little "disk-icon". Finally you can revert either the whole record to this state in history by the revert icon in the top <em>or</em> you can revert only a single field if you like to by clicking the revert icon displayed for each field. <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
ru: По истории можно перемещаться вперед-назад, используя кнопки со стрелками в верхнем левом углу. Можно сохранять состояние в журнале через маленький значок дискеты. И наконец, можно возвращать определенное в истории состояние определенного либо целой записи, через значок сверху, <em>либо</em> вернуть состояние какого-либо поля, щелчком по значку возврата, находящемуся около каждого поля. <b>Примечание:</b> если не видны красные/зеленые метки различий, значит сервер, на котором выполняется TYPO3, не поддерживает разметку отличий или был некорректно настроен.

# history_sum.image_descr
source: The Info view of a state in history shows the "sum" of changes from current time to that point in history for the element.
ru: Информационный режим журнала истории показывает "сумму" изменений от выбранного до текущего состояния элемента.

# .image_descr
source: TYPO3 backend login screen.
ru: Окно входа во внутренний интерфейс.

# list_clipboard.alttitle
source: TYPO3 Clipboard
ru: Буфер обмена TYPO3

# list_clipboard.description
source: The clipboard is an internal registry where records and files can be "stored" temporarily. Usually the clipboard is used for copy/cut/paste operations internally of one or more elements.
ru: Буфер обмена — это внутреннее пространство, куда временно могут "помещаться" записи и файлы. Обычно буфер обмена используется для промежуточных операций копирования/вырезания/вставки одного или нескольких элементов.

# list_clipboard.image_descr
source: Whenever you use the copy/cut/paste functions in the clickmenus you will actually use the clipboard to store the element internally in TYPO3. If you select one of the numeric clipboard pads you will be able to store more than a single element on the clipboard at a time. In the record listings you will then see checkboxes next to the elements by which you can select/deselect elements for the clipboard.
ru: Когда используется функция копирования/вырезания/вставки в контекстном меню, на самом деле, для промежуточного хранения элементов внутри TYPO3, используется буфер обмена. Выбрав один из пронумерованных разделов буфера обмена, появляется возможность временного помещения в него нескольких элементов. В списке записей можно увидеть флажки рядом с каждым элементом, установив которые можно выбрать определенный элемент.

# list_module.alttitle
source: The Web>List module
ru: Модуль Веб>Список

# list_module.description
source: Listing records located on a page. From here you can copy/cut/paste records around in the system. You can edit records, access the change history of elements etc.
ru: Список записей на странице. Здесь можно копировать/вырезать/вставлять записи в системе. Возможно редактировать записи, права доступа, изменять историю элементов и т.п.

# list_module.details
source: The list module is like the file manager in an Operating System; it provides basic access to all "elements" available in the system. In TYPO3 almost all information is stored in the database and managed after the same principles internally. For instance Content Elements representing page content are database records just like backend users are. The Web>List module allows us to create, modify and delete both kinds of records after the same principles. The Web>List module might not be the best "view" of the content on a page for any situation. For instance if you want to manage website content on a page (Content Elements) you should rather use the "Web>Page" module which is designed to display content elements more optimized. But the List module will always give you access to whatever is on the page in a basic way if no better module is available for management. <b>Single-table mode</b> If you click the tabel title in the listing you will enter single-table mode. In this mode you can select additional fields from the table to show in the listing. Also you will get additional editing facilities, for instance you will be able to edit multiple records at a time and even only certain fields from those records. See the screenshot for more details.
ru: Модуль Список подобен файловому менеджеру в операционной системе; он обеспечивает основной доступ ко всем "элементам", доступным в системе. В TYPO3 почти вся информация хранится в базе данных и управляется по тем же правилам. Например, элемент содержимого, представляющий содержимое страницы — запись в базе данных, также как и внутренний пользователь. Модуль Веб>Список позволяет создавать, изменять и удалять оба типа записей по тем же правилам. Модуль Веб>Список не всегда лучший выбор для "представления" содержимого на странице. Например, если нужно управлять содержимым страницы сайта (элементами содержимого), лучше использовать модуль "Веб>Страница", лучше представляющий расположение элементов на странице. Но модуль Список дает доступ ко всем элементам на странице одинаковым образом и вряд ли есть модуль лучше подходящий для управления. <b>Режим одной таблицы</b> Щелчок по заголовку таблицы в списке, приведет к отображению одной этой таблицы. Здесь можно выбрать дополнительные поля в отображаемой таблице. Также появляется возможность дополнительного редактирования, например можно редактировать сразу несколько записей и даже одно нужное поле для всех этих записей. Детали приведены на снимке экрана.

# list_module.image_descr
source: Here the page "Cameras" has been clicked in the page tree and in the right frame the Web>List module shows the contents of the page. Here a single content element (Shop Plugin) is inserted in order to display the other items on the page which are three product records in this case. If you enable "Extended mode" and the "Clipboard" you will get additional buttons in the interface to operate on the records shown here. Also notice how you can click any record icon to get a "Clickmenu" for the element. Here you see the single-table mode active for the "Page content" table (Content Elements). In the fieldbox the "Hide" field is selected to be included in the listing. If you click any of the edit icons (marked with red border) you will be able to edit [from left to right] a) all listed fields (here "Header" and "Hide"), b) full record or c) a single field (eg. "Hide") for <u>only</u> the selected records (defined by the checkboxes seen).
ru: Здесь в дереве страниц была выбрана страница "Cameras" и в правом окне модуля Веб>Список показано содержимое страницы. Здесь это единственный элемент содержимого (Shop Plugin), вставленный для отображения других элементов на страниц, в данном случае, трех записей продуктов. Если включить "Расширенный режим" и "Буфер обмена", появятся дополнительные кнопки, для совершения действий над показанными здесь записями. Помните, что щелкнув по значку записи всегда можно вызвать контекстное меню для элемента. Здесь показан режим одной таблицы для таблицы "Pagecontent" (элементы содержимого). Блок выбора полей, выбрано поле "Hide". При щелчке по любому значку редактирования (выделены красной рамкой), можно будет отредактировать [с лева на право] а) все перечисленные поля (здесь "Header" и "Hide"), б) всю запись или в) одно поле (например "Hide") <u>только</u> для выбранных записей (отмечаются флажками).

# list_module_noId.alttitle
source: Web>List module with no ID given
ru: Модуль Веб>Список без задания ID

# list_module_noId.description
source: The Web>List module must have a page ID passed to it before it can display any content. Please click a page title in the Page Tree.
ru: В модуль Веб>Список перед обработкой нужно передать ID страницы, для отображения ее содержимого. Поэтому нужно щелкнуть по заголовку нужной страницы в дереве страниц.

# list_module_root.alttitle
source: Root of the Page Tree
ru: Корень дерева страниц

# list_module_root.description
source: The root of the Page Tree is having id 0 (zero = no page) and the special circumstance is that records in the page tree root can be accessed and edited <i>only</i> by "Admin" users.
ru: Корень дерева страниц имеет id=0 (ноль, то же самое, что "нет страницы") и специальное указание, что записи в корне дерева страниц могут быть вызваны и отредактированы <i>только</i> пользователями "администраторами"

# list_module_root.details
source: Only records from certain database tables are allowed to be created in the page tree root. This includes Backend Users, Backend Groups, File Mount records, Language records etc., and you cannot create Content Elements or Frontend Users in the root of the Page Tree. It also works the other way around; For example you cannot create Backend Users anywhere in the page tree. Usually records that are located in the page tree root are somehow "global" for the whole TYPO3 installation and doesn't make sense inside a specific branch of the page tree.
ru: В корне дерева страниц можно создавать только определенные таблицы в базе данных. Это внутренние пользователи, группы внутренних пользователей, записи для точек доступа, записи для языков и т.п., при этом нельзя в корне дерева страниц создавать внешних пользователей и элементы содержимого сайта. Есть и обратная сторона; например, нельзя создавать внутренних пользователей нигде в дереве страниц. Обычно записи, находящиеся в корне дерева страниц относятся "глобально" ко всей установке TYPO3 и не имеет смысла в определенной ветви дерева страниц.

# list_module_root.image_descr
source: Example of records in the page tree root; Backend users, groups, filemounts and website languages. When "Admin"-users wants to create a new record in the page tree root they will see a limited number of record types to create. This reflects which tables are configured to be created in the page tree root.
ru: Пример записей корневой страницы дерева; внутренние пользователи, их группы, точки доступа к файлам и языки сайта. При создании новой записи пользователем-"администратором" в корне дерева страниц, выводиться ограниченное число записей, которые можно здесь создать. Из этого становится понятно, какие таблицы можно здесь создавать.

# list_options.alttitle
source: List module options
ru: Параметры модуля Список

# list_options.description
source: Enable additional options like the "Extended view" mode to see additional control buttons for each record in the listing or the "Clipboard" to see the clipboard and its content.
ru: Включение дополнительных параметров, вроде режима "Расширенный вид", позволяющего увидеть дополнительные кнопки действий для каждой записи в списке, или "Буфер обмена", чтобы видите его и его содержимое.

# list_options.image_descr
source: The options checkboxes. Selecting "Extended view" will enable the control buttons in the record lists.
ru: Флаги параметров. Включение "Расширенного вида" включает дополнительные кнопки в списках записей.

# list_searchbox.alttitle
source: Search Box
ru: Поле поиска

# list_searchbox.description
source: By this search box you can do a free text search in all the listed records. You can also search recursively in sub-pages by selecting a number of levels to search in the selector box to the right of the search field.
ru: Его можно использовать для поиска любого текста во всем списке записей. Поиск можно проводить и по вложенным уровням подстраниц, выбирая количество уровней вложенности в выпадающем списке справа от поля поиска.

# menu_adminFunction.alttitle
source: Admin Functions
ru: Сервис управления

# menu_adminFunction.description
source: The Admin Functions allow administrators to clear caches etc.
ru: Сервис управления, например очистка кеша и т.п., доступны для администраторов.

# menu_adminFunction.details
source: TYPO3 has multiple caching systems: <b>Database Cache</b> A very central cache is the database cache table, "cache_hash", which needs to be flushed after certain major changes in the system. You "clear all cache" by clicking the link with the blue icon. After this operation any website content should be re-generated from the sources rather than be delivered from caches. This operation clears <i>all</i> database tables registered as flushable cache tables. <b>Cached PHP configuration files from Extensions</b> TYPO3 also caches small configuration scripts from extensions, "ext_localconf.php" and "ext_tables.php". These files are simply read from all installed extensions and concatenated into temporary PHP scripts found in the typo3temp/Cache/Code/cache_core/ folder. Sometimes you need to remove these files so TYPO3 re-writes them from the originals. This is done by the "Clear temp_CACHED" link. <b>Notice:</b> You should not clear these caches without a second thought. Clearing caches may affect performance on your server negatively for a while. Obviously the cached content has to be regenerated which takes time and under heavy load it might make your server un-available for a while.
ru: В TYPO3 применяется многоуровневая система буферизации: <b>Буферизация базы данных</b> Очень важно кешировать таблицы базы данных, "cache_hash", который нужно обновлять после важных изменений в системе. "Очистка всех кешей" происходит при щелчке по значку молнии вверху и дальнейшем выборе значка с красной молнией (примечание для новых версий). После этой операции, все содержимое сайта будет сформировано заново, а не взято из кеша. При этом будут очищены <i>все</i> таблицы базы данных, отмеченные, как очищаемые. <b>Кешируемые файлы PHP настроек из расширений</b> TYPO3 кеширует маленькие сценарии настроек из расширений, "ext_localconf.php" и "ext_tables.php". Эти файлы просто читают файлы из всех установленных расширений и собирают во временный сценарий PHP в папку typo3conf/, с названием "temp_CACHED_*.php". Иногда нужно удалять эти файлы, так, чтобы TYPO3 переписал их из оригиналов. Это делается через ссылку "Очистить кеш настроек". <b>Примечание:</b> не нужно слишком часто очищать эти кеши. Очистка кешей негативно отражается на производительности сервера. Ведь все содержимое буферов должно быть восстановлено, что занимает время, в течение которого сервер может быть недоступен.

# menu_modules.alttitle
source: Backend modules
ru: Модули внутреннего интерфейса

# menu_modules.description
source: The Backend menu reflects the hierarchy of main- and sub-modules in TYPO3. Click a menu item to access the corresponding module.
ru: Меню во внутреннем интерфейсе отражает структуру основных и подмодулей в TYPO3. Щелкните по элементу меню для доступа к соответствующему модулю.

# menu_modules.details
source: Backend Users might see different menu items depending on their access permissions. The "Admin" user on a system will always see all modules available. You can configure the backend to display the menu in two alternative versions (useful on smaller screens); As a selector box or list of icons in the top frame of the backend. When you click the little "+" or "-" icons next to the main modules, you can collapse (-) or expand (+) all the sub modules. By selecting the "Expand all" check box, all items are expanded. When the checkbox is unselected again, the menu changes back to the previous folding state. If you click "Expand all" and collapse a main module afterwards, the previous folding state is discarded and "Expand all" is unselected again.
ru: Пользователи внутреннего интерфейса могут видеть разные элементы меню, в зависимости от их прав доступа. Пользователям "администраторам" системы доступны все установленные модули. Можно настроить внутренний интерфейс на отображение меню в двух вариантах (полезно для маленьких экранов); Как блок выбора или список значков в верхней части окна внутреннего интерфейса. При щелчке по маленькому значку "+" или "-", рядом с основными модулями, можно свернуть (-) или развернуть (+) все их подмодули. Установка флажка "Развернуть все" развернет все элементы меню. Снятие флажка вернет меню к предыдущему состоянию. Если поставить флажок "Развернуть все" и свернуть какой-нибудь основной модуль, то это уберет флажок "Развернуть все" и предыдущее состояние меню уже нельзя будет вернуть.

# menu_modules.image_descr
source: This is the range of menu options for a typical backend user. For another backend user it might be different. This screenshot shows how another user has different permissions set and therefore access to other modules only. Also the backend language has been set different for this user.
ru: Типичные элементы меню для обычного пользователя внутреннего интерфейса. У другого внутреннего пользователя могут быть другие элементы меню. Это снимок экрана для другого пользователя, имеющего другие права доступа, а, следовательно, и доступ к другим модулям. Для разных пользователей можно установить и разный язык во внутреннем интерфейсе.

# move_el_cs.alttitle
source: Move Content Element Wizard
ru: Мастер перемещения элементов содержимого

# move_el_cs.description
source: By this wizard you can visually re-position (or copy) a Content Element inside TYPO3. The element you move is shown in the top.
ru: Этот мастер облегчит перемещение (или копирование) элементов содержимого внутри TYPO3. Перемещаемый элемент показан сверху.

# move_el_cs.details
source: By the grey icons in the content element list you can point out the new position of the content element. If you need to move the element to another page, simply browse the page tree in the bottom of the wizard.
ru: Щелкнув по серому значку в списке элементов содержимого, можно указать новую позицию выбранного элемента. Если нужно переместить элемент на другую страницу, просто выберете нужную страницу в дереве страниц снизу.

# move_el_cs.image_descr
source: The wizard works like when you create new Content Elements with the wizard; You position the element by the grey arrows. To access the "Move Content Element Wizard" you click the "Move element" icon in the "Extended view" of the Web>List module.
ru: Мастер работает наподобие мастера создания нового элемента содержимого; возможная позиция элемента показана серыми стрелками. Для доступа к "Мастер перемещения элементов содержимого", щелкните по значку "Переместить элемент" в режиме "Расширенный вид" модуля Веб>Список.

# move_el_pages.alttitle
source: Move page wizard
ru: Мастер перемещения страниц

# move_el_pages.description
source: By this wizard you can visually re-position (or copy) a page inside TYPO3. The element you move is shown in the top.
ru: Этот мастер облегчит перемещение (или копирование) страниц внутри TYPO3. Перемещаемый элемент показан сверху.

# move_el_pages.details
source: As an alternative to using the regular Copy/Cut/Paste functions in the clickmenus of records you can also use the move-page wizard. It lets you re-position a page by a visual view of the page tree rather than using the concept of "Paste into" and "Paste after".
ru: В качестве альтернативы использования обычных функций копирования/вырезания/вставки контекстного меню можно использовать мастер перемещения страниц. Он позволяет перемещать страницы, получая визуальное представление дерева страниц, а не абстрактное "вставить внутрь" и "вставить после".

# move_el_pages.image_descr
source: The wizard works like when you create new pages with the wizard; You position the element by the grey arrows. To access the "Move page wizard" you open the clickmenu of the page, select "More options..." and then "Move page". Alternatively you can click the "Move page" icon in the "Extended view" of the Web>List module.
ru: Мастер работает наподобие мастера создания новой страницы; возможная позиция элемента показана серыми стрелками. Для доступа к "Мастеру перемещения страниц", вызовите контекстное меню для страницы, выберете там "дополнительные параметры..." и в них "переместить страницу". Либо можно щелкнуть по значку "Переместить страницу" в режиме "Расширенный вид" модуля Веб>Список.

# new_ce.alttitle
source: Create new Content Element Wizard
ru: Мастер создания нового элемента содержимого

# new_ce.description
source: Content Elements come in many flavors and inserting new content on a page means you have to select the right element type. This wizard helps you to pick a main type of element before you actually begin to enter content.
ru: Существует большое количество разновидностей элементов содержимого, и добавление нового элемента на страницу означает выбор нужного типа содержимого. Этот мастер облегчает выбор основных типов элементов перед тем, как туда будет помещено нужное содержимое.

# new_ce.details
source: Selecting an element type here will just preset the content element with certain values. You can always change the values later and if you cannot find exactly the type you need you can just pick the one that comes closest to your need, then adjust the details later.
ru: Выбор здесь типа элемента лишь предустановить элемент содержимого с определенными настройками. В будущем всегда возможно поменять введенные значения и если вы не можете выбрать тип элемента точно, выберете примерно соответствующий целям, а детали можно ввести позже.

# new_ce.image_descr
source: The Content Element wizard presents a set of preset types. Just select one by clicking its title. After selecting the type you will (often) have to select a position of the element among the other existing Content Elements on the page. You can access the Content Element wizard from the Create new record dialog.
ru: Мастер создания элементов содержимого представляет набор предустановленных типов. Выберете один из них, просто щелкнув по его названию. После выбора типа, нужно (зачастую) выбрать позицию этого элемента по отношению к уже имеющимся на странице. Вызвать мастера создания нового содержимого можно в диалоге создания новой записи.

# new_pages.alttitle
source: Create new page wizard
ru: Мастер создания новой страницы

# new_pages.description
source: Creating a new page means you have to find a position for it in the page tree. This wizard helps you find this position easily by clicking the flashing arrow pointing to the position you want.
ru: Создание новой страницы означает указание ее места в дереве страниц. Этот мастер облегчит это, нужно лишь щелкнуть по стрелке, указывающей на нужное место.
