Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: ru

# .alttitle
source: TYPO3 Core
ru: Ядро TYPO3

# bookmarks.alttitle
source: Backend Bookmarks
ru: Закладки во внутреннем интерфейсе

# bookmarks.description
source: You can create bookmarks to modules in TYPO3 quite easily. The treat is that you can jump between screens in TYPO3 in <em>one</em> click rather than multiple clicks through backend modules etc. The frame also contains a field for entering a page or record id to edit or just search records.
ru: Закладки для модулей в TYPO3 создаются очень просто. При их помощи можно очень быстро, <em>одним</em> щелчком, перемещаться между модулями внутреннего интерфейса. Во фрейме также имеется поле для ввода id страницы или записи для перехода к ее редактированию или просто поиска.

# bookmarks.details
source: In order to create a bookmark it must be supported by the module you want to create the bookmark to. Whether bookmarks are supported can be seen in the top of a module. If there is a small star icon you can click it to create the bookmark.
ru: Для создания закладки, нужна их поддержка со стороны модуля, на который создается закладка. Судить об этом можно по верхней части модуля - если там имеется небольшая звездочка, то щелкнув по ней, можно создать закладку.

# bookmarks.image_descr
source: To create a bookmark to a page, just click the star icon usually found in the top of pages. You will have to confirm the creation of the bookmark. It is nothing dangerous - only annoying to clean up if you happen to create bookmarks against your own will. Just answer "OK" here. When you answer "OK" you should immediately see the bookmark icon in the toolbar reloading and, after opening the menu, the new entry appear. If you click this entry, you will now jump to the page you created the bookmark from! You can name bookmarks, you can even group them and share them. If you want to edit or delete a bookmark you select the "Edit" checkbox and then click the bookmark icon.
ru: Чтобы создать закладку на страницу, просто щелкните по звездочке, обычно находящейся в верхней части страницы. Необходимо подтвердить создание закладки. Ничего страшного - просто защита от создания нежелательных закладок, нажмите "OK". После согласия, значок закладки сразу же появится в обновленной панели инструментов, а в меню появится новый пункт. Щелкнув по нему, можно сразу же перейти на страницу с закладкой! Закладкам можно давать названия, группировать и делать их общими. Для правки или удаления закладок, отметьте флажок "Правка" и щелкните по значку закладки.

# .description
source: TYPO3 is a Content Management Framework which consists of a central program core with only limited functionality. To extend this core system there are hundreds of extensions which in combination will provide a very capable system.
ru: TYPO3 это система управления информационным содержимым, состоящая из основной программы, ядра с ограниченной функциональностью. Для расширения основной функциональности существует тысячи расширений, сочетание которых делает систему очень гибкой.

# .details
source: For most people TYPO3 is equivalent to a CMS providing a backend for management of the content and a frontend engine for website display. However TYPO3s core is natively designed to be a general purpose framework for management of database content. The core of TYPO3 delivers a set of principles for storage of this content, user access management, editing of the content, uploading and managing files etc. Many of these principles are expressed as an API (Application Programmers Interface) for use in the <em>extensions</em> which ultimately adds most of the real functionality.
ru: Для большинства людей, TYPO3 одна из CMS, с внутренним интерфейсом управления информационным содержимым и движком внешнего интерфейса, для отображения сайта. Тем не менее, ядро TYPO3 в основном разрабатывался для управления содержимым базы данных. Ядро TYPO3 предоставляет набор основных правил для хранения этого содержимого, управления доступом пользователей, редактирования содержимого, загрузки и управления файлами и т.д. Многие из этих правил представлены как API (интерфейс прикладного программирования) для применения в <em>расширениях</em>, которые, в свою очередь, добавляют основную функциональность.

# file_edit.alttitle
source: Editing a file
ru: Редактирование файла

# file_edit.description
source: You can edit the contents of a text file with this dialog.
ru: Здесь возможно отредактировать содержимое текстового файла.

# file_edit.image_descr
source: The editing form for a file is this simple textarea field. It's nothing fancy and experienced coders will miss such as TAB-functionality, but it can edit a stylesheet if badly needed...
ru: Форма редактирования текстового файла - простое текстовое поле. Здесь, конечно, отсутствует встроенная помощь по редактированию и исправлению ошибок, а также дополнительная функциональность, например расстановка табуляций, но вполне возможно проделать простое редактирование...

# filelist_clipboard.alttitle
source: Filelist Clipboard
ru: Буфер обмена в списке файлов

# filelist_clipboard.description
source: The TYPO3 clipboard works for files as well as for database records (see the Web>List module). You only need to enable the clipboard if you want to use the numeric clipboard pads.
ru: Для файлов буфер обмена в TYPO3 работает также, как и для записей (смотрите модуль Веб>Список). Всего лишь нужно включить один из пронумерованных буферов обмена.

# filelist_clipboard.image_descr
source: This shows the "Normal" pad on the clipboard. Here an image is now stored. The "Thumbnails" button of the clipboard is enabled so you will see the image icon. When the numeric clipboard pads are enabled you will be able to place multiple items on the clipboard at one time. If the items selected are found in the current folder you can also see the selection reflected in the checkboxes of the items. To paste the contents into a file folder you use the paste icons available in the Filelist module.
ru: Здесь показан "Обычный" буфер обмена, в который помещено изображение. Доступна кнопка "Эскизы" для просмотра значка изображения. Если включены нумерованные буферы обмена, возможно за раз поместить в них несколько элементов. Если выбранные элементы находятся в текущей папке, это отображается на флажках выбора элементов. Для помещения содержимого в папку используйте значок вставки в модуле Список файлов.

# filelist_module.alttitle
source: File > Filelist module
ru: Модуль Файл > Список файлов

# filelist_module.description
source: Shows the files and folders from the folder title you have clicked in the folder tree. Click the icons of the files and folders to perform various actions on the elements.
ru: Показывает файлы и папки из выбранной в файловой структуре папки. Щелкнув по значку папки или файла, можно выбрать действие, которое нужно с ними сделать.

# filelist_module.details
source: The File > Filelist module provides the main interface to the web-based "FTP-features" in TYPO3. Clicking a folder in the navigation frame will display the files in that folder in the list frame to the right. If you click the icon of a file you will see a menu pop up with menu items related to the file or folder. This enables you to edit, rename and copy files to name a few. <b>The "TEMP" folder</b> There is a special folder, the "TEMP" folder. This is meant to be used for temporary uploads of files that are going to be attached to TYPO3 records later. Content in the TEMP folder should be possible to flush once in a while when the folder becomes too crowded with files. So don't store persistent data in there! The actual folder name is actually "_temp_". The interface will just interprete this with "TEMP" in bold. The same applies to folders named "_recycler_" - they will be trash cans in the folder tree.
ru: Модуль Файл > Список файлов предоставляет основной интерфейс для сетевого FTP-доступа в TYPO3. Щелкнув по папке в окне навигации можно просмотреть находящиеся в ней файлы и папки в правой части окна. Щелчок по значку файла или папки вызовет контекстное меню, с относящимися к выбранному элементу действиями. При этом будет возможно редактирование, переименование или копирование. <b>Папка "TEMP"</b> Существует специальная папка "TEMP". Она используется для временных загрузок файлов, которые в дальнейшем будут прикреплены к записям TYPO3. Содержимое этой папки должно периодически сбрасываться на диск, так как папка зачастую может переполняться файлами. Поэтому не используйте ее для хранения постоянных данных! Настоящее название папки — "_temp_". Оно просто интерпретируется интерфейсом, как "TEMP". То же самое применимо для папок с названием "_recycler_" - это корзины для удаленных файлов.

# filelist_module.image_descr
source: Here the content of the TEMP folder is shown in the list frame. You can see the filetype, the modification time, size of the file. If you click the filename you will open the file in the browser (if the path is in the web-root). When you click a file icon you see a context menu appear over it. Here you can perform file operations on the item.
ru: Здесь показано содержимое папки TEMP. Можно увидеть типы файлов, время их изменения, размер. Щелчок по названию файла откроет его в браузере (если указан путь от корня сайта). Щелчок по значку файла откроет контекстное всплывающее меню. Здесь можно выбрать действие, которое нужно совершить с файлом.

# filelist_options.alttitle
source: File > Filelist options
ru: Параметры Файл > Список файлов

# filelist_options.description
source: You can enable the display of image thumbnails and show the clipboard if you need to copy/cut/paste multiple files or folders at a time.
ru: Можно отобразить эскизы изображений и включить буфер обмена для операций копирования/вырезания/вставки нескольких файлов или папок за раз.

# filelist_options.image_descr
source: Enabling thumbnails means that all image file types will be displayed with their thumbnails. This makes it easy to browse an archive of files.
ru: Включение эскизов означает, что все файлы изображений будут показаны в виде небольших эскизов, что удобно для их поиска.

# file_newfile.alttitle
source: Creating a new file
ru: Создание нового файла

# file_newfile.details
source: Newly created files will have the size of 0 (zero). After creating a new file it would be natural that you wanted to edit the file to put content into it. This is done simply by clicking the icon of the file and select "Edit" from the clickmenu.
ru: Новые файлы будут иметь нулевой размер. После создания нового файла, было бы естественно добавить в него содержимое. Это делается простым щелчком по значку этого файла с последующим выбором из контекстного меню пункта "Правка".

# file_newfile.image_descr
source: To create a new file, first click the folder icon where you want to create the file. Select "New". Then enter the filename in the dialog in the right frame. After pressing "Create file" you will see a new, empty file in the folder you selected.
ru: Для создания нового файла, сначала щелкните по значку папки, в которой нужно создать новый файл, а затем выберете пункт "Новый". После чего в окне справа введите название файла. Нажав на "Создать файл", можно увидеть новый пустой файл в выбранной папке.

# file_newfolder.alttitle
source: Creating a new folder
ru: Создание новой папки

# file_newfolder.description
source: Enter a name for a new file folder in the tree here. If you want to create multiple folders, please select the number of new folders before entering folder names.
ru: Введите название для новой папки в дереве страниц. Если нужно создать несколько папок, выберете их количество перед вводом названий.

# file_newfolder.image_descr
source: To create a new folder you first click the parent folder icon in the folder tree. As the next step you select the number of folders to create and then you enter the new folder names. After pressing the "Create folders" button the folders will appear in the folder tree when you reload it.
ru: Для создания новой папки, сначала щелкните по значку родительской папки в дереве страниц. На следующем этапе выберете количество создаваемых новых папок и введите их названия. После нажатия на кнопку "Создать папки", новые папки появятся в дереве файлов после его обновления.

# file_rename.alttitle
source: Rename a file or folder
ru: Переименование файла или папки

# file_rename.description
source: You can rename files or folders in TYPO3 quite easily. Just notice that certain characters are not allowed. So use a-z, numbers, underscores and don't make the names too long. If you enter invalid characters it will be automatically corrected.
ru: Переименовывать файлы или папки в TYPO3 очень легко. Но помните, что некоторые символы недопустимы. Используйте буквы a-z, числа, почеркивания и не делайте очень длинные имена. При вводе неверных символов, они будут автоматически откорректированы.

# file_rename.image_descr
source: To rename a file (or folder for that sake) just click the icon of it, select "Rename" and enter the new name. Notice that restrictions may apply on filenaming, for instance ".php" is usually not a valid extension of a filename for security reasons.
ru: Для переименования файла (или папки) просто щелкните по его значку, выберете "Переименовать" и введите новое название. Помните, что при переименовании нужно соблюдать определенные правила, например, расширение ".php" недопустимо по правилам безопасности.

# filetree.alttitle
source: The Folder Tree
ru: Дерево файловой структуры

# filetree.description
source: Shows the directory structure of a mounted path on the webserver. You can browse the folder tree like you are used to browse the file system on your own computer.
ru: Показывается файловая структура с установленной точки доступа к серверу. Можно перемещаться по дереву файлов, подобно тому, как перемещаетесь по файловой структуре на своем компьютере.

# filetree.details
source: The Folder Tree is available for any sub-module of the File main module in TYPO3. The File module is like a little web-based FTP-client inside of TYPO3 which allows you to upload, rename, copy, move, delete and edit files inside TYPO3. Most users of TYPO3 doesn't need access to the File module and sub-modules in order to upload images on web-pages. They can do this directly when editing Content Elements. But the File module is useful for maintaining collections of files on the server, for example an image archive or files for download. <b>Navigating the Folder Tree</b> You can expand and contract the folder tree by the +/- icons. Clicking a folder icon will display a pop-up menu with options related to that particular folder. Options include copy/cut/paste, rename, upload etc. Clicking the folder title will load the currently active sub-module in the right frame of the backend. The sub-module will typically show files and folders inside the folder you clicked. <b>Granting access to the Folder Tree</b> The administrator needs to allow backend users to access the File modules and in addition make a file mount available to them before they can use the Folder Tree.
ru: Дерево папок доступно для подмодулей основного модуля Файл в TYPO3. Модуль Файл похож на маленький сетевой FTP клиент внутри TYPO3, позволяющий загружать, переименовывать, копировать, перемещать, удалять и редактировать файлы внутри TYPO3. Большинству пользователей TYPO3 не нужен доступ к модулю Файл и его подмодулям для загрузки изображений на страницы. Они могут это делать непосредственно при редактировании элемента содержимого. Но этот модуль полезен для загрузки множества файлов на сервер, например архива изображений или файлов для скачивания с сервера. <b>Перемещение по дереву файлов</b> Щелчок по кнопкам +/- развернет/свернет ветви дерева. Щелчок по значку папки выведет всплывающее контекстное меню с доступными действиями для выбранной папки. Действия включают копирование/вырезку/вставку, переименование, загрузку и т.п. Щелчок по заголовку папки загрузит выбранный в текущий момент подмодуль в правом окне. Обычно подмодуль отображает файлы и папки в текущей, выбранной папке. <b>Предоставление доступа к дереву файлов</b> Администраторы должны предоставить внутренним пользователям доступ к файловым модулям и дополнительно сделать доступной точку доступа к структуре файлов.

# filetree.image_descr
source: The Folder Tree of the "fileadmin/" folder. This is mounted by default for "Admin"-users. Other users will have to have a file mount configured for them first. Clicking the icon of a folder displays the context menu of the folder. If you click the folder title in the Folder Tree you will see the sub-module loaded in the right frame. Here it is the File > Filelist module that will display files and folders inside. Clicking the icon of a file will display a context menu for the file.
ru: Дерево файлов папки "fileadmin/". Обычно к этой точке имеют доступ пользователи-"администраторы". Для других пользователей точки доступа нужно настраивать. Щелчок по значку папки выведет контекстное меню для этой папки. Щелчок по названию папки, загрузит в правое окно выбранный в меню подмодуль. Здесь это модуль Файл > Список файлов, отображающий содержащиеся в папке файлы и папки. Щелчок по значку файла выведет контекстное меню для этого файла.

# file_upload.alttitle
source: Uploading files.
ru: Загрузка файлов

# file_upload.description
source: Here you can upload one or more files to the server. Start by selecting the number of files to upload, then you begin to select files from your local computer to upload.
ru: Здесь можно загрузить один или несколько файлов на сервер. Начните с выбора количества загружаемых файлов, затем выберете файлы на локальном компьютере.

# file_upload.details
source: If the filenames you upload exist already they will be renamed with a numeric suffix, eg. "file_01.jpg". However you can avoid this behaviour if you select "Overwrite existing files" before pressing the "Upload" button. Normally there is a limit to the size of files you can upload. By default PHP will allow you to upload around 2MB. TYPO3 is configured to allow 10MB internally by default. These settings can be changed by your server administrator if you need them changed. Notice that file uploads may take a significant amount of time, even if you have fast internet access via DSL etc. If you have large amount of files you want to upload - or if the files are very large - you should consider using an FTP client instead. It depends not on TYPO3 but on the webserver whether this is an options for you.
ru: Если файл с таким же названием уже существует, то к названию будет добавлена цифра, например "file_01.jpg". В любом случае, можно избежать этого, поставив флажок "Перезаписать существующие файлы" перед нажатием на кнопку "Загрузить". Обычно существует ограничение на размер загружаемых файлов. По умолчанию в PHP позволено загружать примерно 2МБ. Внутренняя настройка TYPO3 по умолчанию позволяет загружать файлы размером 10МБ. Эти установки при необходимости могут быть изменены администратором сервера. Помните, что загрузка файлов может занять много времени, даже при быстром соединении через DSL и т.п. При загрузке большого количества файлов, или файлов большого размера, лучше использовать FTP клиент. Это не зависит от TYPO3, но только от сервера, на котором работает система.

# file_upload.image_descr
source: To upload files, first click the folder icon where you want to upload to. From the clickmenu you select "Upload files". In the next screen you select the number of files and click the "Browse..." buttons to select files from your computer. Finally you click the "Upload files" button to start the upload process (which might take some minutes with large files!)
ru: Для загрузки файлов, сначала щелкните по значку папки, в которую нужно загрузить файлы. В контекстном меню выберете "Загрузить файлы". В появившемся диалоговом окне выберете количество файлов, затем щелкните по кнопке "Проводник...", для выбора загружаемых файлов на своем компьютере. И наконец нажмите на кнопку "Загрузить файлы" для начала процесса загрузки (который может занять несколько минут!).

# history_entry.alttitle
source: Log entry history
ru: Журнал элемента

# history_entry.description
source: This view displays the changes made to the content element for the log entry you clicked. The red and green values in the text shows the previous/new values of the record.
ru: Этот режим показывает изменения, сделанные в элементе содержимого за выбранный в журнале сеанс. Красный, зеленый текст соответствует предыдущим/новым значениям в записи.

# history_entry.details
source: <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
ru: <b>Примечание:</b> если не видны красные/зеленые метки различий, значит сервер, на котором выполняется TYPO3, не поддерживает разметку отличий или был некорректно настроен.

# history_log.alttitle
source: History log
ru: Журнал истории

# history_log.description
source: The History log gives you a visual overview of the changes that has happened to the element over the last editing operations. You can roll back changes to any state by using the icons in the interface.
ru: Журнал дает визуальное представление о сделанных изменениях в элементах при последних операция редактирования. Можно вернуть сделанные изменения до любого состояния, используя значки интерфейса.

# history_log.details
source: By default 20 states of history data is preserved in TYPO3 and after a week it expires. The history is very useful for tracking changes to a record since you can see which user did what at which point in time - and roll back any changes you didn't like. If you click the roll-back pencil you will revert the element to the state it had at that particular time. If you click the Info icon you will see in detail what the difference is from current time to this state of the element. <b>Configuring levels and expire times [for admins]</b> If you want to extend the number of history states to above the default 20 you can easily do so using Page TSconfig - meaning that it can even depend on the branch of the page tree where the record is stored! See link below. <b>Notice:</b> If you do not see red/green difference values, the server TYPO3 runs on does not support making difference views or it has been incorrectly configured to provide this feature.
ru: По умолчанию в журнале TYPO3 сохраняются 20 изменений за неделю. Журнал очень полезен для отслеживания изменений записей, можно увидеть кто и что сделал и в какое время, — и вернуть все, что нужно. Щелкнув по карандашу, можно вернуть состояние элемента в определенное время. Щелкнув по значку информации, можно увидеть детальные различия в состоянии элемента сейчас и в определенном времени. <b>Настройка уровней и времени хранения [для администраторов]</b> Если нужно сделать количество хранимых уровней событий выше установленных по умолчанию 20, это легко можно осуществить через TSconfig страницы, что означает зависимость этого параметра даже от места нахождения записи в дереве страниц! Смотрите приведенные ссылки. <b>Примечание:</b> если не видны красные/зеленые метки различий, значит сервер, на котором выполняется TYPO3, не поддерживает разметку отличий или был некорректно настроен.
