Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_tools_em.xlf
Languages: ru

# security_warning_extensions
source: Please be aware that extensions are third-party software. Installing an extension is a security risk, as the high level of quality and security in the TYPO3 Core can not be assured in these extensions.
ru: Расширения представляют собой стороннее программное обеспечение. Установка расширений несет потенциальный риск безопасности, поэтому ядро TYPO3, как образец качества в отношении безопасности, не может гарантировать того же самого в расширениях.

source: Show:
ru: Показать:

# show_changed
source: Changed? (takes time!)
ru: Изменения (занимает время!)

# show_description
source: Description
ru: Описание

# show_details
source: Details
ru: Детали

# show_exts_without_security_check
source: Enable extensions without review (basic security check):
ru: Доступность расширений без их обзора (основная проверка безопасности):

# showing_extensions_from_to
source: Showing extensions %s to %s
ru: Показаны расширения с %s по %s

# show_more_details
source: More details
ru: Дополнительная информация

source: Show obsolete:
ru: Показать устаревшие:

# show_technical
source: Technical (takes time!)
ru: Техническая (занимает время!)

# show_validating
source: Validating (takes time!)
ru: Проверка (занимает время!)

# state_alpha
source: Alpha
ru: Альфа

# state_beta
source: Beta
ru: Бетта

# state_exclude_from_updates
source: Exclude From Updates
ru: Исключить из обновлений

# state_experimental
source: Experimental
ru: Экспериментальное

# state_obsolete
source: Obsolete
ru: Устаревшее

# state_stable
source: Stable
ru: Стабильное

# state_test
source: Test
ru: Тестирование

# sysext
source: System extension
ru: Системные расширения

# system_folder
source: System (typo3/sysext/)
ru: системное (typo3/sysext/) местоположение

# tab_mod_comment
source: Upload-Comment
ru: Комментарий для версии

# tab_mod_key
source: Ext-Key
ru: Ключ

# tab_mod_location
source: Location
ru: Местоположение

# tab_mod_loc_ver
source: Local
ru: Локальная

# tab_mod_name
source: Extension
ru: Расширение

# tab_mod_rem_ver
source: Remote
ru: В репозитории

# terCommunication_ext_version
source: The extension is now available in version %s.
ru: Расширение не доступно в версии %s.

# translation_check_done
source: Check done.
ru: Проверка выполнена

# translation_checking_extension
source: Checking translation status for extension \"%s\"...
ru: Проверка состояния перевода для расширения \"%s\"...

# translation_check_status
source: Checking translation status, please wait...
ru: Проверка состояния переводов, ждите...

# translation_check_status_button
source: Check status against repository
ru: Проверить изменения в репозитории

# translation_extension_key
source: Extension key
ru: Ключ расширения

# translation_full_check_update
source: If you want to force a full check or update, delete the l10n zip-files from the typo3temp folder.
ru: Если нужна полная проверка или обновление, удалите файлы l10n zip из папки typo3temp.

# translation_has_been_updated
source: Has been updated
ru: Обновлен

# translation_info
source: For the selected languages the EM tries to download and install translation files if available, whenever an extension is installed. (This replaces the <code>csh_*</code> extensions that were used to install core translations before TYPO3 version 4!)
ru: Модуль управления расширениями попытается закачать и установить файлы перевода для выбранных языков, всякий раз при установке расширений. (Замена расширениям <code>csh_*</code>, использующимся до версии 4 TYPO3)!

# translation_is_ok
source: Is up to date
ru: Обновлено

# translation_loaded_exts
source: To request an update or installation for already loaded extensions, see below.
ru: Для запроса обновления или установки для уже загруженных расширений, смотрите дальнейшие рекомендации.

# translation_n_a
source: N/A
ru: Н.д.

# translation_needs_update
source: Needs update
ru: Требуется обновление

# translation_not_installed
source: Not installed/Unknown
ru: Не установлено/неизвестно

# translation_no_translation
source: No translation available
ru: Перевод недоступен

# translation_problems
source: Possible reasons: Network problems, allow_url_fopen is off, cURL is not enabled in the Install Tool
ru: Возможные причины: проблемы с сетью, выключен allow_url_fopen, cURL не включен в Инструменте установки

# translation_save_selection
source: Save selection
ru: Сохранить выбранное

source: Translation Settings
ru: Настройки перевода

source: Translation status
ru: Состояние перевода

# translation_status_could_not_fetch
source: Could not fetch translation status
ru: Невозможно получить состояние переводов

# translation_status_error
source: ERR
ru: ОШ.

# translation_status_ok
source: OK
ru: ОК

# translation_status_update
source: UPD
ru: ОБН

# translation_table_check
source: This table shows the status of the translations of the loaded extensions.
ru: В этой таблице показано состояние переводов для загруженных расширений.

# translation_table_update
source: This table shows the update results of the translations of the loaded extensions.
ru: В этой таблице показаны результаты обновления переводов для загруженных расширений.

# translation_unpacking_failed
source: Unpacking the language pack failed!
ru: Ошибка при распаковке языкового пакета!

# translation_update_button
source: Update from repository
ru: Обновить из репозитория

# translation_update_done
source: Update done.
ru: Обновление проведено

# translation_update_status
source: Updating translations, please wait...
ru: Обновление переводов, ждите...

# translation_updating_extension
source: Updating translation for extension \"%s\"...
ru: Обновление перевода для расширения \"%s\"...

# tsStyleConfigForm_additional_config
source: This extension provides additional configuration options which become available once it is installed.
ru: Это расширение предоставляет дополнительные параметры для настройки, которые становятся доступными сразу после установки расширения..

# tsStyleConfigForm_note
source: Note
ru: Примечание

# type_global
source: Global
ru: Глобальные

# type_local
source: Local
ru: Локальные

# type_system
source: System
ru: Системные

# updateLocalEM_CONF_no_content
source: No content to write to "%s"!
ru: Нечего записывать в "%s"!

# updateLocalEM_CONF_not_found
source: Error: No file "%s" found. DON'T PANIC!
ru: Ошибка: файл "%s" не найден. БЕЗ ПАНИКИ!

# updateLocalEM_CONF_not_writable
source: Error: "%s" was not writable!
ru: Ошибка: "%s" защищен от записи!

# updateLocalEM_CONF_ok
source: The file "%s" was updated with a cleaned up EM_CONF array.
ru: Был обновлен файл "%s", вместе с очисткой массива EM_CONF.

# updatesForm_make_updates
source: Make updates
ru: Обновить

# upload_ext_directly
source: Upload extension file directly (.t3x):
ru: Загрузить непосредственно файл расширения (.t3x):

# upload_ext_file
source: Upload extension file
ru: Загрузить файл расширения

# upload_t3x
source: Upload extension file (.t3x):
ru: Загрузка файла расширения (.t3x):

# upload_to_location
source: ...to location:
ru: ...в:

source: User Settings
ru: Настройки пользователя

source: (write-protected)
ru: (защита от записи)
