Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_tools_em.xlf
Languages: ru

# available_extensions
source: Available Extensions - Grouped by: %s
ru: Доступные расширения – группировать по: %s

# category_BE
source: Backend
ru: Внутренний интерфейс

# category_BE_modules
source: Backend Modules
ru: Модули внутреннего интерфейса

# category_documentation
source: Documentation
ru: Документация

# category_examples
source: Examples
ru: Примеры

# category_FE
source: Frontend
ru: Внешний интерфейс

# category_FE_plugins
source: Frontend Plugins
ru: Расширения внешнего интерфейса

# category_miscellanous
source: Miscellaneous
ru: Смешанное

# category_services
source: Services
ru: Службы

# category_templates
source: Templates
ru: Шаблоны

# checkDBupdates_add_fields
source: Add fields
ru: Добавление полей

# checkDBupdates_add_tables
source: Add tables
ru: Добавление таблиц

# checkDBupdates_changing_fields
source: Changing fields
ru: Изменение полей

# checkDBupdates_import_static_data
source: Import static data
ru: Импорт статических данных

# checkDBupdates_rows
source: Rows:
ru: Строки:

# checkDBupdates_table_exists
source: Table exists!
ru: Таблица существует!

# checkDependencies_conflict_error
source: Conflict Error
ru: Ошибка конфликта

# checkDependencies_conflict_ignored
source: Conflict with %s ignored as requested.
ru: Конфликт с %s проигнорирован по запросу.

# checkDependencies_conflict_remove
source: The extensions "%s" and "%s" (%s) will conflict with each other. Please remove "%s", if you want to install "%s".
ru: Расширения "%s" и "%s" (%s) конфликтуют друг с другом. Удалите "%s", если нужно установить "%s".

# checkDependencies_ext_not_available
source: The extension "%s" was not available in the system. Please import it from the TYPO3 Extension Repository.
ru: Расширение %s недоступно в системе. Импортируйте его из репозитория расширений TYPO3.

# checkDependencies_ext_not_installed
source: Extension "%s" (%s) was not installed. Please install it first.
ru: Расширение "%s" (%s) не было установлено. Сначала нужно установить его.

# checkDependencies_exts_suggested_by_ext
source: Extensions suggested by extension "%s"
ru: Расширения, предложенные расширением "%s"

# checkDependencies_ext_too_high
source: The running version of extension "%s" (%s) is higher than allowed (%s).
ru: Работающая версия расширения "%s" (%s) выше позволенной (%s).

# checkDependencies_ext_too_low
source: The running version of extension "%s" (%s) is lower than required (%s).
ru: Работающая версия расширения "%s" (%s) ниже требуемой (%s).

# checkDependencies_ignore_conflict
source: Ignore this conflict error
ru: Игнорировать эту ошибку конфликта

# checkDependencies_ignored
source: Dependency on %s ignored as requested.
ru: Зависимость от %s проигнорировано по запросу.

# checkDependencies_ignore_ext_requirement
source: Ignore this extension requirement
ru: Игнорировать требование этого расширения

# checkDependencies_ignore_requirement
source: Ignore this version requirement
ru: Игнорировать требование к версии

# checkDependencies_ignore_suggestion
source: Ignore this suggestion
ru: Игнорировать это предложение

# checkDependencies_import_ext
source: Import this extension to the 'local' directory typo3conf/ext/ from online repository.
ru: Импорт этого расширения в "локальную" папку typo3conf/ext/ из сетевого хранилища.

# checkDependencies_import_now
source: Import now (opens a new window)
ru: Импортировать немедленно (будет открыто новое окно)

# checkDependencies_install_now
source: Install now (opens a new window)
ru: Установить немедленно (будет открыто новое окно)

# checkDependencies_php_too_high
source: The running PHP version (%s) is higher than allowed (%s).
ru: Версия PHP (%s) выше позволенной (%s).

# checkDependencies_php_too_low
source: The running PHP version (%s) is lower than required (%s).
ru: Версия PHP (%s) ниже требуемой (%s).

# checkDependencies_remove_now
source: Remove now (opens a new window)
ru: Удалить немедленно (будет открыто новое окно)

# checkDependencies_suggest_import
source: Extension "%s" was not available in the system. You may want to import it from the TYPO3 Extension Repository.
ru: Расширение "%s" не было доступно в системе. Возможно, вы хотите импортировать его из репозитория расширений TYPO3.

# checkDependencies_suggest_installation
source: Extension "%s" (%s) was not installed. You may want to install it.
ru: Расширение "%s" (%s) не было установлено. Возможно, вы хотите установить его.

# checkDependencies_suggestion_ignored
source: Suggestion of %s ignored as requested.
ru: Предложение %s, проигнорировано согласно просьбе.

# checkDependencies_try_again
source: Try again
ru: Попытаться снова

# checkDependencies_typo3_too_high
source: The running TYPO3 version (%s) is higher than allowed (%s).
ru: Версия TYPO3 (%s) выше позволенной (%s).

# checkDependencies_typo3_too_low
source: The running TYPO3 version (%s) is lower than required (%s).
ru: Версия TYPO3 (%s) ниже требуемой (%s).

# checkUploadFolder_clear_all_cache
source: Clear all cache:
ru: Очистить все кеши:

# checkUploadFolder_clear_cache
source: Clear cache
ru: Очистить кеш

# checkUploadFolder_clear_cache_requested
source: This extension requests the cache to be cleared when it is installed/removed.
ru: Расширение требует очистки кеша при установке/удалении.

# checkUploadFolder_create_dir
source: Create directory '%s':
ru: Создать папку "%s":

# checkUploadFolder_create_folder
source: Create folder
ru: Создать папку

# checkUploadFolder_create_upload_folder
source: Create upload folder
ru: Создать папку для загрузки

# checkUploadFolder_error
source: ERROR: The path '%s' could not be created.
ru: ОШИБКА: невозможно создать путь "%s".

# checkUploadFolder_folder_needed
source: The extension requires the folder '%s' to exist.
ru: Расширению требуется существующая папка "%s".

# checkUploadFolder_upload_folder_needed
source: The extension requires the upload folder '%s' to exist.
ru: Расширению требуется существование папки для загрузок "%s"

# clearMakeExtDir_could_not_create_dir
source: ERROR: Could not create extension directory "%s"!
ru: ОШИБКА: невозможно создать каталог для расширения "%s"!

# clearMakeExtDir_could_not_remove_dir
source: ERROR: Could not remove extension directory "%s". Reasons:
ru: ОШИБКА: невозможно удалить каталог расширения "%s". Причины:

# clearMakeExtDir_no_dir
source: ERROR: The extension install path "%s" was no directory!
ru: ОШИБКА: путь установки расширения "%s" не является каталогом!

# clearMakeExtDir_no_ext_key
source: FATAL ERROR: Extension key was not set for some VERY strange reason. Nothing done...
ru: ФАТАЛЬНАЯ ОШИБКА: ключ расширения не был установлен по ОЧЕНЬ странной причине. Ничего не сделано...

# connect_to_ter
source: Connect to the current mirror and retrieve the current list of available plugins from the TYPO3 Extension Repository.
ru: Подключение к текущему зеркалу и получение списка доступных расширений из TYPO3 Extension Repository.

# descr_global
source: Global extension (typo3/ext/) - Available for shared source on server (dynamic).
ru: Глобальные расширения (typo3/ext/) – доступны для разделения исходного кода на сервере (динамические).

# descr_local
source: Local extension (typo3conf/ext/) - Local for this TYPO3 installation only (dynamic).
ru: Локальные расширения (typo3conf/ext/) – доступны лишь для текущей установки TYPO3 (динамические).

# descr_system
source: System extension (typo3/sysext/) - Always distributed with the TYPO3 source code (static).
ru: Системные расширения (typo3/sysext/) – всегда распространяются с исходным кодом TYPO3 (статические).

# detailedExtAnalysis_be_module_conf_missing
source: Backend module conf file "%s" should exist, but does not!
ru: Должен существовать файл настройки модуля "%s", но он отсутствует!

# detailedExtAnalysis_class_not_ok
source: Class filename "%s" did NOT contain the class "%s"!
ru: Файл класса с названием "%s" НЕ содержит класс "%s"!

# detailedExtAnalysis_class_ok
source: Class filename "%s" contained the class "%s" just as it should.
ru: Файл класса с названием "%s" содержал класс "%s", как и должно быть.

# detailedExtAnalysis_constants
source: Constants
ru: Константы

# detailedExtAnalysis_keys
source: keys
ru: ключи

# detailedExtAnalysis_mconf_missing
source: No definition of MCONF[name] variable found inside!
ru: Внутри не найдено определение переменной MCONF[name]!

# detailedExtAnalysis_module
source: Module
ru: Модуль

# detailedExtAnalysis_module_and_more
source: Module+
ru: Модуль+

# detailedExtAnalysis_module_folder_missing
source: Backend module folder "%s" should exist, but does not!
ru: Должна существовать папка внутреннего модуля "%s", но она отсутствует!

# detailedExtAnalysis_no_upload_folder
source: Error: Upload folder "%s" did not exist!
ru: Ошибка: папка загрузки "%s" не существует!

# detailedExtAnalysis_no_xclass_filename
source: No XCLASS filename-key found in file "%s". Maybe a regex coding error here...
ru: Нет ключа имени файла XCLASS в файле "%s". Возможно имеются ошибки кодирования regex...

# detailedExtAnalysis_no_xclass_found
source: No XCLASS inclusion code found in file "%s".
ru: Нет включений кода XCLASS в файле "%s".

# detailedExtAnalysis_page_ts
source: Page-TSconfig
ru: TSconfig страниц

# detailedExtAnalysis_plugin
source: Plugin
ru: Дополнение

# detailedExtAnalysis_plugin_st43
source: Plugin/ST43
ru: Дополнение/ST43

# detailedExtAnalysis_setup
source: Setup
ru: Настройка

# detailedExtAnalysis_static_tables_missing
source: Static table(s) missing!
ru: Ошибка статических(ой) таблиц(ы)!

# detailedExtAnalysis_tables_are
source: Some tables or fields are %s!
ru: Некоторые таблицы и поля %s!

# detailedExtAnalysis_tables_are_missing
source: missing
ru: с ошибкой

# detailedExtAnalysis_tables_are_of_wrong_type
source: of wrong type
ru: неверного типа

# detailedExtAnalysis_ts_constants
source: TS/Constants
ru: TS/Константы

# detailedExtAnalysis_ts_setup
source: TS/Setup
ru: TS/Настройка

# detailedExtAnalysis_unconfigured_module
source: It seems like there is a backend module in "%s" which is not configured in ext_emconf.php.
ru: Похоже, что в "%s" имеется внутренний модуль, не настроенный через ext_emconf.php.

# detailedExtAnalysis_user_ts
source: User-TSconfig
ru: TSconfig пользователя

# detailedExtAnalysis_wrong_mod_path
source: Configured TYPO3_MOD_PATH "%s" is different from "%s", which it should be.
ru: Настроенный TYPO3_MOD_PATH "%s" отличается от того, что должно быть "%s".

# detailedExtAnalysis_xclass_incorrect
source: The XCLASS filename-key "%s" was different from "%s" which it should have been!
ru: Ключ имени файла XCLASS "%s" отличался от "%s", которым он должен был быть!

# detailedExtAnalysis_xclass_no_include
source: Couldn't find the include_once statement for XCLASS!
ru: Невозможно найти состояние include_once для XCLASS!

# detailedExtAnalysis_xclass_ok
source: 'XCLASS OK in %s.
ru: 'XCLASS OK в %s.

# details_backup_delete
source: Backup/Delete
ru: Резервировать/удалить

# details_dump_db
source: Dump DB
ru: Выгрузка БД

# details_edit
source: Edit files
ru: Правка файлов

# details_info
source: Information
ru: Информация

# details_update
source: UPDATE!
ru: ОБНОВИТЬ!

# details_upload
source: Upload to TER
ru: Загрузка в TER

# display_files
source: Display the list of changed files
ru: Показать список изменённых файлов

# display_nle
source: Include not loaded extensions into listing
ru: Показывать не загруженные расширения

# display_shy
source: Display shy extensions:
ru: Показать системные расширения:

# do_update
source: Update the extension in '%s' from online repository to server
ru: Обновить расширение в '%s' из сетевого хранилища на сервере

# dumpStaticTables_table_not_found
source: Fatal error: Table for dump not found in database...
ru: Фатальная ошибка: выгружаемая таблица не найдена в базе данных...

source: Enter repository password:
ru: Введите пароль в репозитории:

source: Enter repository URL:
ru: Введите URL репозитория:

source: Enter repository username:
ru: Введите имя пользователя в репозитории:

# excluded_from_updates
source: The extension is excluded from updates! You can change this in the appropriate ext_emconf.php file.
ru: Расширение исключено из обновлений! Можно изменить это в соответствующем файле ext_emconf.php.

# extBackup_data_tables
source: Data tables:
ru: Таблицы данных:

# extBackup_download
source: Download extension '%s' as a file.
ru: Закачать расширение '%s' в виде файла

# extBackup_download_all_data
source: Download all data from:
ru: Загрузить все данные из:

# extBackup_dump_all_tables
source: Dump all existing tables.
ru: Выгрузка всех существующих таблиц.

# extBackup_dump_table
source: Dump table '%s'
ru: Выгрузка таблицы '%s'

# extBackup_files
source: Extension files:
ru: Файлы расширения:

# extBackup_nothing_to_dump
source: Nothing to dump...
ru: Нечего выгружать...

# extBackup_number_of_records
source: %s records
ru: %s записей

# extBackup_select
source: Make selection:
ru: Выбор:

# extBackup_static_tables
source: Static tables:
ru: Статические таблицы:

# extBackup_table_not_there
source: Did not exist.
ru: Не существует.

# extBackup_unexpected_error
source: An unexpected error has occurred. There are problems with your extension key or with the extension data.
ru: Произошла неожиданная ошибка. Проблема с ключом или данными в расширении.

# extDelete_backup
source: (Maybe you should make a backup first, see above.)
ru: (Возможно сначала следует сделать резервную копию, см. выше.)

# extDelete_ext_active
source: This extension is currently installed (loaded and active) and so cannot be deleted!
ru: Это расширение на данный момент установлено (загружено и работает), поэтому не может быть удалено!

# extDelete_from_location
source: (in the '%s' location '%s'!)
ru: (в '%s' местоположение '%s'!)

# extDelete_from_server
source: DELETE EXTENSION FROM SERVER
ru: УДАЛЕНИЕ РАСШИРЕНИЯ С СЕРВЕРА

# extDelete_neither_global_nor_local
source: This extension is neither a global nor a local one and so cannot be removed.
ru: Это не глобальное и не локальное расширение, поэтому не может быть удалено.

# extDelete_removed
source: Removed extension in path '%s'!
ru: Путь удаляемого расширения '%s'!

# extDelete_removed_header
source: Extension deleted
ru: Расширение удалено

# extDelete_remove_dir_failed
source: ERROR: Could not remove extension directory '%s'. The following errors occurred:
ru: ОШИБКА: невозможно удалить директорию расширения '%s'. Произошла следующая ошибка:

# extDelete_sure
source: Are you sure you want to delete this extension from the server?
ru: Действительно удалить расширение с сервера?

# extDelete_wrong_scope
source: You cannot delete (and install/update) extensions in the %s scope.
ru: Невозможно удалить (а также установить/обновить) расширения в %s области.

# ext_details_always_loaded
source: This extension is entered in the TYPO3_CONF_VARS['EXT']['requiredExt'] list and is therefore always loaded.
ru: Это расширение входит в список TYPO3_CONF_VARS['SYS']['requiredExt'] и, поэтому, всегда загружается.

# ext_details_backup
source: Backup
ru: Архивация

# ext_details_cancel_button
source: Cancel
ru: Отмена

# ext_details_configuration
source: Configuration:
ru: Настройка:

# ext_details_current_status
source: Current status:
ru: Текущее состояние:

# ext_details_db_needs_update
source: Database needs to be updated
ru: Требуется обновление базы данных

# ext_details_delete
source: Delete
ru: Удалить

# ext_details_details
source: Details:
ru: Детали:

# ext_details_edit_file
source: Edit file:
ru: Править файл:

# ext_details_error_downloading
source: Error while trying to download the extension file...
ru: Ошибка при попытке загрузки файла расширения...

# ext_details_ext
source: Extension:
ru: Расширение:

# ext_details_ext_files
source: Extension files
ru: Файлы расширения

# ext_details_ext_installed_removed
source: The extension has been %s.
ru: Расширение было %s.

# ext_details_ext_installed_with_key
source: The extension "%s" has been installed.
ru: Расширение "%s" было установлено.

# ext_details_ext_removed_with_key
source: The extension "%s" has been removed.
ru: Расширение "%s" было удалено.

# ext_details_fatal_edit_error
source: Fatal Edit error: File '%s' was not inside the correct path of the TYPO3 Extension!
ru: Фатальная ошибка редактирования: файл '%s' не находиться по правильному пути для расширений TYPO3!

# ext_details_file
source: File: %s
ru: Файл: %s

# ext_details_file_save_button
source: Save file
ru: Сохранить файл

# ext_details_file_saved
source: File saved.
ru: Файл сохранен.

# ext_details_filesize_exceeded_kb
source: Filesize exceeded %s KBytes
ru: Размер файла превышает %s Кбайт

# ext_details_file_too_large
source: Files larger than %s KBytes are not allowed to be edited.
ru: Файлы более %s Кбайт не доступны для редактирования.

# ext_details_install_button
source: Click here to install the extension:
ru: Нажмите здесь для установки расширения:

# ext_details_installed
source: installed
ru: установлено

# ext_details_installing
source: Installing %s:
ru: Установка %s:

# ext_details_loaded_and_running
source: The extension is installed (loaded and running)!
ru: Расширение установлено (загружено и работает)!

# ext_details_md5_current
source: MD5: %s (Current File)
ru: MD5: %s (текущий файл)

# ext_details_md5_previous
source: MD5: %s (Previous File)
ru: MD5: %s (предыдущий файл)

# ext_details_md5_submitted
source: MD5: %s (Submitted File)
ru: MD5: %s (представленный файл)

# ext_details_new_tables_fields
source: Before the extension can be installed the database needs to be updated with new tables or fields.
ru: Перед установкой расширения, нужно добавить в базу данных таблицы или поля.

# ext_details_new_tables_fields_select
source: Please select which operations to perform:
ru: Выберете операцию:

# ext_details_no_changes
source: No changes to the file detected!
ru: Обнаружено изменений в файле!

# ext_details_notice_clear_cache
source: (<em>Notice: You may need to clear the cache after the configuration of the extension. This is required if the extension adds TypoScript depending on these settings.</em>)
ru: (<em>Примечание: может понадобиться очистить кеш после настройки расширения. Это требуется, если расширение добавляет какой-либо TypoScript в зависимости от настроек</em>).

# ext_details_notice_static_data
source: (Notice: "Static data" may not <em>need</em> to be updated. You will only have to import static data each time you upgrade the extension.)
ru: (Помните: "статические данные" может не <em>понадобиться</em> обновлять. Необходимо лишь импортировать статические данные каждый раз при обновлении расширения).

# ext_details_not_loaded
source: The extension is <strong>not</strong> installed yet.
ru: Расширение пока еще <strong>не</strong> установлено.

# ext_details_no_unique_ext
source: The extensions has an extension key prefixed "user_" which indicates that it is a user-defined extension with no official unique identification. Therefore it cannot be uploaded.
ru: К ключам расширений добавлена приставка "user_", что означает – это определяемые пользователем расширения, без официального уникального обозначения. Поэтому оно не может быть передано.

# ext_details_no_update_object
source: No update object
ru: Нет обновленных объектов

# ext_details_no_username
source: You have not configured a default username/password yet. %sGo to "Settings"%s if you want to do that.
ru: Вы еще не настроили имя пользователя/пароль по умолчанию. %sДля этого перейдите в "Настройки"%s

# ext_details_remove_button
source: Click here to remove the extension:
ru: Нажмите здесь для удаления расширения:

# ext_details_removed
source: removed
ru: удалено

# ext_details_remove_ext
source: Remove extension
ru: Удалить расширение

# ext_details_removing
source: Removing %s:
ru: Удаление %s:

# ext_details_saving_failed_changes_lost
source: Saving failed, the content was not correctly written to disk. Changes have been lost!
ru: Ошибка при сохранении, содержимое некорректно записано на диск. Изменения потеряны!

# ext_details_update
source: Update:
ru: Обновить:

# ext_details_update_em_conf
source: Update EM_CONF
ru: Обновление EM_CONF

# ext_details_update_needed
source: Update needed:
ru: Необходимо обновление:

# ext_details_upload_to_ter
source: Upload extension to repository
ru: Передача расширения в репозиторий

# ext_details_write_access_error
source: Write access error
ru: Ошибка доступа к записи

# ext_details_write_error_localconf
source: typo3conf/LocalConfiguration.php seems not to be writable, so the extension cannot be installed automatically!
ru: По видимому, typo3conf/localconf.php не доступен для записи, поэтому расширение не может быть установлено автоматически!

# extDumpTables_based_on
source: This dump is based on two factors:
ru: Выгрузка производиться на основе двух факторов:

# extDumpTables_based_on_one
source: 1) All tablenames in ext_tables.sql which are <em>not</em> found in the "modify_tables" list in ext_emconf.php are dumped with the current database structure.
ru: 1) Все названия таблиц, <em>не</em> найденные в списке "modify_tables" в ext_emconf.php, выгружаются с текущей структурой базы данных.

# extDumpTables_based_on_two
source: 2) For any tablenames which <em>are</em> listed in "modify_tables" all fields and keys found for the table in ext_tables.sql will be re-dumped with the fresh equivalents from the database.
ru: 2) Для любых имен таблиц, <em>перечисленных</em> в "modify_tables" все поля и ключи, найденные в ext_tables.sql перезагружаются со свежими эквивалентами из базы данных.

# extDumpTables_bottomline
source: Bottomline is: Whole tables are dumped from database with no regard to which fields and keys are defined in ext_tables.sql. But for tables which are only modified, any NEW fields added to the database must in some form or the other exist in the ext_tables.sql file as well.
ru: Строка снизу: таблицы целиком, выгруженные из базы данных, независимо от того, какие поля и ключи определены в ext_tables.sql. Но для изменяемых таблиц, любые НОВЫЕ поля, добавляемые в базу данных, должны присутствовать в той или иной форме в файле ext_tables.sql.

# extDumpTables_bytes_written_to
source: %sbytes written to %s
ru: %sбайт записано в %s

# extDumpTables_dumping_content
source: Dumping table content for static tables:
ru: Выгрузка содержимого таблицы для статических таблиц:

# extDumpTables_dumping_db_structure
source: Dumping current database structure for:
ru: Выгрузка структуры текущей базы данных для:

# extDumpTables_solo_fields
source: Solo-fields:
ru: Ед. полей:

# extDumpTables_static_tables
source: Static tables
ru: Статические таблицы

# extDumpTables_tables
source: Tables:
ru: Таблиц:

# extDumpTables_tables_fields
source: Table and field structure required
ru: Требуется структура таблиц и полей

# extDumpTables_write_dump
source: Write this dump to ext_tables.sql now!
ru: Запись выгруженного в ext_tables.sql!

# extDumpTables_write_static
source: Write current static table contents to ext_tables_static+adt.sql now!
ru: Запись содержимого текущей статической таблицы в ext_tables_static+adt.sql!

# extension_required_short
source: Rq
ru: Треб.

# extensions_repository_group_by
source: Extensions in TYPO3 Extension Repository (online) - Grouped by:
ru: Расширения в TYPO3 Extension Repository (сетевое) – группировка:

# extFileList_download
source: Download...
ru: Скачать...

# extFileList_edit
source: Edit:
ru: Правка:

# extFileList_edit_file
source: Edit file
ru: Править файл

# extFileList_file
source: File:
ru: Файл:

# extFileList_size
source: Size:
ru: Размер:

# extFileList_total
source: Total:
ru: Всего:
