Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_tools_em.xlf
Languages: ru

# ext_import_cache_files_removed
source: Cache-files are removed and will be re-written upon next hit.
ru: Файлы в кеше удалены и будут перезаписаны после следующего обращения.

# ext_import_close_check
source: Close window and recheck dependencies.
ru: Закройте окно и заново проверьте зависимости.

# ext_import_data_transfer
source: Error: The data transfer did not succeed. %s
ru: Ошибка: передача данных не удалась. %s

# ext_import_excluded_from_updates
source: This extension is excluded from updates! You can change this in the ext_emconf.php file in the extension folder.
ru: Это расширение исключено из обновлений! Можно исправить это в фале ext_emconf.php из папки расширений.

# ext_import_ext_already_installed_loaded
source: Extension already installed and loaded.
ru: Расширение уже установлено и загружено.

# ext_import_ext_imported
source: Extension has been imported from repository and loaded.
ru: Расширение импортировано из репозитория и загружено.

# ext_import_extlist_updated
source: The extensions list has been updated and now contains %s extension entries.
ru: Список расширений был обновлен и на данный момент содержит %s расширений.

# ext_import_extlist_updated_header
source: Extension list updated
ru: Список расширений обновлен

# ext_import_ext_loaded
source: Extension was already installed, it has been loaded.
ru: Расширение уже было установлено, а теперь загружено.

# ext_import_ext_n_a
source: Extension not available in matching version.
ru: Недоступна соответствующая версия расширения.

# ext_import_ext_n_a_rep
source: Extension not available in repository.
ru: Расширение недоступно в репозитории.

# ext_import_ext_not_loaded
source: Extension is in repository, but could not be loaded.
ru: Расширение имеется в репозитории, но не может быть загружено.

# ext_import_ext_only_here
source: Error: The extension can only be installed in the path %s (lockType=%s).
ru: Ошибка: расширение можно установить лишь по пути %s (lockType=%s).

# ext_import_ext_path_different
source: Error: The extension path '%s' was different than expected...
ru: Ошибка: путь к расширению '%s' отличается от ожидаемого...

# ext_import_ext_present_no_overwrite
source: A version of the extension was already present in '%s' and the overwrite flag was not set.
ru: Версия расширения уже имеется в '%s', а флаг перезаписи не был установлен.

# ext_import_ext_present_nothing_done
source: So nothing was done...
ru: И ничего не было сделано...

# ext_import_ext_type
source: Installation Type:
ru: Тип установки:

# ext_import_file_corrupted
source: Error: File '%s' MD5 was different from the md5 of the original file - so the file is corrupted!
ru: Ошибка: MD5 для файла '%s' отличается от MD5 оригинального файла – файл поврежден!

# ext_import_file_empty
source: File is empty!
ru: Пустой файл!

# ext_import_file_not_created
source: Error: File '%s' could not be created!!!
ru: Ошибка: невозможно создать файл '%s'!!!

# ext_import_file_not_uploaded
source: File was not uploaded?!
ru: Возможно, файл не был загружен!

# ext_import_folder_empty
source: (empty)
ru: (пусто)

# ext_import_global
source: Global:
ru: Глобальные:

# ext_import_imported
source: The extension has been imported.
ru: Расширение импортировано.

# ext_import_install
source: Install extension
ru: Установить расширение

# ext_import_install_uninstall
source: Install/Uninstall Extension:
ru: Установить/удалить расширение:

# ext_import_list_empty
source: The mirror list was not updated as it contained no entries.
ru: Список зеркал не был обновлен и в нем нет записей.

# ext_import_list_not_updated
source: Error: The list could not be fetched from %s.
ru: Ошибка: невозможно получить список из %s.

# ext_import_list_unchanged
source: The extension list has not changed remotely, it has thus not been fetched.
ru: Отдаленный список расширений не изменился, поэтому не был обновлен.

# ext_import_list_unchanged_header
source: No updates available
ru: Обновлений нет

# ext_import_list_updated
source: The mirror list has been updated and now contains %s entries.
ru: Список зеркал был обновлен и на данный момент содержит %s записей.

# ext_import_local
source: Local:
ru: Локальные:

# ext_import_md5_not_updated
source: Error: The extension MD5 sum could not be fetched from %s.
ru: Ошибка: сумма MD5 для расширения не может быть получена из %s.

# ext_import_no_conf_file
source: Error: Could not find '%s'.
ru: Ошибка: невозможно найти '%s'.

# ext_import_no_ext_key_files
source: Error: No extension key!!! Why? - nobody knows... (Or there are no files in the file array...)
ru: Ошибка: нет ключа расширения!!! Почему? – Никто не знает... (возможно нет файлов в массиве...)

# ext_import_no_file
source: No file uploaded! Probably the file was too large for PHPs internal limit for uploadable files.
ru: Файл не загружен! Возможно, файл слишком велик для внутренних ограничений PHP для загружаемых файлов.

# ext_import_no_install_here
source: Error: Installation is not allowed in this path (%s).
ru: Ошибка: установка по данному (%s) пути не разрешена.

# ext_import_no_key
source: No extension key in file. Strange...
ru: Нет ключа расширения в файле. Странно...

# ext_import_overwrite
source: (OVERWRITE)
ru: (ПЕРЕПИСАТЬ)

# ext_import_p_localconf
source: localconf.php is not writable!
ru: localconf.php защищен для записи!

# ext_import_remote_ext_details
source: Remote Extension Details
ru: Детали об отдаленном расширении

# ext_import_results
source: Extension import results
ru: Результаты импорта расширения

# ext_import_select_command
source: Select command
ru: Выбор команды

# ext_import_success
source: Extension imported
ru: Расширение импортировано

# ext_import_success_folder
source: Folder created: %s
ru: Создается папка: %s

# ext_import_system
source: System:
ru: Системные:

# ext_import_uninstall
source: Uninstall extension
ru: Удалить расширение

# ext_import_update_button
source: Import/Update
ru: импорт/обновление

# ext_import_update_to
source: to:
ru: в:

# ext_import_wrong_file_format
source: Wrong file format. No data recognized, %s.
ru: Неверный формат файла. Данные не распознаны, %s.

# extInfoArray_additional_fields
source: Additional fields:
ru: Дополнительные поля:

# extInfoArray_annoyances
source: Naming annoyances:
ru: Демонстрация досады:

# extInfoArray_author
source: Author:
ru: Автор:

# extInfoArray_category
source: Category:
ru: Категория:

# extInfoArray_class_names
source: Class names:
ru: Названия классов:

# extInfoArray_clear_cache
source: Clear cache:
ru: Очистка кеша:

# extInfoArray_code_warnings
source: Code warnings:
ru: Предупреждения в коде:

# extInfoArray_config_template
source: Config template:
ru: Шаблон настроек:

# extInfoArray_conflicts_with
source: Conflicts with:
ru: Конфликты с:

# extInfoArray_create_directories
source: Create directories:
ru: Создаваемые директории:

# extInfoArray_db_requirements
source: Database requirements:
ru: Требования к базе данных:

# extInfoArray_db_status
source: Database status:
ru: Состояние базы данных:

# extInfoArray_db_update_needed
source: The database will need to be updated when this extension is installed.
ru: Требуется обновить базу данных при установке расширения.

# extInfoArray_depends_on
source: Depends on:
ru: Зависимость:

# extInfoArray_description
source: Description:
ru: Описание:

# extInfoArray_dev_relevant
source: (developer-relevant)
ru: (для разработчика)

# extInfoArray_difference_detected
source: A difference between the originally installed version and the current one was detected!
ru: Была обнаружена разница между оригинальной версией установки и текущей!

# extInfoArray_double_installation_infotext
source: A %s extension with this key is also available on the server, but cannot be loaded, because the "%s" version takes precedence.
ru: Расширение %s с таким ключом также доступно на сервере, но не может быть загружено, так как версия "%s" имеет приоритет.

# extInfoArray_exception
source: [exception]
ru: [исключение]

# extInfoArray_files_changed
source: Files changed:
ru: Файлы изменялись:

# extInfoArray_flags
source: Flags:
ru: Флаги:

# extInfoArray_general_info
source: General information:
ru: Основная информация:

# extInfoArray_incl_modules
source: Includes modules:
ru: Включает модули:

# extInfoArray_inst_status
source: Installation status:
ru: Состояние установки:

# extInfoArray_inst_twice
source: Double installation:
ru: Дублирование установки:

# extInfoArray_inst_type
source: Type of installation:
ru: Тип установки:

# extInfoArray_internal
source: Internal:
ru: Внутреннее:

# extInfoArray_language_files
source: Language files:
ru: Языковые файлы:

# extInfoArray_load_in_frontend
source: Load in frontend:
ru: Загрузка во внешний интерфейс:

# extInfoArray_lock_type
source: Lock installation Type:
ru: Блокировка типа установки:

# extInfoArray_missing_fields
source: Probably one or more required fields/tables are missing in the database!
ru: Возможно, одна или несколько требуемых полей/таблиц имеют ошибки в базе данных!

# extInfoArray_modified_files
source: Modified files:
ru: Измененные файлы:

# extInfoArray_modifies_tables
source: Modifies tables:
ru: Изменяет таблицы:

# extInfoArray_module_names
source: Module names:
ru: Названия модулей:

# extInfoArray_priority
source: Priority:
ru: Приоритет:

# extInfoArray_root_files
source: Root files:
ru: Корневые файлы:

# extInfoArray_state
source: State:
ru: Состояние:

# extInfoArray_static_table_error
source: Static table error!
ru: Ошибка в статической таблице!

# extInfoArray_static_tables_missing_empty
source: The static tables are missing or empty!
ru: Статические таблицы пустые или содержат ошибку!

# extInfoArray_suggests
source: Suggests:
ru: Предлагает:

# extInfoArray_table_error
source: Table error!
ru: Ошибка таблицы!

# extInfoArray_tables_ok
source: All required tables are already in the database!
ru: Все требуемые таблицы уже находятся в базе данных!

# extInfoArray_title
source: Title:
ru: Заголовок:

# extInfoArray_typoscript_files
source: TypoScript files:
ru: Файлы TypoScript:

# extInfoArray_upload_folder
source: Upload folder:
ru: Папка для загрузки:

# extInfoArray_version
source: Version:
ru: Версия:

# ext_list_last_updated
source: (last update: %s)
ru: (последнее обновление: %s)

# ext_load_details_button
source: Load details
ru: Загрузить детали

# ext_or
source: or
ru: или

# extUpdateEMCONF_file
source: Update extension EM_CONF file
ru: Обновить файл расширения EM_CONF

# extUpdateEMCONF_info_changes
source: If files are changed, added or removed to an extension this is normally detected and displayed so you know that this extension has been altered locally and may need to be uploaded or at least not overwritten.
ru: При изменении, добавлении или удалении файлов в расширении, это обычно обнаруживается и отображается, чтобы знать, что расширение изменено локально, и должно быть передано или перезаписано.

# extUpdateEMCONF_info_reset
source: Updating this file will reset this check.
ru: Обновление этого файла сбросит текущую проверку.

# extUpdateEMCONF_sure
source: Are you sure you want to update EM_CONF?
ru: Вы настаиваете на обновлении EM_CONF?

source: global
ru: глобальное

# globalext
source: Globally installed extension
ru: Глобально установленные расширения

# global_folder
source: Global (typo3/ext/)
ru: глобальное (typo3/ext/) местоположение

source: Go back
ru: Назад

source: Group by:
ru: Группировка:

# header
source: Extension Manager
ru: Управление расширениями

# header_upd_ext
source: There are new versions of the following extensions in the TER
ru: В репозитории есть новые версии для следующих расширений

# header_vers_ret
source: Version information
ru: Версия

# helperFunction_import_not_possible
source: Import to both local and global path is disabled in TYPO3_CONF_VARS!
ru: Импорт в локальное и глобальное местоположение запрещен в TYPO3_CONF_VARS!

# helperFunction_install_extension
source: Install extension...
ru: Установка расширения..

# how_to_install
source: If you want to use an extension in TYPO3, you should simply click the "plus" button %s .
ru: Если нужно использовать расширение в TYPO3? просто нажмите на кнопку "плюс" %s

# how_to_uninstall
source: Installed extensions can also be removed again - just click the remove button %s .
ru: Установленные расширения могут быть снова удалены – просто нажмите на кнопку удаления %s.

# import_to_local_dir
source: Import this extension from online repository to the 'local' directory typo3conf/ext/.
ru: Импорт расширения из сетевого хранилища в "локальную" директорию typo3conf/ext/.

# in_repository
source: Extensions in TYPO3 Extension Repository
ru: Расширения в TYPO3 Extension Repository

source: Languages to fetch:
ru: Выбор языков:

# list_of_local_extensions
source: This is the list of extensions which are available locally, but not in the repository.
ru: Это – список доступных локально расширений, не находящихся в хранилище.

# list_order_author
source: Author
ru: Автор

# list_order_category
source: Category
ru: Категория

# list_order_state
source: State
ru: Состояние

# list_order_type
source: Type
ru: Тип

# list_or_look_up
source: List or look up %s extensions
ru: Список или просмотр расширения %s

# list_or_look_up_all
source: all
ru: все

# list_or_look_up_extensions
source: Look up extensions:
ru: Поиск расширений:

# list_or_look_up_reviewed
source: reviewed
ru: обзор

# listRow_files
source: Files:
ru: Файлы:

# listRowHeader_affects
source: Affects:
ru: Воздействие:

# listRowHeader_changed_files
source: Changed files:
ru: Измененные файлы:

# listRowHeader_classes
source: Classes:
ru: Классы:

# listRowHeader_clear_cache_short
source: Cl. Cache?
ru: Оч. кеш?

# listRowHeader_config
source: Config:
ru: Конфиг.:

# listRowHeader_current_type
source: Cur. Type:
ru: Тек. тип:

# listRowHeader_current_version
source: Cur. Ver:
ru: Тек. верс.:

# listRowHeader_documentation_short
source: Doc:
ru: Док.:

# listRowHeader_download_short
source: DL:
ru: Зак.:

# listRowHeader_ext_key
source: Extension key:
ru: Ключ расширения:

# listRowHeader_locallang
source: locallang:
ru: Локализация:

# listRowHeader_modifies_tables_short
source: Mod. Tables:
ru: Изм. таблицы:

# listRowHeader_modules
source: Modules:
ru: Модули:

# listRowHeader_tables_fields
source: Tables/Fields:
ru: Таблицы/поля:

# listRowHeader_title_current_type
source: Current type of installation of the extension on this server.
ru: Текущий тип установки расширения на этом сервере.

# listRowHeader_title_current_version
source: Current version of the extension on this server. If printed bold, there is a newer version in the repository! Then you should upgrade.
ru: Текущая версия расширения на этом сервере. Если выведена жирным, в репозитории имеется более новая версия! Возможно, требуется обновление.

# listRowHeader_title_number_of_downloads
source: Number of downloads: all versions/this version
ru: Количество загрузок: всех версий/данной версии

# listRowHeader_title_upload_date
source: Date of upload of the repository version.
ru: Дата загрузки версии в репозитории.

# listRowHeader_ts_files
source: TS files:
ru: TS файлы:

# listRowHeader_type
source: Type:
ru: Тип:

# listRowHeader_upload_date
source: Upload date:
ru: Дата загрузки:

# listRow_local_manual
source: Local Open Office Manual
ru: Локальное руководство Open Office

# loaded_exts
source: Loaded Extensions
ru: Загруженные расширения:

source: local
ru: локальное

# localext
source: Locally installed extension
ru: Локально установленные расширения

# local_folder
source: Local (../typo3conf/ext/)
ru: локальное (../typo3conf/ext/) местоположение

source: Look up:
ru: Поиск:

# look_up_button
source: Look up
ru: Просмотр

# makeUploadArray_error_path
source: Error: Extension path for extension "%s" not found!
ru: Ошибка: путь расширения "%s" не найден!

# makeUploadArray_error_size
source: Error: The total size of the uncompressed upload (%s) exceeds %s!
ru: Ошибка: общий размер незаархивированной загрузки (%s) превышает %s!

# menu_extension_updates
source: Check for extension updates
ru: Проверка обновлений для расширений

# menu_import_extensions
source: Import extensions
ru: Импорт расширений

# menu_install_extensions
source: Install extensions
ru: Установка расширений

# menu_loaded_extensions
source: Loaded extensions
ru: Загруженные расширения

# menu_settings
source: Settings
ru: Настройки

# menu_translation_handling
source: Translation handling
ru: Перевод

# might_be_user_defined
source: They might be user-defined and should be prepended user_ then.
ru: Они могут быть определены для пользователя, при этом используется приставка user_

# mirror_country
source: Country
ru: Страна

source: Mirror list
ru: Список зеркал

# mirror_list_reload
source: Click here to reload the list.
ru: Нажмите для обновления списка.

# mirror_list_url
source: Enter mirror list URL:
ru: Введите список зеркал URL:

# mirror_name
source: Name
ru: Название

# mirror_select
source: Select a mirror from below. This list is built from the online mirror list retrieved from the URL above.
ru: Выберете зеркало ниже. Этот список получен из сетевого списка зеркал из введенного выше URL/

source: Mirror selection
ru: Выбор зеркала

# mirror_sponsored_by
source: Sponsored by
ru: Спонсируется

# mirror_use
source: Use
ru: Использовать

# mirror_use_random
source: Random (recommended!)
ru: Случайно (рекомендуется!)

# mlang_labels_tabdescr
source: Manages TYPO3 extensions from a central repository, which includes plugins, modules, class extensions, configuration code etc.<br /><em>Access for 'admin' users only!</em>
ru: Управление расширениями, модулями, классами расширения, настройками и другими расширениями из центрального архива TYPO3.<br /><em>Доступ только для 'admin' пользователей!</em>

# mlang_labels_tablabel
source: TYPO3 Extension Manager
ru: Управление расширениями TYPO3

# mlang_tabs_tab
source: Ext Manager
ru: Расширения

# msg_modified
source: Modified Files:
ru: Изменённые файлы:

# msg_warn_diff
source: A difference between the originally installed version and the current was detected!
ru: Найдено различие между оригинальным файлом и файлом на сервере!

source: Next page
ru: След. стр.

# no_matching_extensions
source: No matching extensions found.
ru: Соответствующие расширения не найдены.

# note_last_update
source: Last update of the list of extensions:
ru: Список расширений последний раз обновлялся:

# note_last_update2
source: To get and update the list, go to the section "Import extensions" and use the button "Retrieve/Update".
ru: Для получения и обновления списка, перейдите в раздел "Импорт расширений", и нажмите кнопку "Загрузить/обновить".

# note_last_update2_new
source: To get and update the list, %sgo to the section "Import extensions" and use the button "Retrieve/Update"%s.
ru: Для получения и обновления списка, %sперейдите в раздел "Импорт расширений", и нажмите кнопку "Загрузить/обновить"%s.

# note_last_update_new
source: Last update of the list of extensions: %s.
ru: Список расширений последний раз обновлялся: %s.

source: Notice:
ru: Примечания:

# only_my_ext
source: Only my extensions:
ru: Только свои расширения:

# only_on_this_server
source: Extensions found only on this server
ru: Расширения, найденные только на этом сервере

# overwrite_ext
source: Overwrite any existing extension!
ru: Перезаписать все существующие расширения!

# previous_page
source: Prev page
ru: Пред. стр.

# privacy_notice
source: When you interact with the online repository, server information may be sent and stored in the repository for statistics.
ru: При взаимодействии с сетевым хранилищем, серверная информация может отсылаться и храниться в репозитории для статистики.

# privacy_notice_header
source: PRIVACY NOTICE:
ru: КОНФИДЕНЦИАЛЬНОСТЬ:

# removeExtFromList_dependency
source: The extension(s) '%s' depend(s) on the extension you are trying to remove. The operation was not completed.
ru: Расширение(я) "%s" зависит(ят) от расширения, которое вы пытаетесь удалить. Операция не завершена.

# removeExtFromList_dependency_error
source: Dependency Error
ru: Ошибка зависимости.

# repository_password_info
source: This is <em>not</em> your password to the TYPO3 backend! This user information is what is needed to log in at typo3.org with your account there!
ru: Это <em>не</em> пароль ко внутреннему интерфейсу TYPO3! Это – информация об учетной записи на typo3.org!

source: Repository settings
ru: Настройки репозитория

# repositoryUploadForm_changelog
source: Changelog for upload:
ru: Журнал изменений для загрузки:

# repositoryUploadForm_command
source: Upload command:
ru: Команда для загрузки:

# repositoryUploadForm_new_bugfix
source: New bugfix version (latest %s)
ru: Новая версия с исправлениями (последняя %s)

# repositoryUploadForm_new_main_version
source: New main version (latest %s)
ru: Новая основная версия (последняя %s)

# repositoryUploadForm_new_sub_version
source: New sub version (latest %s)
ru: Новая под-версия (последняя %s)

# repositoryUploadForm_password
source: Repository Password:
ru: Пароль для репозитория:

# repositoryUploadForm_upload
source: Upload extension
ru: Загрузка расширения

# repositoryUploadForm_username
source: Repository Username:
ru: Имя пользователя репозитория:

# repository_url_hint
source: If you set a repository URL, this overrides the use of a mirror. Use this to select a specific (private) repository.
ru: При установке URL репозитория будут переопределены используемые зеркала. Используется для выбора специфичного (приватного) репозитория.

# reqInstExt_ext_key
source: Extension Key:
ru: Ключ расширения:

# reqInstExt_imp_inst_ext
source: Import/Install Extensions:
ru: Импорт/установка расширений:

# reqInstExt_import_install_selected
source: Import and Install selected
ru: Импорт и установка выбранного

# reqInstExt_install_import
source: Install/Import:
ru: Установить/импорт:

# reqInstExt_return
source: Return
ru: Назад

source: Retrieve/Update
ru: Получить/обновить

# rmExtDir_could_not_be_deleted
source: Error: "%s" could not be deleted!
ru: Ошибка: "%s" не может быть удален!

# rmExtDir_error
source: Error:
ru: Ошибка:

# rmExtDir_error_file
source: Error: "%s" was either not a file, or it was equal to the removed directory or simply outside the removed directory "%s"!
ru: Ошибка: либо "%s" не является файлом, или находился в удаленном каталоге, или просто вне удаленного каталога "%s"!

# rmExtDir_error_files_left
source: Error: "%s" could not be removed (are there files left?)
ru: Ошибка: "%s" не может быть удален (возможно там остались файлы).

# rmExtDir_error_folders_left
source: Error: Extension directory "%s" could not be removed (are there files or folders left?)
ru: Ошибка: невозможно удалить каталог расширения "%s" (возможно в нем еще остались файлы или папки).

# rmExtDir_error_no_dir
source: Error: "%s" was no directory!
ru: Ошибка: "%s" не был каталогом!

# rmExtDir_error_unallowed_path
source: Error: Unallowed path to remove:
ru: Ошибка: удаление по запрещенному пути:

# security_descr
source: If you think you have found a security issue in TYPO3 or an extension, please contact the %sTYPO3 security team%s! Thank you!
ru: Если Вам показалось, что найдена брешь в безопасности TYPO3 или в расширении, свяжитесь с %sгруппой безопасности TYPO3%s! Спасибо за понимание!

# security_header
source: Did you find a security problem?
ru: Нашли проблему в безопасности?

# security_notice
source: Make sure you know what consequences enabling this checkbox might have. Check the %sinformation on typo3.org about security reviews%s!
ru: Удостоверьтесь, что знакомы с последствиями, которые могут последовать при данной настройке. Обратитесь к %sзамечаниям на typo3.org по настройке безопасности%s

source: Security Settings
ru: Настройки безопасности
