Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_help_about.xlf
Languages: ru

# cms_description
source: TYPO3 CMS is an enterprise-class, Open Source Content Management System, used internationally to build and manage websites of all types, from small sites for non-profits to multilingual enterprise solutions for large corporations.<br /><br />For further information visit <a href="https://typo3.org/typo3-cms/" target="_blank">typo3.org</a>.<br /><br />TYPO3 CMS is <b>freely available</b> under the <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />You are using version %s - Copyright %s %s
ru: TYPO3 CMS представляет собой Систему Управления Контентом с открытым исходным кодом корпоративного класса, она используется во всем мире для создания и управления веб-сайтами всех типов, от небольших сайтов для некоммерческих организаций до многоязычных корпоративных решений для крупных корпораций.<br /><br />Для получения дополнительной информации посетите сайт <a href="https://typo3.org/typo3-cms/" target="_blank">typo3.org</a>.<br /><br />TYPO3 CMS находится в <b>свободном доступе</b> под <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />Вы используете версию %s - Авторские права %s %s

source: Community Credits
ru: Список разработчиков

# coredevs
source: Core Team
ru: Рабочая группа

# coredevs_detail
source: Visit <a href="https://typo3.org/teams-committees/core-development/" target="_blank">typo3.org/teams-committees/core-development/</a> for the complete member list.<br /><br />The Git Repository and the ChangeLog can be found <a href="http://forge.typo3.org/projects/show/typo3v4-core/" target="_blank">here</a>.
ru: Посетите <a href="https://typo3.org/teams-committees/core-development/" target="_blank">typo3.org/teams-committees/core-development/</a> чтобы увидеть полный список членов группы.<br /><br />Репозиторий Git и список изменений можно найти <a href="http://forge.typo3.org/projects/show/typo3v4-core/" target="_blank">здесь</a>.

# donation_button
source: Donate now
ru: Пожертвовать

# donation_header
source: TYPO3 Donation
ru: Пожертвование TYPO3

# donation_message
source: It would be great if you could donate. TYPO3 CMS is Open Source and relies heavily on donations from its users and supporters.<br/><br/><b>Thank you</b> for making this great Content Management System even better with your support!
ru: Замечательно, если Вы сделайте пожертвование. TYPO3 является программным обеспечением с открытым исходным кодом, сильно зависимым от пожертвований от пользователей и сторонников.<br/><br/><b>Благодарим</b> за участие в жизни этой замечательной Системы Управления Содержимым, которая при этом становиться все лучше и лучше!

source: Extension
ru: Расширение

# extension_author
source: Author
ru: Автор

source: Extension Authors
ru: Авторы расширений

# extension_list_info
source: This is a list of the people who contributed to the extensions you're using in your installation.
ru: Список людей, которые внесли свой вклад в используемые вами расширения.

source: External Libraries
ru: Внешние библиотеки

# external_thanks
source: TYPO3 CMS core uses and thanks these external Open Source projects:
ru: Ядро TYPO3 использует и благодарит следующие внешние проекты с открытым исходным кодом:

# information
source: TYPO3 Information
ru: Информация о TYPO3

# information_detail
source: Visit <a href="https://typo3.org/community/" target="_blank">typo3.org/community/</a> if you want to know why TYPO3 rocks.
ru: Посетите <a href="https://typo3.org/community/" target="_blank">typo3.org/community/</a> если хотите знать почему TYPO3 рулит.

# minor
source: TYPO3 CMS is an enterprise-class, Open Source Content Management System, used internationally to build and manage websites of all types, from small sites for non-profits to multilingual enterprise solutions for large corporations.<br /><br />For further information visit <a href="https://typo3.org/typo3-cms/" target="_blank">typo3.org</a>.<br /><br />TYPO3 CMS is <b>freely available</b> under the <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />You are using %s %s
ru: TYPO3 CMS представляет собой Систему Управления Контентом с открытым исходным кодом корпоративного класса, она используется во всем мире для создания и управления веб-сайтами всех типов, от небольших сайтов для некоммерческих организаций до многоязычных корпоративных решений для крупных корпораций.<br /><br />Для получения дополнительной информации посетите сайт <a href="https://typo3.org/typo3-cms/" target="_blank">typo3.org</a>.<br /><br />TYPO3 CMS находится в <b>свободном доступе</b> под <a href="https://typo3.org/typo3-cms/overview/licenses/" target="_blank">TYPO3-license (GNU/GPL)</a>.<br /><br />Вы используете %s %s

# mlang_labels_tabdescr
source: Displays the basic facts about the TYPO3 application, version and licensing terms.
ru: Содержит основные сведения о системе Тypo3, ее версию и условия лицензирования

# mlang_labels_tablabel
source: About TYPO3 CMS
ru: Информация о TYPO3

# mlang_tabs_tab
source: About TYPO3 CMS
ru: О TYPO3

# title
source: About TYPO3 CMS
ru: Информация о TYPO3

# typo3_logo
source: TYPO3 CMS logo
ru: Логотип TYPO3

# welcome
source: TYPO3 CMS - Professional Web Content Management System
ru: Профессиональная система управления веб-содержимым TYPO3
