Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_user_ws.xlf
Languages: it, ru

# create_workspace_no_permission
source: You have no permission to create workspaces. Only admin users can create workspaces.
it: Non ti è permesse creare nuovi workspaces. Solo gli admin possono crearne.
ru: У вас нет допуска к созданию рабочей области. Только администраторы могут создавать рабочие области.

# diff_no_diff
source: Do not show differences
it: Non mostrare le differenze
ru: Не показывать отличия

# diff_show_inline
source: Show differences inline
it: Vedi differenze inline
ru: Отобразить отличия в тексте

# diff_show_popup
source: Show diff. popups (branches)
it: Vedi differenze in popup (rami)
ru: Отобразить отличия в новом окне

# diffview_cannot_find_records
source: ERROR: Records could strangely not be found!
it: ERRORE: i records stranamente sembrano non essere individuati!
ru: ОШИБКА: записи странным образом не могут быть найдены!

# diffview_complete_match
source: Complete match on editable fields.
it: Controllo terminato sui campi editabili.
ru: Полное соответствие редактируемых полей.

# diffview_label_colored_diff_view
source: Colored diff-view:
it: Visualizzazione differenziata per colore:
ru: Показать различия цветом:

# diffview_label_field_name
source: Fieldname:
it: Nome del campo:
ru: Название поля:

# do_not_interrupt_publishing_1
source: Do not interrupt publishing process or
it: Non interrompere il processo o
ru: Не прерывайте процесс публикации! Иначе

# do_not_interrupt_publishing_2
source: workspace may be left in half-published state!
it: il workspace potrebbe risultare pubblicato parzialmente.
ru: рабочая область может остаться в недоопубликованном состоянии!

# edit_workspace_go_back
source: Go back
it: Indietro
ru: Вернуться

# edit_workspace_no_permission
source: You have no permission to edit this workspace. Only admin users or owners of the workspace can modify its parameters.
it: Non hai il permesso di editare quest'area di lavoro. Solo gli utenti amministratori o i proprietari dell'area di lavoro possono modificare questi parametri.
ru: У вас нет допуска к редактировании этой рабочей области. Только администраторы и владельцы рабочей области могут изменить ее параметры.

# edit_workspace_title_edit
source: Edit workspace
it: Edita il workspace
ru: Редактировать рабочую область

# edit_workspace_title_new
source: Create new workspace
it: Crea un nuovo workspace
ru: Создать новую рабочую область

# explain_reject
source: Please explain why you reject:
it: Spiega perchè lo rifiuti:
ru: Причина отклонения:

# filter_all
source: All
it: Tutti
ru: Все

# filter_archive
source: Archive
it: Archivio
ru: Архив

# filter_drafts
source: Drafts
it: Bozze
ru: Черновики

# img_title_create_new_workspace
source: Create new workspace
it: Crea un nuovo workspace
ru: Создать новую рабочую область

# img_title_current_workspace
source: This is a current workspace!
it: Questo è l'attuale workspace!
ru: Это текущая рабочая область!

# img_title_edit_element
source: Edit element
it: Edita elemento
ru: Редактировать элемент

# img_title_edit_page
source: Edit page
it: Edita pagina
ru: Редактировать страницу

# img_title_publish
source: Publish
it: Pubblica:
ru: Публиковать

# img_title_remove_from_ws
source: Remove from workspace?
it: Rimuovi dal workspace?
ru: Удалить из рабочей области?

# img_title_show_log
source: Show Log
it: Mostra Log
ru: Показать журнал

# img_title_show_more
source: Show more
it: Mostra di più
ru: Показать больше

# img_title_swap
source: Swap
it: Scambia
ru: Поменять

# label_access_level
source: Access level:
it: Livello di accesso:
ru: Уровень доступа:

# label_allWSes
source: All workspaces
it: Tutti i workspaces
ru: Все рабочие области

# label_approveforpublishing
source: Approve for publishing
it: Approva la pubblicazione
ru: Одобрить для публикации

# label_branch
source: Branch
it: Ramo
ru: Ветвь дерева страниц

# label_commentforpublisher
source: Comment for Publisher:
it: Commento per il Pubblicatore:
ru: Комментарий издателю:

# label_commentforreviewer
source: Comment for Reviewer:
it: Commento per il Revisore:
ru: Комментарий рецензенту:

# label_deletedrecord
source: Deleted element
it: Elemento eliminato
ru: Удалённый элемент

# label_description
source: Description:
it: Descrizione:
ru: Описание:

# label_doaction_default
source: Do:
it: Azione:
ru: Сделать:

# label_doaction_flush
source: Flush ALL changes/versions
it: Elimina TUTTI i cambiamenti/versioni
ru: Сброс ВСЕХ изменений/версий

# label_doaction_publish
source: Publish
it: Pubblica
ru: Опубликовать

# label_doaction_release
source: Remove this version
it: Rimuovi questa versione
ru: Удалить эту версию

# label_doaction_stage_editing
source: Send to stage: Editing
it: Invia a fase: Modifica
ru: Переместить на стадию: Редактирование

# label_doaction_stage_publish
source: Send to stage: Publish
it: Invia a fase: Pubblicazione
ru: Переместить на стадию: Публикация

# label_doaction_stage_reject
source: Reject changes
it: Rifiuta i cambiamenti
ru: Отклонить изменения

# label_doaction_stage_review
source: Send to stage: Review
it: Invia a fase: Revisione
ru: Переместить на стадию: Рассмотрение

# label_doaction_swap
source: Swap
it: Scambia
ru: Обменять

# label_draft_versions
source: Workspace Versions:
it: Versioni in Workspace:
ru: Черновые версии:

# label_element
source: Element
it: Elemento
ru: Элемент

# label_errors
source: Errors:
it: Errori:
ru: Ошибки:

# label_lifecycle
source: Lifecycle:
it: Ciclo vitale:
ru: Жизненный цикл:

# label_live_version
source: Live Version:
it: Versione online:
ru: Чистовая версия:

# label_moveto_placeholder
source: Move-to placeholder (destination)
it: Sposta al segnaposto (destinazione)
ru: Отправить по месту (адресат)

# label_moveto_pointer
source: Move-to pointer (source)
it: Sposta al puntatore (sorgente)
ru: Отправить к указателю (источник)

# label_multipleversions
source: Multiple versions in same workspace!
it: Versioni multiple nello stesso workspace!
ru: Несколько версий в одной рабочей области!

# label_nestedversions
source: Version inside version!
it: Versione all'interno di sè stessa.
ru: Версия внутри версии!

# label_newrecord
source: New element
it: Nuovo elemento
ru: Новый элемент

# label_notapplicable
source: n/a
ru: не применимо

# label_offlineWSes
source: Draft workspaces
ru: Черновые рабочие области

# label_onlymychanges
source: Show only my changes
it: Mostra solo le mie modifiche
ru: Показать только мои изменения

# label_options
source: Options:
it: Opzioni:
ru: Свойства:

# label_otherversions
source: Other version(s) in workspace(s):
it: Altra versione(i) nel workspace:
ru: Другая(ие) версия(и) в рабочей(их) области(ях)

# label_page
source: Page
it: Pagina
ru: Страница

# label_pagetree
source: Pagetree:
ru: Дерево страниц:

# label_percentchange
source: %%% change:
it: %%% modifiche:
ru: %%% обмен:

# label_percentChange
source: %d%% change:
it: %d%% modifiche:
ru: %d%% обмен:

# label_publish
source: Publish:
it: Pubblica:
ru: Публиковать:

# label_reject
source: Reject
it: Rifiuta
ru: Отклонить

# label_rejected
source: Rejected
it: Rifiutato
ru: Отклонено

# label_resetstage
source: Reset stage
ru: Сбросить стадию

# label_review
source: Review
it: Revisione
ru: Рассмотреть

# label_sendtoreview
source: Send to review
it: Manda al revisore
ru: Отправить на рассмотрение

# label_showsubelements
source: Show sub elements
it: Mostra sotto elementi
ru: Показать под-элементы

# label_stage
source: Stage:
it: Fase:
ru: Стадия:

# label_status
source: Status:
ru: Статус:

# label_subelements
source: Sub elements
it: Sotto elementi
ru: Подэлементы

# label_subelementsdetails
source: Sub elements, click for details
it: Sotto elementi, clicca per dettagli
ru: Подэлементы, нажмите, чтобы узнать больше

# label_undefined
source: Undefined
it: Indefinito
ru: Не определено

# label_workspace
source: Workspace:
ru: Рабочая область:

# link_text_create_new_workspace
source: Create new workspace
it: Crea un nuovo workspace
ru: Создать новую рабочую область

# menuitem_review
source: Review and Publish
it: Rivedi e pubblica
ru: Рецензия и публикация

# menuitem_workspaces
source: Workspace List
it: Elenco Workspace
ru: Список рабочих областей

# mlang_labels_tabdescr
source: Workspace overview showing the changes you have made in the workspace. Here you can also publish the changes to the website if you are allowed to do that.
it: La panoramica workspace illustra i cambiamenti che tu hai fatto nel workspace. Da qui tu puoi applicare i cambiamenti al sito web se ne sei autorizzato.
ru: Обзор рабочих областей, отображающий изменения, сделанные в рабочей области. Здесь можно публиковать изменения на сайте, если имеются соответствующие права.

# mlang_labels_tablabel
source: Workspace overview
it: Panoramica Workspace
ru: Обзор рабочих областей

# mlang_tabs_tab
source: Workspace
ru: Рабочая область

# no_publish_permission
source: You are not permitted to publish from this workspace
it: Non ti è permesso pubblicare in questo workspace
ru: Вам не разрешено публиковать эту рабочую область

source: Please, wait...
it: Attendere, prego...
ru: Пожалуйста, подождите...

# publish_prepare
source: TYPO3 is preparing to publish records.
it: TYPO3 sta preparando la pubblicazione dei records.
ru: TYPO3 готовится к публикации записей

# publish_status
source: Published records <strong>%d</strong> to <strong>%d</strong> of <strong>%d</strong>.
it: Pubblicati i records da <strong>%d</strong> a <strong>%d</strong> di <strong>%d</strong>.
ru: Опубликованы записи <strong>%d</strong>-<strong>%d</strong> из <strong>%d</strong>.

# publish_title
source: Publish workspace
it: Pubblica workspace
ru: Опубликовать рабочую область

# remove_from_ws_confirmation
source: Remove from workspace?
it: Rimuovi dal workspace?
ru: Удалить из рабочей области?

# return_to_index
source: Return to Workspace module
it: Torna al modulo Workspace
ru: Вернуться в модуль рабочих областей

# stage_approved_for_publish
source: "%s" approved for "Publish"
it: "%s" approvati in fase "Pubblicazione"
ru: "%s" утвердил для "Публикации"

# stage_editing
source: Editing
it: Modifica
ru: Редактирование

# stage_label_user_comment
source: User Comment:
it: Commento dell'utente:
ru: Комментарий пользователя:

# stage_publish
source: Publish
it: Pubblica
ru: Публикация

# stage_rejected
source: "%s" rejected element!
it: "%s" elementi rifiutati!
ru: "%s" отклонил элемент!

# stage_reset_to_editing
source: "%s" reset to "Editing"
it: "%s" riconfigurati a fase "Modifica"
ru: "%s" вернул в "Публикацию"

# stage_review
source: Review
it: Revisione
ru: Рассмотрение

# stage_sent_to_review
source: "%s" sent element to "Review"
it: "%s" elementi inviati a fase "Revisione"
ru: "%s" послал элемент на "Рецензию"

# stage_undefined
source: [undefined]
it: [non definito]
ru: [не определено]

# submit_apply_action_on_selected_elements
source: Sure you want to perform this action with selected elements?
it: Sei sicuro di voler eseguire questa operazione con gli elementi selezionati?
ru: Подтверждаете выполнение этого действие с выбранными элементами?

# submit_publish_workspace
source: Publish workspace
it: Pubblica il workspace
ru: Опубликовать рабочую область

# submit_publish_workspace_confirmation_1
source: Are you sure you want to publish all content in "Publish" stage from the workspace?
it: Sei sicuro di voler pubblicare tutto il contenuto del workspace in "Pubblica"?
ru: Действительно опубликовать все содержимое в чистовую рабочую область?

# submit_publish_workspace_confirmation_2
source: Are you sure you want to publish all content from the workspace?
it: Sei sicuro di voler pubblicare tutto il contenuto del workspace?
ru: Действительно опубликовать все содержимое из этой рабочей области?

# submit_swap_workspace
source: Swap workspace
it: Scambia workspace
ru: Обменять рабочую область

# submit_swap_workspace_confirmation_1
source: Are you sure you want to publish (swap) all content in "Publish" stage from the workspace?
it: Sei sicuro di voler pubblicare (spostare) tutti i contenuti dall'area di lavoro alla fase "Pubblicazione"?
ru: Действительно опубликовать (поменять) все содержимое из рабочей области в стадию "публикации"?

# submit_swap_workspace_confirmation_2
source: Are you sure you want to publish (swap) all content from the workspace?
it: Sei sicuro di voler pubblicare (spostare) i contenuti dell'area di lavoro?
ru: Действительно опубликовать (поменять) все содержимое рабочей области?

# swap_prepare
source: TYPO3 is preparing to swap records.
it: TYPO3 sta preparando lo scambio dei records.
ru: TYPO3 готовится к обмену записей

# swap_status
source: Swapped records <strong>%d</strong> to <strong>%d</strong> of <strong>%d</strong>.
it: Scambiati i records da <strong>%d</strong> a <strong>%d</strong> di <strong>%d</strong>.
ru: Обменяны записи <strong>%d</strong>-<strong>%d</strong> из <strong>%d</strong>.

# swap_title
source: Swap workspace
it: Scambia workspace
ru: Обменять рабочую область

# title
source: Workspace Manager
ru: Управление рабочими областями

# workspace_description_draft
source: In the Draft workspace all changes will be made as new versions of the live content. Changes can be previewed, reviewed and eventually published live.
it: Nell'area di lavoro "Bozze" tutti le modifiche saranno fatte come nuova versione dei contenuti. I cambiamenti possono essere visti in anteprima, rivisti e poi pubblicati.
ru: В черновой рабочей области все изменения являются новыми версиями чистового содержимого.

# workspace_description_live
source: The LIVE workspace allows changes to take effect immediately on the website. However versioning can be applied inside the live workspace and this overview shows you draft and archive versions from the various workspaces, including the LIVE workspace.
it: il LIVE worspace rende immediatamente effettive le modifiche al sito. Si possono comunque usare le versioni anche in questo workspace, e questo overview ti mostra le versioni draft e quelle archiviate nei vari workspaces, compreso quello LIVE.
ru: Оперативная рабочая область позволяет публиковать изменения непосредственно на сайте. Тем не менее, версионный контроль может быть применен в чистовой рабочей области, тогда здесь будут показаны черновые и архивные версии различных рабочих областей, включая чистовую рабочую область.

# workspace_description_no_access
source: You have no access to any workspace which might be an error. Please contact you administrator!
it: Non hai accesso a nessun'area di lavoro, potrebbe esserci un errore. Contatta per favore il tuo amministratore!
ru: Вы не имеете доступа к любой из рабочих области, возможно это ошибка. Обратитесь к администратору!

# workspace_list_access_admin
source: Admin
ru: Администратор

# workspace_list_access_admins_only
source: Admins only
it: Solo amministratori
ru: Только администраторы

# workspace_list_access_anyone
source: no restrictions
it: senza restrinzioni
ru: без ограничений

# workspace_list_access_member
source: Member
it: Membro
ru: Член

# workspace_list_access_offline
source: Offline
ru: офлайн

# workspace_list_access_online
source: Online
ru: онлайн

# workspace_list_access_owner
source: Owner
it: Proprietario
ru: Владелец

# workspace_list_access_reviewer
source: Reviewer
it: Revisore
ru: Рецензент

# workspace_list_db_mount_point_custom
source: Mount points from user profile are used.
it: Vengono usati i mount point indicati al profilo utente.
ru: Использована стартовая точка из профиля пользователя.

# workspace_list_db_mount_point_draft
source: Mount points from user profile are used.
it: Vengono usati i mount point indicati al profilo utente.
ru: Использована стартовая точка из профиля пользователя.

# workspace_list_db_mount_point_live
source: Mount points from user profile are used.
it: Vengono usati i mount point indicati al profilo utente.
ru: Использована стартовая точка из профиля пользователя.

# workspace_list_file_mount_point_custom
source: File mount points are not defined for this workspace. Therefore no file mount points available in the workspace.
it: I mount points dei file non sono definiti in questo workspace. Perciò non ve ne sono di disponibili.
ru: Стартовая точка не определена для этой рабочей области.

# workspace_list_file_mount_point_draft
source: File mount points are not available in draft workspace.
it: I file mount point non sono disponibili nel workspace in formato bozza.
ru: Стартовая точка в структуре файлов не доступна в черновой рабочей области.

# workspace_list_file_mount_point_live
source: Mount points from user profile are used.
it: Vengono usati i mount point dal profilo-utente.
ru: Использована стартовая точка из профиля пользователя.

# workspace_list_icon_title_edit_workspace
source: Edit workspace
it: Edita il Workspace
ru: Редактировать рабочую область

# workspace_list_icon_title_switch_workspace
source: Switch workspace
it: Scambia workspace
ru: Поменять рабочую область

# workspace_list_label_current_workspace
source: Current:
it: Attuale:
ru: Текущая:

# workspace_list_label_db_mountpoints
source: Database mountpoints:
it: Mountpoints di DB:
ru: Стартовая точка в дереве страниц:

# workspace_list_label_file_mountpoints
source: File mountpoints:
it: Mountpoints di file:
ru: Стартовая точка в структуре файлов:

# workspace_list_label_frozen
source: Frozen:
it: Congelato:
ru: Заморожено:

# workspace_list_label_frozen_no
source: No
ru: Нет

# workspace_list_label_frozen_yes
source: Yes
it: Si
ru: Да

# workspace_list_label_members
source: Members:
it: Membri:
ru: Члены:

# workspace_list_label_owners
source: Owners:
it: Proprietari:
ru: Владельцы:

# workspace_list_label_publish_date
source: Publish date:
it: Data di pubblicazione:
ru: Дата публикации:

# workspace_list_label_reviewers
source: Reviewers:
it: Revisori:
ru: Рецензенты:

# workspace_list_label_unpublish_date
source: Unpublish date:
it: Data fine pubblicazione:
ru: Дата снятия с сайта:

# workspace_list_label_workspace_description
source: Description:
it: Descrizione:
ru: Описание:

# workspace_list_label_workspace_title
source: Title:
it: Titolo:
ru: Название:

# workspace_list_label_workspace_users
source: Workspace users:
it: Utenti del Workspace:
ru: Пользователи рабочей области:

# workspace_list_label_your_access
source: Your access:
it: Il tuo accesso:
ru: Ваш допуск:

# workspace_list_mount_point_inaccessible
source: This mount point is defined for workspace but not accessible to you. If you need access to this mount point, ask your system administrator to give you access to it.
it: Questo mount point è definito per il solo workspace e non è accessibile a te. Se desideri accedere a questo mount point, chiedi all'amministratore di sistema di darti i permessi di accesso.
ru: Стартовая точка рабочей области недоступна для вас. Если нужен допуск к этой стартовой точке, обратитесь к администратору с просьбой на получение допуска.

# workspace_list_publishing_count
source: Published %d times
it: Pubblicato %d volte
ru: Опубликовано %d раз

# workspace_list_publishing_count_archive
source: Archive
it: Archivio
ru: Архив

# workspace_list_publishing_count_draft
source: Draft
it: Bozza
ru: Черновик

# workspace_published
source: Workspace has been published.
it: Il Workspace è stato pubblicato.
ru: Рабочая область опубликована

# workspace_swapped
source: Workspace has been swapped.
it: Il Workspace è stato scambiato.
ru: Рабочая область обменена
