Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_wizards.xlf
Languages: ru

# colorpicker_black
source: BLACK
ru: ЧЕРНЫЙ

# colorpicker_colorValue
source: Selected Color:
ru: Выбранный цвет:

# colorpicker_fromImage
source: Capture color from image (click on image):
ru: Копировать цвет с картинки (щелкните по картинке):

# colorpicker_fromList
source: Select HTML color name:
ru: Выбрать название цвета в HTML:

# colorpicker_fromMatrix
source: Select color from matrix (websafe colors):
ru: Выбрать цвет из палитры (веб-цвета):

# colorpicker_setClose
source: Save and Close
ru: Сохранить и закрыть

# colorpicker_title
source: Color Picker
ru: Выбор цвета

# colorpicker_white
source: WHITE
ru: БЕЛЫЙ

# forms_autosize
source: Auto size
ru: Авто-настройка размера

# forms_checked
source: Checked
ru: Отмечено

# forms_cols
source: Columns
ru: Колонки

# forms_config
source: Detailed configuration
ru: Подробные настройки

# forms_default
source: Value
ru: Значение

# forms_eform_formtype_mail
source: Send button label
ru: Надпись на кнопке 'Отправить'

# forms_eform_html_enabled
source: HTML mode enabled
ru: Включить режим HTML

# forms_eform_recipient
source: Recipient email
ru: Email получателя

# forms_eform_subject
source: Subject
ru: Тема

# forms_element
source: Element type
ru: Тип элемента

# forms_extra
source: No Wrap
ru: Без переноса строки

# forms_fieldName
source: Field
ru: Поле

# forms_label
source: Label
ru: Метка

# forms_max
source: Max
ru: Максимум

# forms_multiple
source: Multiple
ru: Несколько

# forms_options
source: List options
ru: Список настроек

# forms_preview
source: Preview of element
ru: Просмотреть запись

# forms_refresh
source: Refresh without saving
ru: Перезагрузить без сохранения

# forms_required
source: Required
ru: Обязательное

# forms_rows
source: Rows
ru: Ряды

# forms_size
source: Size
ru: Размер

# forms_special_eform
source: Special configuration for mail forms
ru: Специальные настройки для почтовой формы

# forms_title
source: Forms wizard
ru: Мастер создания форм

# forms_type
source: Type
ru: Тип

# forms_type_check
source: Check box
ru: Переключатель (checkbox)

# forms_type_file
source: File upload
ru: Загрузка файла (file)

# forms_type_hidden
source: Hidden value
ru: Скрытое значение (hidden)

# forms_type_input
source: Input field
ru: Поле ввода (input)

# forms_type_label
source: Label
ru: Метка

# forms_type_password
source: Password field
ru: Поле пароля (password)

# forms_type_property
source: Property
ru: Свойство

# forms_type_radio
source: Radio buttons
ru: Радио-кнопки (radio)

# forms_type_select
source: Selector box
ru: Блок выбора (select)

# forms_type_submit
source: Submit Button
ru: Кнопка Отправки (submit)

# forms_type_textarea
source: Text area
ru: Текстовое поле (textarea)

# grid_addColumn
source: Add column
ru: Добавить столбец

# grid_addRow
source: Add row
ru: Добавить строку

# grid_column
source: Column number
ru: Номер столбца

# grid_columnHelp
source: The column position defines in which area the content is rendered in the frontend.
ru: Позиция столбца определяет область формирования содержимого во внешнем интерфейсе.

# grid_editCell
source: Edit cell
ru: Править ячейку

# grid_labelColumn
source: Column Number
ru: Номер столбца

# grid_labelName
source: Name
ru: Название

# grid_labelSave
source: Save to cell
ru: Сохранить в ячейке

# grid_mergeCell
source: Combine with next cell
ru: Объединить с соседней ячейкой

# grid_name
source: Name
ru: Название

# grid_nameHelp
source: Enter a name for the cell.
ru: Введите название ячейки

# grid_notSet
source: not set
ru: не установлено

# grid_removeColumn
source: Remove column
ru: Удалить столбец

# grid_removeRow
source: Remove row
ru: Удалить строку

# grid_splitCell
source: Split cell
ru: Разделить ячейку

# grid_windowTitle
source: Set cell name and column number
ru: Установить название ячейки и номер столбца

# rte_undoLastChange
source: Undo/Redo last change (%s ago)
ru: Отменить/Восстановить последние изменения (%s шагов)

# table_addColumn
source: Add column to the right
ru: Добавить колонку справа

# table_addRow
source: Add row below
ru: Добавить ряд ниже

# table_bottom
source: Move to bottom
ru: Переместить в конец

# table_down
source: Move down
ru: Переместить ниже

# table_end
source: Move to last column
ru: Переместить в последнюю колонку

# table_left
source: Move left
ru: Переместить левее

# table_noData
source: No table,field or uid given
ru: Таблица, поле или UID не заданы

# table_removeColumn
source: Remove column
ru: Убрать колонку

# table_removeRow
source: Remove row
ru: Убрать ряд

# table_right
source: Move right
ru: Переместить правее

# table_smallFields
source: Small fields
ru: Маленькие поля

# table_start
source: Move to first column
ru: Переместить в первую колонку

# table_title
source: Table wizard
ru: Помощник создания таблиц

# table_top
source: Move to top
ru: Переместить в начало

# table_up
source: Move up
ru: Переместить выше

# tsprop
source: TypoScript property lookup
ru: Просмотр свойств TypoScript

# tsprop_addToList
source: Add to list...
ru: Добавить в список...

# tsprop_mixer_indent
source: Indent +2
ru: Отступ +2

# tsprop_mixer_outdent
source: Outdent -2
ru: Выступ -2

# tsprop_mixer_transfer
source: Transfer & Close
ru: Передать и закрыть

# tsprop_mixer_wrap
source: Wrap
ru: Заключить в

# tsprop_prefix
source: Object prefix
ru: Префикс объекта

# tsprop_title
source: Object title
ru: Название объекта

# tsprop_tsconfig
source: TSconfig online
ru: Сетевой справочник TSconfig

# tsprop_TSref
source: TSref online
ru: Сетевой справочник TSref
