Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_*_groups.xlf
Languages: ru

# TSconfig.details
source: User TSconfig can be set for each backend user and group. Configuration set for backend groups is inherited by the user who is a member of those groups. The available options typically cover user settings like those found in the User>Setup module (in fact options from that module can be forcibly overridden from User TSconfig!), configuration of the "Admin Panel" (frontend), various backend tweaks (lock user to IP, may user clear all cache?, width of the navigation frame etc.) and backend module configuration (overriding any configuration set for backend modules in Page TSconfig).
ru: TSconfig пользователя может быть установлена для каждого внутреннего пользователя и их группы. Настройки для группы внутренних пользователей наследуются ее членами. Доступные параметры обычно затрагивают настройки, находящиеся в модуле Сервис пользователя > Персональные настройки (фактически, параметры этого модуля могут быть переписаны настойками TSconfig пользователя!), настройки "Панели управления" (во внешнем интерфейсе), различные тонкие настройки внутреннего интерфейса (блокировка пользователей по IP, возможность очистки всех кешей пользователем, ширина окна навигации и т.п.) и настройку внутренних модулей (перезаписывая любые настройки, установленные для модулей внутреннего интерфейса в TSconfig страницы).

# TSconfig.image_descr
source: In the TSconfig field help is right at hand - just click the TS wizard icon, then a window will pop up. In the pop-up window you will see a tree of possible configuration values. These are extracted from the TSconfig manual. You can click around to find the options you need to set through this wizard.
ru: В поле TSconfig, помощь всегда под рукой - просто щелкните по значку мастера TS для вызова всплывающего окна. Во всплывающем окне будет дерево всех возможных значений для настройки. Они взяты из руководства по TSconfig. Здесь можно найти все необходимые настраиваемые свойства.

# _TSconfig.seeAlso
source: be_users:TSconfig fe_users:TSconfig fe_groups:TSconfig pages:TSconfig, TSconfig Reference| https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/, TypoScript Syntax | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/
ru: be_users:TSconfig fe_users:TSconfig fe_groups:TSconfig pages:TSconfig, TSconfig Reference Справка | https://docs.typo3.org/typo3cms/TSconfigReference/UserTsconfig/, TypoScript Syntax Синтаксис | https://docs.typo3.org/typo3cms/TyposcriptSyntaxReference/

# TSconfig.syntax
source: TypoScript syntax without conditions and constants.
ru: Синтаксис TypoScript без использования условий и констант.
