Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_corebe.xlf
Languages: ru

# wizard_table_wiz_buttons.description
source: Use the refresh button to update the form without saving it. When you are done you should click one of the real save buttons to save and return to the form from which you entered the wizard. The information from this wizard should then be saved into the field the wizard was associated with.
ru: Используйте кнопку обновления для обновления состава формы (без ее сохранения), например при изменении типа поля и т.п. Закончив редактирование, нужно нажать на одну из кнопок для сохранения и возвращения к форме, с которой был вызван мастер. При этом, информация из мастера будет введена в соответствующее поле, связанное с ним.

# wizard_table_wiz.description
source: The table wizard helps you create tables that are normally stored in the database by XML or a syntax where each line represents a row and each cell is divided by a vertical line sign, "|". This wizard makes it transparent for you.
ru: Мастер создания таблиц помогает правильно и удобно создавать таблицы, которые обычно хранятся в базе данных в соответствии с синтаксисом XML, где каждая строчка представляет строку, а колонки должны разделяться вертикальной чертой, "|". Этот мастер не должен вызвать проблем.

# wizard_table_wiz.details
source: The wizard is quite simple. By the buttons to the left and in the bottom you can add, delete and move columns and rows in the table. You can also disable the setting "Small fields" below the wizard if you want larger textarea fields for the editing.
ru: Мастер предельно прост. Кнопками слева и снизу можно добавлять, удалять и перемещать колонки и строки таблицы. Можно отключить настройку "Маленькие поля" для увеличения текстовых полей при редактировании.

# workspaceSelector.alttitle
source: Workspace Selector
ru: Выбор рабочих пространств

# workspaceSelector.description
source: By this selectorbox you can switch between the workspaces available to you. When you switch workspace the whole backend will reload.
ru: Через это выпадающее меню возможно переключаться между доступными рабочими пространствами. При этом перезагружается весь внутренний интерфейс.

# workspaceSelector.details
source: There are two basic workspace types in TYPO3: The "Live" workspace and a number of "Draft" workspaces. When working in the Live workspace all changes you make will take immediate effect. This is the default and traditional state of operation in TYPO3. When working in the default Draft workspace or any customly created workspaces changes are not applied to the live website but rather made through new versions of any element editable. Since versioning doesn't apply to all elements in TYPO3 there are limitations to what can be done in draft workspaces; Only elements with versioning support can be edited and everything else is read-only. Draft workspaces allow preview in the frontend. When changes are final in a draft workspace they can be published into the live workspace.
ru: В TYPO3 существует два основных типа рабочих пространств: "Чистовая" рабочая область и несколько "Черновых". При работе в "Чистовом" рабочем пространстве, все изменения осуществляются немедленно. Это стандартный и традиционный способ работы в TYPO3. При работе в черновом пространстве, существующем по умолчанию или специально сделанном, изменения не отражаются на внешнем сайте, но вместо этого создается новая версия любого редактируемого элемента. Так как версионирование не применимо ко всем элементам в TYPO3, существуют ограничения на операции, осуществляемые в черновом рабочем пространстве; могут редактироваться лишь элементы поддерживающие версионирование, а все остальные можно лишь просматривать. Черновое пространство возможно просматривать из внешнего интерфейса. При утверждении изменений, они могут быть опубликованы из чернового в чистовое рабочее пространство.
