Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_*_groups.xlf
Languages: ru

# allowed_languages.description
source: Select which record languages the group members are limited to edit.
ru: Выберете, какие из записей для языков могут редактировать члены этой группы.

# allowed_languages.details
source: Records in TYPO3 can be configured to carry information about their language. If that is the case access to these elements will also be evaluated based on whether the user has the language in question included from this list. If a user has no languages listed all together it simply means that he can edit <em>all</em> languages!
ru: Записи в TYPO3 могут быть настроены так, чтобы представлять информацию на определенном языке. Если это так, то доступ к этим элементам также может быть ограничен по этому признаку. Если же языки не представлены, то это означает, что пользователь может редактировать записи на <em>всех</em> языках!

# allowed_languages.image_descr
source: This example shows a situation where two languages, Danish and German, are created in addition to the default language.
ru: В этом примере представлена ситуация, когда в дополнение к основному языку, созданы еще два языка, датский и немецкий.

# custom_options.description
source: Select custom permission options.
ru: Выберете дополнительные параметры доступа.

# custom_options.details
source: This list represents custom permissions introduced by various backend modules (from extensions). The significance of each option depends on the backend module that evaluates it.
ru: В этом списке представлены дополнительные параметры доступа из различных модулей внутреннего интерфейса (из расширений). Описание каждого параметра должно предоставляться соответствующим внутренним модулем.

# custom_options.image_descr
source: This is just an example from an internal test application. It shows how checkboxes are added by a custom module under its own header. You can also show a description text with each checkbox to explain its function.
ru: Это просто пример из внутреннего тестового приложения. Здесь показано, как могут быть добавлены флажки под определенным заголовком. Также может быть показан текст, описывающий каждый параметр.

# db_mountpoints.description
source: Define page tree root points for the group members.
ru: Выбрать исходную точку для дерева страниц, видимого пользователями.

# db_mountpoints.details
source: The page tree in TYPO3 must have some points-of-entry defined. Here you should insert one or more references to a page which will represent a new root page for the page tree. This is called a "Database mount" or "DB mount". DB mounts <i>may</i> be inherited by the users which are members of this group. This depends on whether the user is configured to include the mounts set in the member groups. However it's recommended to use backend user groups like this to configure mounts. Especially if they need to be shared among many users.
ru: В TYPO3, дерево страниц должно иметь определенную точку доступа. Здесь можно вставить одну или несколько ссылок на страницы, представляющие новые корневые страницы для дерева страниц. Это называется "Точка доступа к базе данных" или "Доступ к БД". Точки доступа к БД <i>могут</i>наследоваться пользователями группы. Это зависит от настройки наследования прав из групп для конкретного пользователя. В любом случае, рекомендуется использовать группы внутренних пользователей для распределения прав доступа. Это особенно необходимо, при большом количестве пользователей.

# db_mountpoints.image_descr
source: Here a page is added as a "DB mount"... ... and in the page tree of member users this will become the starting point for the page tree.
ru: Вот страница, добавленная как "Доступ к БД"... ....и дерево страниц для пользователя из этой группы, в котором эта страница стала его корнем.

# .description
source: This is the Backend administration user groups available for the Backend users. These determine the access credentials for the Backend users.
ru: Группы внутренних пользователей, доступные для пользователей внутреннего интерфейса. Членство в группах определяет права пользователей внутреннего интерфейса.

# description.description
source: Enter a short description of the user group, what it is for and who should be members. This is for internal use only.
ru: Введите краткое описание группы пользователей, для чего она предназначена, кто должен в нее входить. Нужно лишь для внутреннего пользования.

# .details
source: Groups contain the main permission settings you can set for a backend user. Many users can be members of the same group and thus share permissions. When a user is a member of many groups (including sub-groups) then the permission settings are added together so that the more groups a user is a member of, the more access is granted to him.
ru: Группы содержат основные настройки доступа, которые возможно установить для внутреннего пользователя. В одну группу может входить множество пользователей, которые будут иметь одинаковые права. Когда пользователь входит в несколько групп (включая подгруппы), настройки доступа складываются, таким образом, чем в большее количество групп входит пользователь, тем больше прав он получает.

# explicit_allowdeny.description
source: Select field values to explicitly deny or allow for user group members.
ru: Выберете явно разрешенные или запрещенные для пользователей группы значения полей.

# explicit_allowdeny.details
source: Selector box fields can be configured for access control on value level. This list represents all values that are configured for access control. Each value can be configured to require either explicit access (Allow) or explicit denial (Deny). If a value has the prefix "Allow" (green icon) it means that by default users <em>cannot</em> set this value unless they are member of a user group which explicitly allows it (by setting this checkbox). If a value has the prefix "Deny" (red icon) it means that by default users can set this value unless they are member of a user group which explicitly denies it (by setting this checkbox). The list is organized so values from the same selector box is listed together. If values from a selectorbox is not present in the allow/deny list it simply means they are not evaluated and hence they can be set by anyone having access to the field in general.
ru: Выбирая поля, можно настроить контроль доступа на уровне значений. В этом списке представлены все значения, которые можно настроить для контроля доступа. Каждое значение может быть настроено, требуя либо явный доступ (Разрешить), либо либо явный запрет (Запретить). Если у значения имеется префикс "Разрешить" (зеленый значок), это значит, что обычные пользователи <em>не могут</em> установить это значение, только если они не члены группы, которой явно позволено его устанавливать (установкой этого флажка). Если же значение имеет префикс "Запрещено" (красный значок), это значит, что обычные пользователи могут установить это значение, не зависимо от того, входят ли они в группу, которой позволено его устанавливать (установкой этого флажка). Список сгруппирован по блокам выбора. Если значения какого-то блока не представлены, это просто значит, что они не представляют ценности и могут быть установлены любым, имеющим доступ к этому блоку выбора значений.

# file_mountpoints.description
source: Define startpoints for the file folder tree.
ru: Выбрать исходную паку, начиная с которой пользователям будет доступно дерево файловой системы.

# _file_mountpoints.seeAlso
source: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, More about File Mounts | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
ru: be_groups:db_mountpoints, be_users:file_mountpoints, be_users:options, be_users, sys_filemounts, xMOD_csh_corebe:filelist_module, Подробнее о монтировании файлов | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/

# fileoper_perms.description
source: Select file operation permissions for the group members.
ru: Выберете разрешения для операция с файлами для членов данной группы.

# fileoper_perms.details
source: These settings relate to the functions found in the File>Filelist module as well as general upload of files. <strong>Notice</strong> that these settings apply to all members of this group and extend the users permissions accordingly.
ru: Эти настройки относятся к функциям модуля Файл>Список файлов, также, как и к общей загрузке файлов. <strong>Помните</strong>, что данные настройки затрагивают всех членов данной группы и соответственно расширяют права пользователей.

# _fileoper_perms.seeAlso
source: be_groups:file_mountpoints, be_users:file_mountpoints, be_users:file_permissions
ru: be_groups:file_mountpoints, be_users:file_mountpoints, be_users:fileoper_perms

# file_permissions.description
source: Select file operation permissions for the group members.
ru: Выберете разрешения для операция с файлами для членов данной группы.

# file_permissions.details
source: These settings relate to the functions found in the File>Filelist module as well as general upload of files. <strong>Notice</strong> that these settings apply to all members of this group and extend the users permissions accordingly.
ru: Эти настройки относятся как к функциям модуля Файл>Список файлов, так и к общей загрузке файлов. <strong>Внимание</strong> настройки применяются ко всем членам этой группы и дополняют соответствующие разрешения пользователей.

# groupMods.description
source: Select available backend modules for the group members.
ru: Выберете доступные для членов группы внутренние модули.

# groupMods.details
source: This determines which 'menu items' are available for the group members. This list of modules is added to any modules selected in other member groups of a user as well as the corresponding field of the user himself.
ru: Определяет, какие "элементы меню" будут доступны для членов этой группы. Этот список модулей добавляется к модулям, выбранным в других группах пользователей для конкретного пользователя, также как и в соответствующие поля.

# groupMods.image_descr
source: The Backend Modules available for a user is reflected in the menu items of the backend. For most regular users only modules in the Web and File main modules are enabled. Typically "Web > Page" is used for editing of page content. This is the assignment of Backend Modules to the user from the screenshot above. All four Web sub-modules and the two User sub-modules are configured here. However the File > Filelist module must have been configured for another member group of this user (or inside the user profile itself which is also possible). The Help modules are all accessible by default and does not require explicit access.
ru: Модули внутреннего интерфейса, доступные для пользователя, отражаются на элементах меню внутреннего интерфейса. Для обычных пользователей, доступны лишь модули из основных разделов Веб и Файл. Обычно "Веб > Страница" используется для редактирования содержимого страниц. Это модули внутреннего интерфейса, доступные для пользователя из приведенного рисунка. Все четыре подмодуля Веб и два подмодуля Пользователь. Но модуль Файл > Список файлов, очевидно был настроен в другой группе пользователей, в членом которой является данный пользователь (или непосредственно в профиле пользователя). Модуль Справка по умолчанию всегда доступен и не требует никаких дополнительных разрешений.

# _groupMods.seeAlso
source: be_users:userMods, be_groups:inc_access_lists, Backend Interface | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Backend/
ru: be_users:userMods, be_groups:inc_access_lists, Backend интерфейс | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Backend/

# hidden.description
source: Disables a user group.
ru: Отключение группы пользователей.

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them.
ru: При отключении группы пользователей, все ее члены перестанут наследовать все свойства, которые давала эта группа (доступ к файлам, страницам и т.п.).

# hide_in_lists.description
source: This option will prevent the user group from showing up in lists, where user groups are selected.
ru: Этот параметр убирает текущую группу из списков выбора групп пользователей.

# hide_in_lists.details
source: This will affect the list of user groups in the Task Center To-Do and Messages parts as well as the Web>Access module. The option is extremely useful if you have general user groups defining some global properties which all your users are members of. Then you would probably not like all those users to 'see' each other through the membership of this group, for instance sending messages or To-Dos to each other. And this is what is option will prevent.
ru: Это затронет списки групп пользователей в Центре заданий и части сообщений, также как и модуль Веб > Доступ. Параметр чрезвычайно полезен, если существует общая группа пользователей, в которой определены некие общие свойства для входящих в нее пользователей. При этом не нужно, чтобы все эти пользователи "видели" друг друга, как пользователи одной этой группы, например для отправки сообщения или задачи друг другу. Именно для этого и предназначен этот параметр.

# .image_descr
source: Backend Usergroups are found in the root of the page tree where only "admin" users can edit them. The usergroups with red icons in this image are the ones with Access Lists enabled. The blue are just plain usergroups. This usergroup has Access Lists enabled. In the Access Lists you specify which modules, tables, database fields etc. the group members can access in TYPO3.
ru: Группы пользователей внутреннего интерфейса находятся в корне дерева страниц, который могут редактировать лишь пользователи-администраторы. Для групп пользователей с красным значком включены списки доступа. Группы пользователей с синими значками - обычные группы пользователей. У этих групп пользователей включены списки доступа. В списках доступа можно определить, к каким модулям, таблицам, полям баз данных и т.п. имеют доступ члены данной группы в TYPO3.

# inc_access_lists.description
source: Select whether the Access Lists for Page type, Tables, Module and Allowed excludefield are enabled for this group.
ru: Выберете, нужно ли включать списки доступа к типам страниц, таблицам, модулям и поля исключения для этой группы.

# inc_access_lists.details
source: If this option is disabled the Access Lists cannot be configured for the group. When Access Lists are disabled the icon for the group is blue while it is red when Access Lists are enabled.
ru: Если этот параметр выключен, для группы невозможно будет настроить списки доступа. При отключении списков доступа, значок группы синий, а когда списки доступа включены - красный.

# lockToDomain.description
source: Enter the host name from which the user is forced to login.
ru: Введите название хоста, с которого должен будет входить пользователь.

# lockToDomain.details
source: A TYPO3 system may host multiple websites on multiple domains. Therefore this option secures that users can login only from a certain host name. Setting this to for example "www.my-domain.com" will require a user to be logged in from that domain if membership of this group should be gained. Otherwise the group will be ignored for the user.
ru: В системе TYPO3 может быть несколько сайтов в нескольких доменах. Этот параметр ограничивает регистрацию пользователей заданным хостом. Установка, например "www.my-domain.com", потребует регистрации пользователей, входящих в эту группу, регистрировать лишь с этого домена. Иначе права, предоставляемые группой не будут даваться пользователю.

# non_exclude_fields.description
source: Certain table fields are not available by default. Those fields can be explicitly enabled for the group members here.
ru: Определенные поля таблицы не доступны по умолчанию. Доступ для членов группы к этим полям можно явно дать в этом списке.

# non_exclude_fields.details
source: "Allowed excludefields" allows you to detail the permissions granted to tables. By default all these fields are not available to users but must be specifically enabled by being selected here. One application of this is that pages are usually hidden by default and that the hidden field is not available for a user unless he has been granted access by this list of "Allowed excludefields". So the user may create a new page, but cannot un-hide the page - unless of course he has been assigned the "Page: Hide page" exclude field through one of his member groups. Of course it does not make any sense to add fields from tables which are not included in the list of tables allowed to be modified.
ru: "Разрешённые поля-исключения" позволяют детализировать права, предоставляемые таблицами. По умолчанию все эти поля не доступны для пользователей, но могут быть явно включены, если выбранным здесь. Одно из применений этой возможности состоит в том, что по умолчанию новые страницы обычно скрываются, а поле для скрытия недоступно для пользователя, если только его специально не сделать доступным в это списке "доступных полей исключений". Поэтому, пользователь может создавать новые страницы, но не сможет их показать, если, конечно же, ему не разрешен доступ к полю "Страница: скрыть страницу" посредством прав для одной из групп пользователей, в которых он состоит. Конечно же, не имеет смысла добавлять здесь поля из таблиц, не включенных в список доступа для изменения.

# _non_exclude_fields.seeAlso
source: be_groups:inc_access_lists, Examples from "Getting Started" | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
ru: be_groups:inc_access_lists, Примеры из "Getting Started" | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# pagetypes_select.description
source: Select which 'Types' of Pages the members may set.
ru: Выберете "Типы" страниц, которые могут устанавливать члены группы.

# pagetypes_select.image_descr
source: The list of typical page types available in a CMS context. Selecting Page types for a usergroup defines which of these options can be selected by member users.
ru: Список типичных в контексте CMS типов страниц. Выбор типа страниц для группы, определяет, какие параметры могут быть выбраны пользователями из этой группы.

# _.seeAlso
source: be_users, "Inside TYPO3" about users / groups | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/, How to set up a backend user | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/, Setting up groups (from "Getting Started") | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
ru: be_users, "TYPO3 изнутри" о пользователях / группах |https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/UsersAndGroups/, Настройка внутренних пользователей | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/SettingUpANewUser/, Настройка групп (из "Getting Started") |https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# subgroup.details
source: The properties of subgroups are added to the properties of this group and basically they will simply be added to the list of member groups of any user which is a member of this group. This feature provides a great way to create 'Supervisor' user groups.
ru: Свойства подгрупп будут добавлены к свойствам текущей группы и члены этой группы станут также членами подгрупп. Этот параметр предоставляет отличную возможность для создания пользовательской группы "Инспектор".

# tables_modify.description
source: Select which tables the members may modify.
ru: Выберете какие таблицы могут изменять члены группы.

# tables_modify.details
source: An important part of setting permissions is to define which database tables a user is allowed to modify. Tables allowed for modification is automatically also allowed for selection and thus you don't need to set tables entered here in the "Tables (listing)" box. <strong>Notice</strong> that this list adds to the fields selected in other member groups of a user.
ru: Очень важно, при настройке доступа, определить, какие таблицы сможет редактировать пользователь. Доступные для редактирования таблицы автоматически становятся доступными для просмотра, так что не нужно заботиться о внесении их в соответствующий список — "Таблицы (просматривать)". <strong>Помните</strong>, что этот список дополнит аналогичные поля из групп, в которые входит пользователь.

# tables_modify.image_descr
source: The screenshot above shows how the "Create new record" dialog looks for a user limited to editing only "Page" and "Page content" elements. The two tables are simply added to the list of "Tables (modify)" in the group Access Lists. This is (an example of) the full amount of elements that can be created on the page by the "admin" user for whom there are no restrictions.
ru: Приведенный ниже снимок экрана демонстрирует, как выглядит диалог "Создать новую запись" для пользователя, ограниченного редактированием лишь элементов "Страница" и "Содержимое страницы". Эти две таблицы просто добавлены в список "Таблицы (редактировать)" из группы Списки доступа. Это (из примера) полный список элементов, доступных для создания на странице для пользователя "администратора", ничем не ограниченного.

# tables_select.description
source: Select which tables the members may see in record lists ('modify' tables does not need to be re-entered here!).
ru: Выберете какие таблицы могут просматривать члены группы (не нужно вносить доступные для "редактирования" таблицы!)

# tables_select.details
source: This determines which tables - in addition to those selected in the "Tables (modify)" box - may be viewed and listed for the member users. He is not able to <em>edit</em> the table - only select the records and view the content. This list is not very important. It's a pretty rare situation that a user may select tables but not modify them.
ru: Здесь определяется, какие таблицы (в добавок к выбранным в списке "Таблицы (редактировать)") могут просматривать члены группы. Эти таблицы будет невозможно <em>редактировать</em>, но можно будет выбрать запись и просмотреть ее содержимое. Это не очень важный список. Трудно представить ситуацию, в которой понадобится просматривать таблицы без возможности их редактирования.

# title.description
source: Name of the Backend usergroup. The name should be descriptive and can always be changed later.
ru: Название группы пользователей. Название должно говорить за себя и всегда может быть изменено позже.

# title.details
source: Backend Usergroups are identified by their "uid" field value (integer) and therefore the title can always be changed. The "uid" can never be changed for a user group.
ru: Группы внутренних пользователей определяются по значению поля "uid" (целое число) и, поэтому, название ее всегда может быть изменено. Но "uid" для группы пользователей всегда остается неизменным .

# title.image_descr
source: The usergroup title is shown in the record lists.
ru: Название группы пользователей отображается в списке записей.

# TSconfig.description
source: User TSconfig: Additional configuration through TypoScript style values (Advanced).
ru: TSconfig пользователя: дополнительная настройка через значения на TypoScript (дополнительная настройка).
