Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_tca.xlf
Languages: ru

# allowed_languages
source: Limit to languages:
ru: Привязать к языкам:

# be_groups
source: Backend usergroup
ru: Группа внутренних пользователей

# be_groups.custom_options
source: Custom module options:
ru: Настройки дополнительных модулей:

# be_groups.explicit_allowdeny
source: Explicitly allow/deny field values:
ru: Явно разрешить/запретить значения полей:

# be_groups.fileoper_perms
source: Fileoperation permissions:
ru: Разрешения для операций с файлами:

# be_groups.fileoper_perms_diroper_perms
source: Directory: Move,Delete,Rename,New
ru: Папки: Перемещение,Удаление,Переименование,Создание

# be_groups.fileoper_perms_diroper_perms_copy
source: Directory: Copy
ru: Папки: Копирование

# be_groups.fileoper_perms_diroper_perms_delete
source: Directory: Delete recursively (rm -Rf)
ru: Папки: Удаление вложенного (rm -Rf)

# be_groups.fileoper_perms_general
source: Files: Upload,Copy,Move,Delete,Rename,New,Edit
ru: Файлы: Загрузка,Копирование,Перемещение,Удаление,Переименование,Создание,Правка

# be_groups.fileoper_perms_unzip
source: Files: Unzip
ru: Файлы: распаковка

# be_groups.file_permissions.files
source: Files:
ru: Файлы:

# be_groups.file_permissions.files_add
source: Files: Add
ru: Файлы: добавление

# be_groups.file_permissions.files_copy
source: Files: Copy
ru: Файлы: копирование

# be_groups.file_permissions.files_delete
source: Files: Delete
ru: Файлы: удаление

# be_groups.file_permissions.files_edit
source: Files: Edit
ru: Файлы: правка

# be_groups.file_permissions.files_move
source: Files: Move
ru: Файлы: перемещение

# be_groups.file_permissions.files_read
source: Files: Read
ru: Файлы: чтение

# be_groups.file_permissions.files_rename
source: Files: Rename
ru: Файлы: переименование

# be_groups.file_permissions.files_write
source: Files: Write
ru: Файлы: запись

# be_groups.file_permissions.folder
source: Directory:
ru: Директория:

# be_groups.file_permissions.folder_add
source: Directory: Add
ru: Директория: добавление

# be_groups.file_permissions.folder_copy
source: Directory: Copy
ru: Директории: копировать

# be_groups.file_permissions.folder_delete
source: Directory: Delete
ru: Директория: удаление

# be_groups.file_permissions.folder_move
source: Directory: Move
ru: Директория: перемещение

# be_groups.file_permissions.folder_read
source: Directory: Read
ru: Директория: чтение

# be_groups.file_permissions.folder_recursivedelete
source: Directory: Delete recursively
ru: Директория: рекурсивное удаление

# be_groups.file_permissions.folder_rename
source: Directory: Rename
ru: Директория: переименование

# be_groups.file_permissions.folder_write
source: Directory: Write
ru: Директория: запись

# be_groups.hide_in_lists
source: Hide in lists:
ru: Спрятать в списках:

# be_groups.inc_access_lists
source: Include Access Lists:
ru: Включить списки доступа:

# be_groups.non_exclude_fields
source: Allowed excludefields:
ru: Разрешённые поля-исключения:

# be_groups.pagetypes_select
source: Page types:
ru: Типы страниц:

# be_groups.subgroup
source: Inherit settings from groups:
ru: Наследовать настройки из групп:

# be_groups.tables_modify
source: Tables (modify):
ru: Таблицы (редактировать):

# be_groups.tables_select
source: Tables (listing):
ru: Таблицы (просматривать):

# be_groups.tabs.base_rights
source: Access Lists
ru: Списки доступа

# be_groups.tabs.extended
source: Extended
ru: Дополнительно

# be_groups.tabs.mounts_and_workspaces
source: Mounts and Workspaces
ru: Точки доступа и рабочие области

# be_groups.tabs.options
source: Options
ru: Параметры

# be_groups.title
source: Grouptitle:
ru: Название группы:

# be_users
source: Backend user
ru: Внутренний пользователь

# be_users.admin
source: Admin(!):
ru: Администратор(!):

# be_users.disableIPlock
source: Disable IP lock for user:
ru: Запретить привязку к IP для этого пользователя:

# be_users.fileoper_perms
source: Fileoperation permissions:
ru: Разрешения для операций с файлами:

# be_users.fileoper_perms_diroper_perms
source: Directory: Move,Delete,Rename,New
ru: Директории: перемещать,удалять,переименовывать,создавать

# be_users.fileoper_perms_diroper_perms_copy
source: Directory: Copy
ru: Директории: копировать

# be_users.fileoper_perms_diroper_perms_delete
source: Directory: Delete recursively (rm -Rf)
ru: Директории: удалять рекурсивно (rm -Rf)

# be_users.fileoper_perms_general
source: Files: Upload,Copy,Move,Delete,Rename,New,Edit
ru: Файлы: загружать,копировать,перемещать,удалять,переименовывать,создавать,редактировать

# be_users.fileoper_perms_unzip
source: Files: Unzip
ru: Файлы: распаковывать zip архивы

# be_users.file_permissions.file_delete
source: Files: Delete
ru: Файлы: удаление

# be_users.file_permissions.files
source: Files:
ru: Файлы

# be_users.file_permissions.files_add
source: Files: Add
ru: Файлы: добавлять

# be_users.file_permissions.files_copy
source: Files: Copy
ru: Файлы: копировать

# be_users.file_permissions.files_move
source: Files: Move
ru: Файлы: перемещение

# be_users.file_permissions.files_read
source: Files: Read
ru: Файлы: чтение

# be_users.file_permissions.files_rename
source: Files: Rename
ru: Файлы: переименование

# be_users.file_permissions.files_write
source: Files: Write
ru: Файлы: запись

# be_users.lang
source: Default Language:
ru: Язык по умолчанию:

# be_users.options
source: Mount from groups:
ru: Наследовать точки доступа из групп:

# be_users.options_db_mounts
source: DB Mounts
ru: Точки доступа к БД:

# be_users.options_file_mounts
source: File Mounts
ru: Точки доступа к файлам:

# be_users.password
source: Password:
ru: Пароль:

# be_users.tabs.access
source: Access
ru: Доступ

# be_users.tabs.extended
source: Extended
ru: Дополнительно

# be_users.tabs.mounts_and_workspaces
source: Mounts and Workspaces
ru: Точки доступа и рабочие области

# be_users.tabs.options
source: Options
ru: Параметры

# be_users.tabs.rights
source: Access Rights
ru: Права доступа

# be_users.usergroup
source: Group:
ru: Группа:

# be_users.usergroup_add_title
source: Create new group
ru: Создать новую группу

# be_users.usergroup_edit_title
source: Edit usergroup
ru: Править группу пользователя

# be_users.usergroup_list_title
source: List groups
ru: Список групп

# be_users.username
source: Username:
ru: Имя пользователя:

# category_perms
source: Category Mounts:
ru: Категория точки монтирования:

# db_mountpoints
source: DB Mounts:
ru: Доступ к БД:

# doktype.I.0
source: Standard
ru: Стандарт

# doktype.I.1
source: SysFolder
ru: Системная папка

# doktype.I.2
source: Recycler
ru: Корзина

# doktype.I.folder
source: Folder
ru: Папка

# editlock
source: Restrict editing by non-Admins:
ru: Запретить редактирование помимо администраторов:

# file_mountpoints
source: File Mounts:
ru: Точки доступа к файлам:

# file_mountpoints_add_title
source: Create new filemount
ru: Создать новую точку доступа к файлам

# file_mountpoints_edit_title
source: Edit filemount
ru: Редактировать точку доступа к файлам

# file_mountpoints_list_title
source: List filemounts
ru: Список точек доступа к файлам

# is_siteroot
source: Is root of website:
ru: Корень сайта:

source: Lock to domain:
ru: Ограничить доменом:

# pages
source: Page
ru: Страница

# php_tree_stop
source: Stop page tree:
ru: Конец дерева:

# storage_pid
source: General Record Storage page:
ru: Место хранения общих записей:

# sys_category
source: Category
ru: Категория

# sys_category.categories
source: Categories
ru: Категории

# sys_category.description
source: Description
ru: Описание

# sys_category.items
source: Items
ru: Элементы

# sys_category.parent
source: Parent
ru: Родитель

# sys_category.tabs.category
source: Categories
ru: Категории

# sys_category.tabs.items
source: Items
ru: Элементы

# sys_category.title
source: Title
ru: Название

# sys_collection
source: Record Collection
ru: Набор записей

# sys_collection.description
source: Description
ru: Описание

# sys_collection.items
source: Items
ru: Элементы

# sys_collection.table_name
source: Record Type of Collection
ru: Тип записей в наборе

# sys_collection.title
source: Collection-Name
ru: Название набора

# sys_collection.type
source: Type of collection
ru: Тип набора

# sys_collection.type.static
source: static record composition
ru: набор статических записей

# sys_file
source: File
ru: Файл

# sys_file.alternative
source: Alternative Text
ru: Альтернативный текст

# sys_file_collection
source: File collection
ru: Файловая коллекция

# sys_file_collection.category
source: Category
ru: Категория

# sys_file_collection.files
source: Files
ru: Файлы

# sys_file_collection.folder
source: Folder
ru: Папка

# sys_file_collection.storage
source: File Storage
ru: Файловое хранилище

# sys_file_collection.title
source: Title
ru: Название

# sys_file_collection.type
source: Type
ru: Тип

# sys_file_collection.type.0
source: Static selection of files
ru: Статический выбор файлов

# sys_file_collection.type.1
source: Folder from Storage
ru: Папка из хранилища

# sys_file_collection.type.2
source: Select by category
ru: Выбор по категории

# sys_file.description
source: Description
ru: Описание

# sys_file.identifier
source: Identifier
ru: Идентификатор

# sys_file_metadata
source: File Metadata
ru: Метаданные файла

# sys_file.metadata
source: Metadata records
ru: Записи мета данных

# sys_file.mime_type
source: Mime Type
ru: Тип MIME

# sys_file.missing
source: Marked as missing
ru: Отмечено как отсутствующее

# sys_filemounts
source: Filemount
ru: Доступ к файлам

# sys_filemounts.base
source: Base:
ru: База:

# sys_filemounts.base_relative
source: relative ../fileadmin/
ru: относительный ../fileadmin/

# sys_filemounts.path
source: Path:
ru: Путь:

# sys_filemounts.tabs.mountpoints
source: Mountpoints
ru: Точки доступа

# sys_filemounts.tabs.other
source: Other
ru: Другое

# sys_filemounts.tabs.publishing
source: Publishing
ru: Публикация

# sys_filemounts.tabs.users
source: Users
ru: Пользователи

# sys_filemounts.title
source: Label:
ru: Метка:

# sys_file.name
source: Filename
ru: Имя файла

# sys_file_reference
source: File Reference
ru: Ссылка на файл

# sys_file_reference.alternative
source: Alternative Text
ru: Альтернативный текст

# sys_file_reference.basicoverlayPalette
source: File Metadata
ru: Метаданные файла

# sys_file_reference.description
source: Description (Caption)
ru: Описание (подпись)

# sys_file_reference.downloadname
source: Download Name
ru: Название загрузки

# sys_file_reference.fieldname
source: Foreign Field
ru: Внешнее (foreign) поле

# sys_file_reference.imageoverlayPalette
source: Image Metadata
ru: Метаданные картинки

# sys_file_reference.link
source: Link
ru: Ссылка

# sys_file_reference.sorting_foreign
source: Sorting foreign
ru: Внешняя (foreign) сортировка

# sys_file_reference.tablenames
source: Table name
ru: Имя таблицы

# sys_file_reference.title
source: Title
ru: Название

# sys_file_reference.uid_foreign
source: Used by content elements
ru: Используется элементом содержимого

# sys_file_reference.uid_local
source: File
ru: Файл

# sys_file.size
source: Size
ru: Размер

# sys_file_storage
source: File Storage
ru: Файловое хранилище

# sys_file.storage
source: Storage
ru: Хранилище

# sys_file_storage.capabilities
source: Capabilities
ru: Возможности

# sys_file_storage.configuration
source: Driver Configuration
ru: Настройки драйвера

# sys_file_storage.description
source: Description
ru: Описание

# sys_file_storage.driver
source: Driver
ru: Драйвер

# sys_file_storage.driver.local
source: Local Filesystem
ru: Локальная файловая система

# sys_file_storage.hidden
source: Hide from listings
ru: Не показывать в списке

# sys_file_storage.is_browsable
source: Is browsable?
ru: Можно просмотреть?

# sys_file_storage.is_default
source: Is default storage?
ru: Хранилище по умолчанию?

# sys_file_storage.is_online
source: Is online?
ru: Онлайн?

# sys_file_storage.is_public
source: Is publicly available?
ru: Разрешён публичный доступ?

# sys_file_storage.is_writable
source: Is writable?
ru: Открыт для записи?

# sys_file_storage.name
source: Name
ru: Имя

# sys_file_storage.processingfolder
source: Folder for manipulated and temporary images etc.
ru: Папка для временного хранения картинок и т.п.

# sys_file_storage.type
source: Entry point
ru: Точка входа

# sys_file.title
source: Title
ru: Название

# sys_file.type
source: File Type
ru: Тип файла

# sys_file.type.audio
source: Audio
ru: Аудио

# sys_file.type.image
source: Image
ru: Картинка

# sys_file.type.software
source: Software
ru: Программное обеспечение

# sys_file.type.text
source: Text
ru: Текст

# sys_file.type.unknown
source: Unknown
ru: Неизвестно

# sys_file.type.video
source: Video
ru: Видео

# sys_file.usage_count
source: Usage Count
ru: Счётчик обращений

# sys_language
source: Website Language
ru: Язык сайта

# sys_language.flag
source: Select flag icon:
ru: Выберите символ флага:

# sys_language.isocode
source: Select Official Language (ISO code):
ru: Выберите официальный язык (код ISO):

# sys_log
source: System Log
ru: Системный журнал

# sys_news
source: System News
ru: Системные новости

# sys_news.tabs.access
source: Access
ru: Доступ

# sys_workspace
source: Workspace
ru: Рабочая область

# sys_workspace.adminusers
source: Owners:
ru: Владельцы:

# sys_workspace.disable_autocreate
source: Disable auto-versioning when editing
ru: Запретить автоматическое управление версиями во время правки

# sys_workspace.freeze
source: Freeze Editing
ru: Остановить редактирование

# sys_workspace.live_edit
source: Allow "live" editing of records from tables without versioning
ru: Разрешить "оперативное" редактирование записей из таблиц без поддержки управления версиями

# sys_workspace.members
source: Members:
ru: Члены:

# sys_workspace.publish_access
source: Publish access:
ru: Право публикации:

# sys_workspace.publish_time
source: Publish:
ru: Опубликовать:

# sys_workspace.reviewers
source: Reviewers:
ru: Редакторы:

# sys_workspace.review_stage_edit
source: Allow members to edit records in "Review" stage
ru: Разрешить членам рабочей области править записи на стадии рассмотрения

# sys_workspace.stagechg_notification
source: Stage change notification by email:
ru: Уведомление об изменениях стадии по электронной почте:

# sys_workspace.swap_modes
source: Swap modes
ru: Режим обмена

# sys_workspace.unpublish_time
source: Un-Publish:
ru: Снять публикацию:

# sys_workspace.vtypes
source: Disable Versioning Types for members and reviewers:
ru: Запрещенные типы управления версиями для членов и редакторов области:

# title
source: Pagetitle:
ru: Заголовок:

# userMods
source: Modules:
ru: Модули:

# workspace_perms
source: Workspace permissions:
ru: Настройки доступа к рабочим областям:

# workspace_perms_custom
source: Create new workspace projects
ru: Создать новые рабочие области

# workspace_perms_draft
source: Edit Draft (Offline)
ru: Править черновую рабочую область (Оффлайн)

# workspace_perms_live
source: Edit Live (Online)
ru: Править оперативную рабочую область (Онлайн)
