Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_mod_web_list.xlf
Languages: ru

# clip_deleteMarked
source: Delete marked
ru: Удалить выделенные

# clip_deleteMarkedWarning
source: Are you sure you want to delete all marked records from the table '%s'?
ru: Вы уверены, что хотите удалить все выделенные записи из таблицы '%s'

# clip_duplicates
source: Mark duplicates
ru: Выделить дубликаты

# clip_editMarked
source: Edit marked
ru: Редактировать выделенные

# clip_markRecords
source: Mark All/Mark none
ru: Выделить все/Снять выделение

# clip_paste
source: Paste in clipboard content
ru: Вставить содержимое Буфера обмена

# clip_pasteAfter
source: Paste after: Clipboard content is inserted after this record
ru: Вставка после: вставить содержимое Буфера обмена после этой записи

# clip_pasteInto
source: Paste into: Clipboard content is inserted on this page
ru: Вставка внутрь: вставить содержимое Буфера обмена в эту страницу

# clip_selectMarked
source: Transfer the selection of records to clipboard
ru: Передать выбранные записи в Буфер обмена

# contractView
source: List all tables
ru: Список всех таблиц

# defaultLanguage
source: Default
ru: Стандартный

# delete
source: Delete record (!)
ru: Удалить запись (!)

# deleteWarning
source: Are you sure you want to delete this record?
ru: Вы действительно хотите удалить эту запись?

source: Display versions
ru: Показать версии

# edit
source: Edit record
ru: Редактировать запись

# editPage
source: Edit page properties
ru: Свойства страницы

# editShownColumns
source: Edit all shown fields of the listed records
ru: Редактировать все поля перечисленных записей

# editThisColumn
source: Edit the '%s' field of the listed records
ru: Редактировать поле '%s' перечисленных записей

# expandView
source: List only this table
ru: Список только этих таблиц

# hide
source: Hide record
ru: Сделать запись невидимой

source: Hide page
ru: Сделать страницу невидимой

# history
source: Display change history / Un-do
ru: Показать историю изменений / Отмена

# largeControl
source: Extended view
ru: Расширенный вид

# localization
source: Localization view
ru: Просмотр переводов

# Localize
source: Localize to:
ru: Перевести на:

# missingTcaColumnsMessageTitle
source: Missing TCA definition
ru: Ошибочное определение TCA

# mlang_labels_tabdescr
source: The Web>List module provides low level access to records appearing on a page.
ru: Модуль Веб>Список обеспечивает доступ к наиболее широкому количеству элементов и параметров страницы.

# mlang_labels_tablabel
source: List of database-records
ru: Список записей базы данных

# mlang_tabs_tab
source: List
ru: Список

# moveDown
source: Move down in list
ru: Переместить ниже по списку

source: Move page
ru: Переместить страницу

# move_record
source: Re-position content element
ru: Перемещение записи

# moveUp
source: Move up in list
ru: Переместить выше по списку

# multipleLanguages
source: All languages
ru: Все языки

# new
source: New record
ru: Создать запись

# newPage
source: Create new page after this page
ru: Создать новую страницу после этой

# newRecord
source: Create new record after this record
ru: Создать новую запись после этой

# newRecordGeneral
source: Create new record
ru: Создать новую запись

# nextLevel
source: Move this page to be a subpage of the page above (Outwards)
ru: Переместить эту страницу дальше от корня дерева (так, чтобы она стала подстраницей той страницы, которая сейчас в предыдущей строке списка)

# permissions
source: Set permissions for page
ru: Установить права доступа к странице

# prevLevel
source: Move this page to the position after the current parent page (Inwards)
ru: Переместить страницу ближе к корню дерева (так, чтобы она располагалась сразу после страницы, которая сейчас является родительской)

# restore
source: Restore record
ru: Восстановить запись

# restoreWarning
source: Are you sure you want to restore this record by reverting the delete status?
ru: Вы действительно хотите восстановить удаленную запись?

source: Show clipboard
ru: Показать Буфер обмена

# showInfo
source: Display information
ru: Показать информацию

# unHide
source: Un-hide record
ru: Сделать запись видимой

source: Un-hide page
ru: Сделать страницу видимой

# viewRecords
source: Viewing records of
ru: Просмотр записей
