Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_sysws.xlf
Languages: ru

# adminusers.description
source: Owners of the workspace are those who are allowed to add members and reviewers to the workspace and pick the page tree starting points etc.
ru: Владельцы рабочей области могут добавлять в него новых членов и рецензентов, указывать точки доступа к дереву страниц.

# adminusers.details
source: Owners can also add and delete other owners. If a user is allowed to create workspaces himself he will automatically become the initial owner user of the workspace. They are also the only ones who can eventually publish the workspace content (except general TYPO3 "admin" users) and thus the highest review authority (unless members/reviewers have access to the Live workspace).
ru: Владельцы могут также добавлять и удалять других владельцев. Если пользователь сам может создавать рабочие области, он автоматически становится изначальным владельцем созданной рабочей области. Также, лишь владельцы могут публиковать содержимое рабочей области (за исключением пользователей-"администраторов" TYPO3), получая, таким образом, наивысшие полномочия при рассмотрении публикации (если у членов/рецензентов нет доступа к оперативной рабочей области).

# db_mountpoints.description
source: If one or more DB mounts are specified the page tree of the backend will be locked into these root points during work in the workspace.
ru: Если определена хотя бы одна точка доступа к БД, дерево страниц во внутреннем интерфейсе будет ограничено в пределах этих точек во время работы в текущей рабочей области.

# db_mountpoints.details
source: Any DB mount specified here must be inside the DB mount set for the backend user who logs in. If that is not the case the workspace DB mount will simply not be mounted for the user. If no DB mounts are specified for the workspace the users will access the DB mounts of their user profile.
ru: Любая определенная здесь точка доступа к БД должна находиться в пределах точек досупа к БД, определенных для внутреннего пользователя. Если точек доступа к БД не определено, пользователи будут ограничены точками доступа к БД из своего профиля.

# .description
source: Defines custom workspaces in TYPO3 which allows for groups of people to work together in a publishing process with draft content. More information about workspaces can be found in the document "Inside TYPO3".
ru: Определяет определенные пользователем рабочие области в TYPO3, позволяющие сотрудничать людям в процессе публикации чернового содрежимого. Дополнительную информацию по рабочим областям можно найти в документе "Inside TYPO3".

# description.description
source: Make a description of the workspace purpose here. This information is shown in the Workspace Manager and should instruct the workspace users about the purpose of the workspace.
ru: По возможности дайте описание рабочей области. Эта информация будет показана в модуле управления рабочими областями, она должна дать понятие о назначении этого пространства.

# disable_autocreate.description
source: If set, records are not automatically created as new versions when edited in the workspace. A new version must be manually created first.
ru: Если включено, при редактировании в рабочей области, автоматически не создаются новые версии этих записей. Сначала нужно создать новую версию вручную.

# file_mountpoints.description
source: Filemounts available for workspace users. Please see details for security information!
ru: Точки доступа к файлам, доступные для пользователей рабочей области. Ознакомьтесь с информацией по безопасности!

# file_mountpoints.details
source: IMPORTANT: By default a draft workspace has all filemounts disabled! This is because versioning does not apply to any files edited through filemounts in TYPO3. Hence any access to those files would violate the principle that no content managed in a draft workspace will be live before published. However, for specific projects this violation might be acceptable or necessary and therefore you can add a filemount. This will be forced upon any user in the workspace regardless of his filemounts inherited from his groups and user profile!
ru: ВАЖНО: по умолчанию в черномвом рабочем пространстве отключены точки доступа к файлам! Это сделано по причине неприменимости версионирования к любым файлам, редактируемым в TYPO3 через точки доступа. Поэтому любой подобный доступ к файлам нарушает принцип о публикации содержимого в оперативную рабочую область перед тем, как оно станет доступным на сайте. Однако, для определенных проектов, это нарушение возможно, и даже необходимо, ввиду этого возможно добавлять точки доступа к файловой системе. Это будет затрагивать всех пользователей данной рабочей области, независимо от наследуемых им точек доступа из пользовательских групп и профилей!

# freeze.description
source: If set, no editing is allowed inside workspace.
ru: Если включено, то редактирование внутри области запрещено.

# live_edit.description
source: If set, records from tables where versioning is not enabled can still be edited "live" inside the workspace.
ru: Если включено, то записи из таблиц не включенных в контроль версий все еще могут быть "оперативно" отредактированы внутри рабочей области.

# members.description
source: Members can be backend users or groups and will have access to work in the workspace. They cannot publish content (unless they have access to the Live workspace) but only edit it after which they will forward it for approval by a reviewer.
ru: В качестве рядовых пользователей в рабочей области могут состоять внутренние пользователи и их группы, имеющие доступ к работе в рабочей области. Они не могут публиковать содержимое (только если у них нет доступа к оперативной рабочей области), а только редактировать его, после чего должны передать на рассмотрение рецензенту.

# publish_access.description
source: Refines the rules of publishing
ru: Расширение правил публикации

# publish_access.details
source: "Publish only content in publish stage" : Only when content is in publish stage can it be published. "Only workspace owner can publish" : Only the workspace owner can publish the content in the workspace, even if members or reviewers have access to the Live workspace.
ru: "Publish only content in publish stage": публикация возможна, когда содержимое находиться на стадии публикации. "Only workspace owner can publish": возможность публикации имеется лишь у владельца рабочей области, даже если члены области или рецензенты имеют доступ к оперативной рабочей области.

# publish_time.description
source: Specify a time of publication of the workspace content.
ru: Определяет время публикации содержимого рабочей области.

# publish_time.details
source: The publish and unpublish times are active only if "mod/user/ws/cli/ws_cli.phpsh" is set up as a cronjob running every minute. Example configuration could be "* * * * * /[ABSOLUTE PATH TO TYPO3 SITE]/typo3/mod/user/ws/cli/ws_cli.phpsh"
ru: Время публикации и снятия публикации доступно только при установке "mod/user/ws/cli/ws_cli.phpsh" как задания cron срабатывающего ежеминутно. Пример настроек может быть таким "* * * * * /[ABSOLUTE PATH TO TYPO3 SITE]/typo3/mod/user/ws/cli/ws_cli.phpsh"

# reviewers.description
source: Content have to pass through reviewers approval before it can finally be published by a workspace owner. Reviewers can be backend users or groups and will have access to the workspace just as members have, but can in addition approve content for final publication.
ru: Содержимое должно быть одобрено рецензентом, после чего оно может быть окончательно опубликовано владельцем рабочей области. Рецензентами могут быть внутренние пользователи или их группы, имеющие доступ к рабочей области, как и рядовые пользователи, но в дополнение к этому, имеющие право одобрения содержимого для конечной публикации.

# reviewers.details
source: In case you need no review layer between editors (normally workspace "members") and the workspace owners what you simply do is to add all editors as reviewers. This give them access to raise content all the way to the workspace owners. Since content is by default raised from editing to review to publish state it even gives the possibility of informal "four-eye" review where workspace owners can require that content has been raised by action from two different reviewers.
ru: Если не требуется рецензирования содержимого и разделение на редакторов ("обычный пользователь" рабочей области) и владельцев, нужно просто наделить всех редакторов правами рецензентов. При этом они смогут сразу отправлять публикуемое содержимое напрямую владельцу рабочей области. Так как содержимое по умолчанию проходит стадию редактирования, затем рецензию и лишь после этого отправляется на публикацию, появляется даже возможность обзора "в четыре глаза", когда владелец рабочей области требует подтверждения от двух разных рецензентов.

# review_stage_edit.description
source: If set, records raised to Review stage can still be edited by workspace members. This allows late changes to be made while waiting for the review. Only when the stage is raised to Publish the record is completely locked for editing for members and reviewers.
ru: Если установлено, то записи, вошедшие в стадию рецензирования, все еще могут редактироваться членами рабочей области. Это разрешает позднее редактирование, в процессе ожидания рецензии. Записи окончательно блокируются для изменения как обычными членами области, так и рецензентами на стадии публикации.

# stagechg_notification.description
source: When the stage of content changes, users in the workspace can receive a notification by email. Only members/reviewers who are attached to the workspace as users and not through their groups will be notified.
ru: При изменении стадии публикации пользователи рабочей области могут получать сообщения через email. Сообщения отсылаются лишь членам/рецензентам, прикрепленным к рабочей области в качестве пользователей, а не через группы пользователей.

# stagechg_notification.details
source: "Notify users on next stage only": When content is raised from "Editing" to "Review", reviewers are notified. When content is raised to "Publish", owners are notified. When content is rejected, members and reviewers are notified. When content is raised from rejected state, members are notified. "Notify all users on any change" : All users in workspace are notified regardless of change.
ru: "Notify users on next stage only": когда публикация переходит из стадии "Редактирование" в стадию "Рецензирование", отсылается сообщение рецензентам. Когда материал переходит на стадию "Публикация", сообщение отсылается владельцу области. При отклонении публикации, об этом уведомляются рядовые члены и рецензенты. При переходе публикации из стадии отклонения, поступает уведомление для пользователей. "Notify all users on any change" : уведомляются все пользователи рабочей области, независимо от произошедших изменений.

# swap_modes.description
source: Defines modes for publishing as a "swap" action where the online content is moved into the workspace in exchange for the workspace content.
ru: Определяет режим публикации, как "обмен", когда текущее действующее содержимое перемещается в рабочую область, в обмен на ее содержимое.

# swap_modes.details
source: By default swapping is allowed. Thereby two versions can be published "in and out" of a workspace multiple times, always substituting each other. If this is not desired, it can be disabled with "Disable Swap-Into-Workspace". Another mode "Swap-Into-Workspace on Auto-publish" will force the automatic publishing through the cronjob to swap versions. This is necessary to use if you specify both a publish AND un-publish time because otherwise the workspace will be empty after the first publish action!
ru: По умолчанию обмен включен. При этом две версии могут несколько раз публиковаться, заменяя друг-друга. Если это не желательно, то такое поведение можно отключить через значение "Disable Swap-Into-Workspace". Другой режим "Swap-Into-Workspace on Auto-publish" включает автопубликацию через задание cron на обмен версий. При этом необходимо определить как время публикации, так И время снятия публикации, иначе, после первой публикации рабочее пространство окажется пустым!

# title.description
source: Enter the name of the workspace. This value is shown in the workspace selector box in the backend.
ru: Введите название рабочей области. Это значение будет отображаться в меню выбора рабочих областей внутреннего интерфейса.

# unpublish_time.description
source: Specify an additional time of (un)publication of the workspace content.
ru: Определите дополнительное время (снятия) публикации содержимого рабочей области.

# unpublish_time.details
source: By "additional" is meant that both publishing times are used in a similar way, but if "Publish" is specified it takes precedence over "Unpublish". Anyway, the point of two publishing times is that workspace content could be swapped in for a limited period and then out again. But notice; for this to work the Swap mode must be set to "Swap-Into-Workspace on Auto-publish".
ru: Под дополнительным подразумевается то, что оба времени для публикации используются схожим образом, но, если определено время "Опубликовать", оно имеет приоритет перед "Снять с публикацию". В любом случае, две этих точки означают то, что содержимое рабочей области может быть загружено на ограниченное время и затем перезагружено. Но помните, чтобы это работало, должен быть установлен Режим обмена "Swap-Into-Workspace on Auto-publish".

# vtypes.description
source: Select versioning types you want to disable for workspace editors/reviewers (admin users and owners are not limited).
ru: Выберете типы версионирования, которые нужно отключить для редакторов/рецензентов (пользователи-"администраторы" и владельцы не ограничиваются).

# vtypes.details
source: "Element" is the most common form of versioning where a single element is versionized solo. "Page" is a versioning type where a page record and child records from specified tables (like "Content Elements" and "Language Overlay Records") are copied along. This form is more complex but offers flexibility in terms of rearrangement of elements on the page. "Branch" versioning is where a page is versionized and all subpages and content is copied along. This can have quite heavy implications on data duplication and is recommended only in special circumstances. More information about versioning types can be read in "Inside TYPO3"
ru: "Element" наиболее общая форма версионирования, при которой создаются версии для каждого отдельного элемента. "Page" — тип управления версиями, при котором копируются запись страницы и дочерние записи из определенных таблиц (вроде "элементов содержимого" и "записи дополнительных языковых меток"). Это более сложная форма, но более гибкая для перестановки элементов на странице. "Branch" — при этом создаются копии не только страницы, но и всех ее подстраниц со всем их содержимым. Это очень сожный тип версионирования, ввиду дублирования записей, и он может быть рекомендован лишь в исключительных случаях. Дополнительную информацию о типах версионирования можно найти в "Inside TYPO3"
