Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_em.xlf
Languages: ru

# emconf_TSfiles.details
source: If the files ext_typoscript_constants.txt and/or ext_typoscript_setup.txt is found in the extension folder they are included in the hierarchy of all TypoScript templates in TYPO3 right after the inclusion of other static templates.
ru: Если в папке расширения найдены файлы ext_typoscript_constants.txt и/или ext_typoscript_setup.txt, они включаются в иерархию всех шаблонов TypoScript в TYPO3, сразу после включения остальных статических шаблонов.

# emconf_type.alttitle
source: Installation type
ru: Тип установки

# emconf_type.description
source: The type of the installation
ru: Тип установки

# emconf_type.details
source: The files for an extension are located in a folder named by the extension key. The location of this folder can be either inside typo3conf/ext/, typo3/ext/ or typo3/sysext/. The extension must be programmed so that it automatically detects where it is located and can work from all three locations. <b>Local location "typo3conf/ext/":</b> This is where to put extensions which are local for a particular TYPO3 installation. The typo3conf/ directory is always local, containing local configuration (eg. localconf.php), local modules etc. If you put an extension here it will be available for this TYPO3 installation only. This is a "per-database" way to install an extension. <b>Global location "typo3/ext/":</b> This is where to put extensions which are global for the TYPO3 source code on the web server. These extensions will be available for any TYPO3 installation sharing the source code. When you upgrade your TYPO3 source code you probably want to copy the typo3/ext/ directory from the former source to the new source, overriding the default directory. In this way all global extension you use will be installed inside the new sourcecode. After that you can always enter TYPO3 and upgrade the versions if needed. This is a "per-server" way to install an extension. <b>System location "typo3/sysext/":</b> This is system default extensions which cannot and should not be updated by the EM. They are distributed with the TYPO3 core. <b>Loading precedence</b> Local extensions take precedence which means that if an extension exists both in typo3conf/ext/ and typo3/ext/ the one in typo3conf/ext/ is loaded. Likewise global extension takes predence over system extensions. This means that extensions are loaded in the order of priority local-global-system. In effect you can therefore have, say, a "stable" version of an extension installed in the global dir (typo3/ext/) which is used by all your projects on a server sharing source code, but on a single experimental project you can import the same extension in a newer "experimental" version and for that particular project the locally available extension will be used instead.
ru: Файлы расширения помещаются в папку, названную по ключу расширения. Сама папка может располагаться внутри одного из каталогов: typo3conf/ext/, typo3/ext/ или typo3/sysext/. В расширении можно указать автоматическое распознание одного из этих трех мест назначения. <b>Локальное расположение "typo3conf/ext/":</b> помещение расширения для локальной установки системы TYPO3. Каталог typo3conf/ всегда описывает локальную установку, содержит ее настройки (например localconf.php), местные модули и т.п. Расширение, находящееся здесь, будет доступно только для текущей устновки системы TYPO3. Это путь установки "относительно базы данных". <b>Глобальное расположение "typo3/ext/":</b> при этом расширение помещается в папку с общим исходным кодом TYPO3 на сервере. Эти расширения будут доступны для любой установки TYPO3 с разделяемым исходным кодом. При обновлении исходного кода ядра TYPO3, нужно будет также скопировать директорию typo3/ext/ из предыдущего глобального источника в новый, с перезаписью файлов. Таким образом, все используемые глобальные расширения будут установлены внутри нового исходного кода ядра. После чего всегда, при необходимости, можно обновлять версию ядра TYPO3. Это установка расширений "относительно сервера". <b>Системное расположение "typo3/sysext/":</b> здесь расположнены расширения, идущие в составе системы, которые не должны обновляться через модуль управления расширениями. Они распространяются в составе ядра TYPO3. <b>Порядок загрузки</b> Локальные расширения имеют приоритет, это означает, что, если расширение имеется и в typo3conf/ext/и в typo3/ext/, то будет загружено расширение из typo3conf/ext/. Аналогично, глобальные расширение имеют приоритет над системными расширениями. Это значит, что расширения загружаются в порядке очередности локальнst-глобальные-системные. В следствие этого, можно, скажем, "стабильную" версию расширения устанавливать в глобальную директорию (typo3/ext/), она будет использоваться во всех проектах на сервере с разделяемым системным кодом, но в определенных, экспериментальных проектах можно установить локально "экспериментальную" версию, которая будет использоваться вместо глобальной в этих определенных проектах.

# import.alttitle
source: Importing Extensions
ru: Импортирование расширений

# import.description
source: This is the process of bringing the files of an extension to the servers filesystem. You can do this either by importing from a repository at a URL (usually from TER; TYPO3 Extension Repository at typo3.org) or by uploading a "t3x" file which someone else created from the Extension Manager on another server.
ru: Это процесс перенесения файлов расширения на сервер. Можно сделать это либо через импорт из репозитория по URL (обычно из TER; TYPO3 Extension Repository на typo3.org), либо через загрузку "t3x" файла, находящегося где-нибудь, и созданный в модуле управления расширениями на другом сервере.

# import.details
source: <b>Import from TER</b> To connect to the TER you simply click the button "Connect to online repository". This will request the URL shown in the text above the button and the URL should return a list of available extension you can import. If you know what you are looking for then enter a search word in the look-up box. In particular this helps you to look up a specific extension key. The connection to TER will be much faster if you use this since less data is sent over the wire! <b>Upload from file</b> For private projects the exchange of extensions is easily done by sending "t3x" files from system to system. In one TYPO3 installation you simply go to the menu "Backup/Delete" of an extension and download a "Backup" of the extension. The fileformat is a serialized PHP array, compressed if possible. This file can then be uploaded in the Extension Manager of another TYPO3 system where you want to import it.
ru: <b>Импорт из TER</b> Для соединения с TER, просто нажмите на кнопку "Connect to online repository". При этом будет отослан запрос на URL, показанный выше кнопки, после чего будет возвращен список доступных для импорта расширений. Если вы знаете, что ищете, введите нужный текст в поле поиска. Практически — это поиск по определенному ключу расширения. При этом соединение с TER будет проходить значительно быстрее, потому что будет передаваться меньше данных! <b>Загрузка файла</b> Для личных проектов расширений, легче пересылать "t3x" файлы с одной системы на другую. В одной системе TYPO3 нужно просто перейти в меню расширения "Backup/Delete" и скачать "резервную копию" расширения. Файловый формат сериализированный массив PHP, по возможности сжатый. Этот файл затем может быть загружен через модуль управления расширениями в другой системе TYPO3.

# import.image_descr
source: The "Import" screen. Before you connect to the online repository you might like to configure typo3.org username and password since that will be used to also select "Member" extensions in TER, if any. You can also enable "Get own/member/selected extensions only" if you want to limit the list further.
ru: Экран "импорт". Перед установкой соединения с сетевым репозиторием, скорее всего понадобится настроить имя пользователя и пароль на typo3.org, которые понадобятся для выбора расширений "Member" в TER. Также можно включить "Get own/member/selected extensions only" (получать лишь расширения для владельца/члена/выбранные) для ограничения их списка.

# import_ter.alttitle
source: Extensions in TER
ru: Расширения в TER

# import_ter.description
source: Extensions in this list are online for immediate download from the TYPO3 Extension Repository (TER). Extensions with dark background are those already on your server - the others must be imported from the repository to your server before you can use them. If you want to use an extension from the repository, you should simply click the "import" button with the red arrow left to the extension.
ru: Расширения в этом списке расположены в сети, для немедленной загрузки из TYPO3 Extension Repository (TER). Расширения с темным фоном — уже имеющиеся на сервере, остальные, перед использованием, нужно загрузить на сервер. Для использования расширений из репозитория, нужно просто щелкнуть по кнопке "импорт" с красной стрелкой, слева от расширения.

# import_ter.details
source: <b>Import Extensions</b> If an extension does not yet exist on your server you will see the icon with the red arrow next to that extension. A single click and the extension will be downloaded and the files extracted on your server. The download directory is seen if you move the mouse over the icon (in the tool-tip text). <b>Update Extensions</b> You can update extensions that are always on your system by clicking the icon with the green arrows. The update icon will appear if the "minor" version number (middle digit) has been incremented. This means that extensions updated on the dev-version number (the third digit) will not be shown as "ready for update". (You can configure TYPO3 to do that though!). <b>Seeing details about an extension in TER</b> You can also click the title of an extension to see details about it. That will also allow you to perform a more detailed update operation where you can select version number and download location (local/global/system). You can also ask to have the most recent translations downloaded.
ru: <b>Импортирование расширений</b> Если расширение еще не присутствует на вашем сервере, рядом с ним отображается красная стрелка. Щелкнув по ней, можно загрузить и распаковать его на свой сервер. Директория, в которую оно загружено, видна, если поместить мышку над значком (в сплывающей подсказке). <b>Обновление расширений</b> Обновить находящиеся в системе расширения можно, щелкнув по значку с зелеными стрелочками. Этот значок появляется, если будет обнаружена новая"незначительная" (изменения в средней цифре) версия. Это значит, что обновленные версии в стадии разработки расширения (третяя цифра версии) не будут показаны, как "готовые для обновления". (Хотя можно настроить TYPO3 и на их обновление!). <b>Просмотр детальной информации о расширениях в TER</b> Также можно, щелкнув по названия расширения, просмотреть детальную информацию о нем. Что, к тому же, позволит совершить более точное обновление, выбирая номер версии и месторасположение (local/global/system). Можно загрузить и последние переводы.

# import_ter.image_descr
source: List of extensions from TER. The red arrow icon is the "Import" link (for new extensions), the green arrow icon is the "Update" link (for an extension that is already on your server). If an extension is already available in the most recent version you will not see any icon at all to the left of the extension. If you clicked the title of an extension you will request the repository for details about the extension. This also allows you to select a specific version for import. You can also select the install location (global/local) and you can request to have the most recent translations merged into the extension upon retrieval.
ru: Список расширений из TER. Красные стрелки — это ссылки на "импортирование" (для новых расширений), значки с зелеными стрелочками — ссылки для "обновления" (для имеющихся на сервере расширений). Елси расширение уже имеется на сервере в самой новой версии, не будет показано никаких значков. Щелчком по заголовку расширения можно запросить детальную информацию о нем. При этом можно импортировать определенную его версию, а также выбрать место его установки (global/local) и запросить наиболее свежий перевод при его загрузке.

# info.alttitle
source: Extension Details
ru: Детальная информация о расширении

# info.description
source: Shows details about the extension.
ru: Выводится информация о расширении.

# info.details
source: In this view some of the details are simply a display of the information from the "ext_emconf.php" file in the extension. The "emconf" file contains meta data for the Extension Manager. The Extension Manager will also go a bit further and perform some analysis of the scripts in the extension. The list will include the findings of this analysis and if any errors were found they will be displayed. Usually these errors will not prevent the extension from working but more likely point out some theoretical problems that the extension developer should address.
ru: При этом отображается информация из файла "ext_emconf.php" расширения. Этот файл содержить дополнительную информацию для модуля управления расширениями. Правда модуль управления расширениями делает кое-что еще, анализируя сценании внутри расширения. В список будет включено резюме этого анализа, любые найденные ошибки. Обычно эти ошибки не приводят к краху расширения, но могут повлечь некоторые теоретические проблемы, о которых следует сообщить разработчику расширения.

# info.image_descr
source: The details view of an extension displays live statistics from analysis as well as static data from the "ext_emconf.php" file.
ru: Детальная информация содержит как живую статистику анализа, так и данные из файла "ext_emconf.php".

# loaded.alttitle
source: Loaded Extensions
ru: Загруженные расширения

# loaded.image_descr
source: The list of loaded extensions shown in the loading order.
ru: Список загруженных рассширений в порядке их загрузки.

# makenew.alttitle
source: Kickstarting new extensions
ru: Кикстартер для новых расширений

# makenew.description
source: The "Kickstarter" is an application which allows you to start up new extension work very quickly. Through an interface you can create a basic framework for your extension where all the boring stuff is configured from the beginning and you can concentrate directly on coding your application.
ru: "Kickstarter" — приложение, позовляющее очень быстро начинать разработку новых расширений. Оно предоставляет интерфейс для создания основную оболочку для своего расширения, позволяя избежать этой скучной работы и в основном сосредоточиться на написании кода для своего приложения.

# makenew.details
source: The Extension Repository Kickstarter is a separate extension, "extrep_wizard". Please see more information about the kickstarter otherwise. <b>Notice:</b> The Kickstarter is NOT an editor! When a new extension is started you cannot - as a rule of thumb - go back an edit it with the kickstarter! It will just overwrite any custom changes you did in the meantime!
ru: Extension Repository Kickstarter — отдельное расширение, "extrep_wizard". В любом случае, ознакомьтесь с информацией о нем. <b>Примечание:</b> Kickstarter НЕ редактор! Начав разработку нового расширения невозможно вернуться к его редактированию в кикстартере! Он просто перезапишет все сделанные вручную изменения!

# makenew.image_descr
source: When the "Extension Repository Kickstarter" is enabled it adds itself in the menu of the Extension Manager. From here you will be able to start your new extensions. Before you do so you should register an extension key and enter a title and description as base data. From that point it is just clicking the "+" icons to add the various types of functionality you want. Finally you click "View result" to write the extension to the server.
ru: При включении "Extension Repository Kickstarter", в меню модуля управления расширениями появляется новый пункт. Из него возможно начать разработку нового расширения. Перед этим нужно зарегистрировать ключ расширения и ввести его заголовок и описание в разделе основных данных. После этого нужно просто щелкать на значке "+" для добавления нужной функциональности. В конце нажимает "Посмотреть результат" для записи расширения на сервер.

# _.seeAlso
source: xMOD_csh_corebe, Core / Extension Architecture | https://docs.typo3.org/typo3cms/InsideTypo3Reference/ Managing Extensions | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Extensions/ManagingExtensions/
ru: xMOD_csh_corebe, Ядро / Архитектура расширения | https://docs.typo3.org/typo3cms/InsideTypo3Reference/ Управление расширениями | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/Extensions/ManagingExtensions/

# settings.alttitle
source: Extension Manager Settings
ru: Настройки управления расширениями

# settings.description
source: Enter settings for the Extension Manager. The username and password is for connections to the repository (usually TYPO3.org) and the upload password is that you would normally use for upload of your extensions.
ru: Введите настройки для модуля управления расширениями. Имя пользователя и пароль нужны для соединения с репозиторием (обычно TYPO3.org) и пароль для загрузки, который обычно используется для загрузки своих расширений.

# settings.details
source: <b>Notice:</b> This information is not very well protected! It is send and stored in clear-text!
ru: <b>Примечание:</b> Эта информация не защищена! Она отсылается и хранится в виде простого текста!

# settings.image_descr
source: Settings for TER connections.
ru: Настройки для соединений с TER.

# upload.alttitle
source: Upload an Extension to the repository (TER)
ru: Загрузка расширения в репозиторий (TER)

# upload.description
source: Here you can upload an extension to TER. In order to do so you must enter your TYPO3.org username and password in the form. In addition each extension has an upload password you need to add as well. You should also make sure you registered / own the extension key!
ru: Здесь возможно загрузить расширение в TER. Сначала для этого нужно ввести свое имя пользователя и пароль на TYPO3.org. К тому же, каждое расширение имеет свой пароль для загрузки, который тоже нужно указать. Также нужно убедиться, что вы зарегестрировали / владеете ключом расширения!

# upload.details
source: <b>Changelog</b> In the changelog field you enter the changes made or the reason for the upload. This will be displayed in the list of new extensions. <b>Version numbers</b> Select a method for incrementation of the version number. For new "versions" of your extension you should select "sub" or "main" which will display your extension in the list of new extensions. For maintenance uploads you select "dev".
ru: <b>Список изменений</b> В поле для списка изменений нужно ввести сделанные изменения или причину обновления. Это будет показано в списке новых расширений. <b>Номера версий</b> Выберите метод для приращения номера версии. Для новых "версий" своего расширения следует выбрать "sub" или "main", при этом расширение попадет в список новых расширений. Для технических загрузок выбирайте "dev".

# upload.image_descr
source: The upload form for extensions. The extension is submitted to the selected repository, usually TYPO3.org (default).
ru: Форма загрузки для расширений. Расширение помещается в выбранный репозиторий, обычно TYPO3.org (значение по умолчанию).
