Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_sysfilem.xlf
Languages: ru

# base.description
source: Determines whether the value of the PATH field is to be recognized as an absolute path on the server or a path relative to the fileadmin/ subfolder to the website.
ru: Определяет распознание значения ПУТЬ, как абсолютного пути на сервере, или относительно директроии сайта "fileadmin/".

# .description
source: Filemounts describe a filepath on the server, relative or absolute.
ru: Точки доступа описывают относительный или абсолютный путь к файлам на сервере.

# .details
source: By creating a file mount record and placing a reference to it in a Backend usergroup you can allow a user access to the file mount in the File>List module. Filemounts may also configure access to a path on the server to which the user has FTP-access. Just remember to set file-permissions on the server correctly so the webserver user (which PHP is running as) has at least read access to the FTP-dir. You can only mount absolute paths if they are within the base path set in $TYPO3_CONF_VARS[BE][lockRootPath]
ru: Создав запись для точки доступа к файлам и поместив ссылку на нее в группу внутренних пользователей, вы предоставляете пользователям доступ к файлам в этой точке файловой системы сервера через модуль Файл>Список. Точки монтирования можно также настроить для доступа к файловой системе сервера через FTP. Просто не забудьте выставить корректные права доступа на сервере, чтобы пользователь сервера (от которого выполняется PHP) имел хотя бы возможность чтения FTP директории. Возможно устанавливать абсолютные пути лишь в пределах основного пути, установленного в $TYPO3_CONF_VARS[BE][lockRootPath]

# hidden.description
source: Use this option to temporarily disable the filemount.
ru: Этот параметр используется для временного отключения точки доступа.

# hidden.details
source: All backend users using the mount will not have access anymore. This includes 'Admin'-users.
ru: При этом все внутренние пользователи потеряют доступ к этой точке файловой системы. Включая пользователей-"администраторов".

# path.description
source: Enter the path of the filemount, relative or absolute depending on the settings of BASE.
ru: Введите путь к точке доступа, относительный или абсолютный, в зависимости от БАЗОВЫХ настроек.

# path.details
source: If BASE is set to relative, the path mounted is found in the subfolder "fileadmin/" of the website. Then you should enter the subfolder in "fileadmin/" as path. For instance if you want to mount access to "fileadmin/user_uploads/all/" then enter the value "user_uploads/all" as the value of PATH. If BASE is absolute you should enter the absolute path on the server, eg. "/home/ftp_upload" or "C:/home/ftp_upload". Further you must make sure the configuration variable $TYPO3_CONF_VARS[BE][lockRootPath] contains the first part of the path you want to mount. <strong>Notice:</strong> In any case, make sure the webserver user which PHP is running as has <em>at least</em> read-access to the path. If not, the mount will simply not appear without any warnings. If you have problems - especially with absolute mounts - try to mount something "simple" like a relative path in fileadmin. If that is working well, try the absolute path. Your PHP-configuration may also impose other restrictions on you if open_basedir is enabled. Then use relative paths.
ru: Если установлена относительная БАЗА, путь к точке доступа находится в подпапке сайта "fileadmin/". При этом нужно указать в качестве пути подпапку в папке "fileadmin/". Например, если нужно установить доступ к "fileadmin/user_uploads/all/", значени ПУТИ должно быть "user_uploads/all". Если установлена абсолютная БАЗА, нужно вводить абсолютный путь на сервере, например "/home/ftp_upload" или "C:/home/ftp_upload". В любом случае, нужно убедиться, что переменная настроек $TYPO3_CONF_VARS[BE][lockRootPath] содержить первую часть устанавливаемого пути. <strong>Примечание:</strong> в любом случае, нужно убедиться, что пользователь сервера, от которого работает PHP, имеет <em>хотябы</em> доступ на чтение по этому пути. Если это не так, эта точка не будет доступна без вывода всяких предупреждений. При возникновении любых проблем, особенно с абсолютными путями в точках доступа, попытайтесь получить доступ к чему-нибудь попроще, например по относительному пути в директории "fileadmin". Если это сработает, попробуйте доступ по абсолютному пути. В PHP настройке могут присутствовать другие ограничения, если включены safe_mode или open_basedir. При этом используйте относительные пути.

# path.image_descr
source: This is a filemount relative to "fileadmin/". The mounted folder is "fileadmin/user_upload/" since "user_upload" is the value of the "Path" field. The directory structure of "fileadmin/" where you can see the "user_upload" folder in the bottom of the list.
ru: Это точка доступа по относительному пути к "fileadmin/". Доступ предоставляется к папке "fileadmin/user_upload/", так как в поле "Путь" введено значение "user_upload". Структура папок в директории "fileadmin/", где внизу списка находится папка "user_upload".

# _.seeAlso
source: be_groups:file_mountpoints, be_users:file_mountpoints, More about File mounts | https://docs.typo3.org/typo3cms/InsideTypo3Reference/CoreArchitecture/AccessControl/MoreAboutFileMounts/
ru: be_groups:file_mountpoints, be_users:file_mountpoints, More about File mounts | http://typo3.org/documentation/document-library/doc_core_inside/More_about_File_Moun/

# title.description
source: Enter a title for the filemount. The title will appear as the name of the file mount when it is applied to users and groups.
ru: Введите название точки доступа к файлам. Это название будет использоваться как название точки доступа к файлам, в отношении пользователей и их групп.
