Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_csh_em.xlf
Languages: ru

# .alttitle
source: Tools > Extension Manager (EM)
ru: Сервис управления > Расширения (EM)

# avail.alttitle
source: Available Extensions
ru: Доступные расширения

# avail.description
source: Available extensions are extensions which are present in the extension folders. You can install any of the available extensions in this list. When you install an extension it will be loaded by TYPO3 from that moment. In this list the extensions with dark background are installed (loaded) - the others just available (not loaded), ready to be installed on your request.
ru: Доступные расширения — те, что присутствуют в папках для расширений. Можно установить любые доступные в этом списке расширения. Как только расширение будет установлено, оно будет загружено TYPO3. Расширения на темном фоне в этом списке — установлены (загружены), а остальные — просто доступны (не загружены) и готовы к установке.

# avail.details
source: You can install an extension by clicking the gray "+" icon in this list. If you want to de-install an extension you click the green "-" icon. When you click the install button ("+") you will most often end in a dialog where you have to confirm the creation of database tables and fields or maybe you will be asked to "clear all cache". The Extension Manager automatically handles these requirements for you which makes it extremely easy to install new extensions.
ru: Установить расширение можно, щелкнув по серому значку "+" в списке. Для удаления расширения, щелкните по зеленому значку "-". Наиболее часто, после щелчка по значку установки ("+"), появляется диалог, в котором нужно подтвердить создание таблиц и полей в базе данных, или, возможно, запрос на "очистку всех кешей". Модуль управления расширениями автоматически выполняет все эти требования, делая их установку предельно простой.

# avail.image_descr
source: The list of available extension on the server. The list is compiled from extensions found in the "local", "global" and "system" extension folders. If you click the install icon ("+") of an extension you might end in a dialog like this. In this case a new database table is required. The Extension Manager will automatically detect that it does not exist yet and suggest that you create it. The creation automatically takes place as well, simply by accepting the changes when pressing "Make updates".
ru: Список доступных на сервере расширений. Список формируется из расширений, найденных в "локальных", "глобальных" и "системных" папках для расширений. Щелкнув по значку установки расшрирений ("+"), можно вызвать подобный диалог. Здесь требуется создание новой таблицы. Модуль управления расширениями автоматически определяет, что таблица еще не создана, и просит подтвердить ее создание. Сами таблицы создаются автоматически, при нажатии на кнопку "Make updates".

# backup_delete.alttitle
source: Backup Extension as a file
ru: Создание файла резервной копии расширения

# backup_delete.description
source: Click the "Download" link here and you will download the extension as a file containing a serialized PHP array, a hash and everything possibly compressed if the server supports it. Save the file with a filename ending on "t3x".
ru: Щелкните по ссылке "скачать" для закачки расширения в виде файла, содержащего сериализированный массив PHP, хеш, по возможности сжатый (если сервер это поддерживает). Сохраните файл, дав название с расширением "t3x".

# backup_delete.image_descr
source: "Backup" of extensions - also very useful for exchange of extensions between members of a workgroup.
ru: "Резервирование" расширений очень полезно для обмена расширениями между членами рабочей группы.

# .description
source: The Extension Manager controls import, installation and upgrading of Extensions in TYPO3.
ru: Через модуль управления расширениями возможно импортировать, устанавливать и обновлять расширения в TYPO3.

# .details
source: TYPO3 can be extended in nearly any direction without loosing backwards compatibility. The Extension API provides a powerful framework for easily adding, removing, installing and developing such extensions to TYPO3. This is in particular powered by the Extension Manager (EM) inside TYPO3. "Extensions" is a term in TYPO3 which covers two other terms, plugins and modules. A plugin is something that plays a role on the website itself. For example a board, guestbook, shop etc. It is normally enclosed in a PHP class and invoked through a USER or USER_INT cObject from TypoScript. A plugin is an extension in the frontend. A module is a backend application which has it's own position in the administration menu. It requires backend login and works inside the framework of the backend. We might also call something a module if it exploits any connectivity of an existing module, that is if it simply adds itself to the function menu of existing modules. A module is an extension in the backend.
ru: Функциональность TYPO3 может быть расширена практически безгранично, с сохранением полной совместимости. API для расширений предоставляет хорошую базу для легкого добавления, удаления, установки и разработки разнообразных расширений для TYPO3. Практически все это реализуется через модуль управления расширениями (EM) внутри TYPO3. "Расширения", как термин TYPO3, включает два других термина — дополнения и модули. Дополнение - это что-то, выполняющее определенную функцию на самом сайте. Например журнал, гостевая книга, магазин и т.п. Они обычно включаются в класс PHP и вызываются через USER или USER_INT cObject через TypoScript. Дополнение — это расширение внешнего интерфейса. Модуль — это внутреннее приложение, занимающее определенную позицию в меню управления. Для работы с ним требуется зарегистрироваться во внутреннем интерфейсе. Модулем можно назвать нечто, использующее связи с существующем модулем и просто добавляющее себя в меню существующих модулей. Таким образом, модуль — это расширение внутреннего интерфейса.

# editfiles.alttitle
source: Editing scripts in an extension
ru: Редактирование сценариев в расширении

# editfiles.description
source: The Extension Manager can be used for editing scripts in extensions. This feature is mostly for emergencies since a webbrowser is not the ideal tool for programming.
ru: Модуль управления расширениями может использоваться для редактирования сценариев в расширениях. Эта возможность предусмотрена для чрезвычайных ситуаций, так как браузеры все еще не идеальны.

# editfiles.details
source: <b>Notice:</b> Before editing of extension scripts can be performed you have to disable the configuration option "TYPO3_CONF_VARS[EXT][noEdit]" in "localconf.php".
ru: <b>Примечание:</b> Перед редактированием сценариев в расширении, нужно отключить параметра в настройках "TYPO3_CONF_VARS[EXT][noEdit]" в "localconf.php".

# editfiles.image_descr
source: Some file types - like PHP scripts - can be edited by a textarea field inside the Extension Manager.
ru: Некоторые типы файлов, вроде сценариев PHP, могут быть отредактированы в текстовом поле внутри модуля управления расширениями.

# emconf_category.alttitle
source: Category
ru: Категория

# emconf_category.description
source: Which category the extension belongs to.
ru: К какой категории относится расширение.

# emconf_category.details
source: <b>be:</b> Backend (Generally backend oriented, but not a module) <b>module:</b> Backend modules (When something is a module or connects with one) <b>fe:</b> Frontend (Generally frontend oriented, but not a "true" plugin) <b>plugin:</b> Frontend plugins (Plugins inserted as a "Insert Plugin" content element) <b>misc:</b> Miscellaneous stuff (Where not easily placed elsewhere) <b>services:</b> Contains TYPO3 services. <b>templates:</b> Contains website templates <b>doc:</b> Documentation (Eg. tutorials, FAQ's etc.) <b>example:</b> Example extension (Which serves as examples etc.)
ru: <b>be:</b> Backend (в основном предназначено для внутреннего интерфейса, но не модуль) <b>модуль:</b> Backend modules (если это модуль или часть одного из них) <b>внешний интерфейс:</b> Frontend (в основном предназначено для внешнего интерфейса, но не совсем его расширение) <b>расширение:</b> Frontend plugins (расширения, которые вставляются в элементы содержимого, через пункт меню "вставить расширение") <b>разное:</b> Miscellaneous stuff (что-то другое) <b>services:</b> содержит сервисы TYPO3. <b>templates:</b> содержит шаблоны сайтов. <b>doc:</b> документация (например руководства, ЧаВо и т.п.) <b>example:</b> примеры расширений (то, что служит примером и т.п.)

# emconf_classNames.alttitle
source: PHP Class names
ru: Назыания PHP классов

# emconf_classNames.description
source: Shows which PHP-classes were found in .php and .inc files.
ru: Выводятся названия, найденных в файлах .php и .inc, PHP классов.

# emconf_clearCacheOnLoad.alttitle
source: Clear cache when installed
ru: Очистка кеша после установки

# emconf_clearCacheOnLoad.description
source: If set, the EM will request the cache to be cleared when this extension is installed.
ru: Если включено, модуль управления расширениями отправит запрос на очистку кешей после установки расширения.

# emconf_conf.description
source: Shows if the extension has a template for further lowlevel configuration.
ru: Выводится, если расширение имеет шаблон для дальнейшей низкоуровневой настройки.

# emconf_conflicts.alttitle
source: Conflicts with other extensions?
ru: Конфликт с другими расширениями

# emconf_conflicts.description
source: List of extension keys of extensions with which this extension does not work (and so cannot be enabled before those other extensions are un-installed)
ru: Список ключей расширений, с которыми это расширение не будет работать (и не будет установлено, если эти расширения не удалить).

# emconf_dbReq.alttitle
source: Database requirements
ru: Требования к базе данных

# emconf_dbReq.description
source: Shows you the requirements to the database tables and fields, if any.
ru: Если есть, показаны требования к таблицам и полям базы данных.

# emconf_dbReq.details
source: This will read from the files ext_tables.sql and ext_tables_static+adt.sql and show you which tables, fields and static tables are required with this extension.
ru: Информация считывается из файлов ext_tables.sql и ext_tables_static+adt.sql, после чего выводятся таблицы, поля и статические таблицы, нужные для этого расширения.

# emconf_dbStatus.alttitle
source: Database requirements status
ru: Статус требований к базе данных

# emconf_dbStatus.description
source: Displays the current status of the database compared to the extension requirements.
ru: Выводится текущий статус выполнения требований к базе данных.

# emconf_dbStatus.details
source: If the extension is loaded which will display and error message if some tables or fields are not present in the database as they should be!
ru: Если расширение загружено и выводятся сообщения об ошибках, это значит, что некоторых необходимых полей или таблиц нет в базе данных!

# emconf_dependencies.alttitle
source: Dependencies of other extensions?
ru: Зависимость от других расширений.

# emconf_dependencies.description
source: This is a list of other extension keys which this extension depends on being loaded BEFORE it self.
ru: Это список ключей расширений, от которых зависит это расширение и которые должны загружаться ПЕРЕД ним.

# emconf_doNotLoadInFE.alttitle
source: Load in frontend
ru: Загрузить во внешний интерфейс

# emconf_doNotLoadInFE.description
source: "Yes" (default) will load the extension in the frontend and the backend. "No": the extension is loaded only in the backend.
ru: "Да" (по умолчанию), расширение будет загружено во внешний и внутренний интерфейс. "Нет" – расширение будет загружено только во внутренний интерфейс.

# emconf_doNotLoadInFE.details
source: Some extensions are only required in the backend. With this flag set, this extension is not loaded in the frontend context, thus speeding up the site.
ru: Некоторые расширения требуются лишь во внутреннем интерфейсе. Установив этот флаг, можно не загружать такие расширения не загружаются в контексте внешнего интерфейса, что ускорит сайт.

# emconf_doubleInstall.alttitle
source: Installed twice or more?
ru: Дублирование установки.

# emconf_doubleInstall.description
source: Tells you if the extensions is installed in more than one of the System, Global or Local locations.
ru: Говорит о дублирующих установках расширения в системном, глобальном или локальном местоположениях.

# emconf_doubleInstall.details
source: Because an extension can reside at three locations, System, Global and Local, this indicates if the extension is found in other locations than the current. In that case you should be aware which one of the extensions is loaded!
ru: Так как расширения могут быть установлены в три места: системное, глобальное и локальное, здесь будет показано, имеется ли расширение в других местоположениях, кроме текущего. В этом случае следует знать, какое из них загружено!

# emconf_download_password.alttitle
source: Download password
ru: Пароль на загрузку

# emconf_download_password.description
source: Additional password required for download of private extensions.
ru: Дополнительный пароль, требуемый для загрузки приватных расширений.

# emconf_download_password.details
source: Anybody who knows the "special key" assigned to the private upload will be able to import it. Specifying an import password allows you to give away the download key for private uploads and also require a password given in addition. The password can be changed later on.
ru: Любой, знающий "специальный ключ", связанный с приватной загрузкой может ее импортировать. Определение пароля для импорта позволяет давать его для закрытых загрузок в дополнение к приватному ключу. Позже пароль всегда можно изменить.

# emconf_errors.alttitle
source: Errors
ru: Ошибки

# emconf_errors.description
source: Displays if any errors with the extension were discovered.
ru: Выводятся любые обнаруженные в расширении ошибки.

# emconf_flags.alttitle
source: Flags
ru: Флаги

# emconf_flags.description
source: A list of special codes which tells you something about what parts of TYPO3 the extension touches.
ru: Список специальных кодов, говорящий нечно о том, какие части TYPO3 затрагивает расширение.

# emconf_flags.details
source: This is a list of the flags: <b>Module:</b> A true backend main/sub module is found to be added. <b>Module+:</b> The extension adds itself to the function menu of an existing backend module. <b>TCA:</b> The extension contains configuration of a table in $TCA. <b>Plugin:</b> The extension adds a frontend plugin to the plugin list in Content Element type "Insert Plugin". <b>Plugin/ST43:</b> TypoScript rendering code for the plugin is added to the static template "Content (default)". "Plugin" and "Plugin/ST43" are commonly used together. <b>Page-TSconfig:</b> Default Page-TSconfig is added. <b>User-TSconfig:</b> Default User-TSconfig is added. <b>TS/Setup:</b> Default TypoScript Setup is added. <b>TS/Constants:</b> Default TypoScript Constants is added.
ru: Вот список флагов: <b>Module:</b> найден для добавления основной/подмодуль. <b>Module+:</b> расширение добавляется в меню функция существующего внутреннего модуля. <b>TCA:</b> расширение содержит настройку таблиц в $TCA. <b>Plugin:</b> расширение добавляет внешнее дополнение к списку дополнений в элементы содержимого типа "вставить расширение". <b>Plugin/ST43:</b> TypoScript код, представляющий расширение, добавляется к статическим шаблонам "Content (default)". "Plugin" и "Plugin/ST43" обычно используются вместе. <b>Page-TSconfig:</b> По умолчанию добавляет в TypoScript страницы. <b>User-TSconfig:</b> По умолчанию добавляет в TypoScript пользователя. <b>TS/Setup:</b> По умолчанию добавляет в TypoScript Setup. <b>TS/Constants:</b> По умолчанию добавляет в TypoScript константы.

# emconf_internal.alttitle
source: Internally supported in core
ru: Внутренняя поддержка ядра

# emconf_internal.description
source: This flag indicates that the core source code is specifically aware of the extension.
ru: Этот флаг указывает, что ядро системы знает об этом расширении.

# emconf_internal.details
source: In other words this flag should convey the message that "this extension could not be written without some core source code modifications". An extension is not internal just because it uses TYPO3 general classes eg. those from t3lib/. True non-internal extensions are characterized by the fact that they could be written without making core source code changes, but relies only on existing classes in TYPO3 and/or other extensions, plus its own scripts in the extension folder.
ru: Другими словами, этот флаг должен вывести сообщение о том, что "это расширение не может быть записано без некоторых модификаций исходного кода ядра". Расширение не является внутренним только, потому что оно использует общие классы TYPO3, например t3lib/. Настоящие не внутренние расширения характеризуются тем, что они могли быть написаны, без изменения исходного кода ядра, но полагаются только на существующиев TYPO3 классы и/или других расширениях, плюс собственные сценарии в папке расширения.

# emconf_locallang.alttitle
source: locallang-files
ru: locallang-файлы

# emconf_modify_tables.alttitle
source: Existing tables modified
ru: Изменение существующих таблиц

# emconf_modify_tables.description
source: List of tablenames which are only modified - not fully created - by this extension.
ru: Список названий таблиц, которые будут изменены, а не заново созданы этим расширением.

# emconf_modify_tables.details
source: Tables from this list found in the ext_tables.sql file of the extension
ru: Таблицы из этого списка находятся в файле ext_tables.sql расширения.

# emconf_module.alttitle
source: Backend modules included
ru: Включенные внутренние модули

# emconf_module.description
source: If any subfolders to an extension contains backend modules, those foldernames should be listed here.
ru: Если какие-либо подпапки расширения содержат внутренние модули, названия этих папок должны быть перечислены здесь.

# emconf_module.details
source: It allows the EM to know about the existence of the module, which is important because the EM has to update the conf.php file of the module in order to set the correct TYPO3_MOD_PATH constant.
ru: Это позволяет модулю управления расширениями знать о существовании модуля. Это важно, так как он должен обновить файл conf.php модуля, если установлена правильная константа TYPO3_MOD_PATH.

# emconf_moduleNames.alttitle
source: Backend Module names
ru: Названия внутренних модулей

# emconf_moduleNames.description
source: Shows which module names were found inside the extension.
ru: Выводятся названия найденных внутри расширения модулей.

# emconf_NSerrors.alttitle
source: Namespace errors
ru: Ошибки, связанные с пробелами, использующимися в названиях

# emconf_NSerrors.description
source: Certain naming convensions apply to extensions. This displays any violations found.
ru: Определенные правила составления названий применимы и к расширениям. Здесь отображаются любые найденные в названиях ошибки.

# emconf_NSerrors.details
source: The naming convensions are defined in the "Inside TYPO3" document. To make naming as simple as possible, try to avoid underscores in your extension keys.
ru: Правила составления названий приведены в документе "Inside TYPO3". Старайтесь делать названия проще и использовать подчеркивания в ключах расширений.

# emconf_priority.alttitle
source: Requested Loading priority
ru: Запрос приоритета загрузки

# emconf_priority.description
source: This tells the EM to try to put the extensions as the very first in the list. Default is last.
ru: Посылается запрос к модулю управления расширениями на начальную загрузку данного расширения. По умолчанию загружается в конце.

# emconf_private.alttitle
source: Private
ru: Приватно

# emconf_private.description
source: If set, this version is not shown in the public list in the online repository.
ru: Если включено, эта версия не будет показана в общем списке сетевого репозитория.

# emconf_private.details
source: "Private" uploads requires you to manually enter a special key (which will be shown to you after an upload has been completed) to be able to import and view details for the uploaded extension. This is nice when you are working on something internally which you do not want others to look at. You can set and clear the private flag every time you upload your extension.
ru: "Приватное" обновление требует ввода специального ключа (который будет показан после завершения загрузки) для импорта и просмотра деталей загружаемого расширения. Это удобно при совместной работе с кем-либо, когда не нужены посторонние. Этот флаг можно включить или выключить в любое время при загрузке расширения.

# emconf_rootfiles.alttitle
source: Root files
ru: Корневые файлы

# emconf_rootfiles.description
source: List of the files in the extension folder. Does not list files in subfolders.
ru: Список файлов в папке расширения. Файлы в подпапках не показаны.

# emconf_shy.description
source: If set, the extension will normally be hidden in the EM because it might be a default extension or otherwise something which is not so important.
ru: Если включено, расширения будут скрыты в EM, так как это расширения, установленные по умолчанию или не столь важные.

# emconf_shy.details
source: Use this flag if an extension is of "rare interest" (which is not the same as un-important - just an extension not sought for very often...) It does not affect whether or not it's enabled. Only display in EM. Normally "shy" is set for all extensions loaded by default according to TYPO3_CONF_VARS.
ru: Используйте этот флаг, если расширение "не представляет интереса" (не путать с неважным — просто о расширении не столь часто вспоминают). Это не отражается на доступности расширения. Просто на отображении в EM. Обычно "shy" устанавливается для всех расширений, загружаемых по умолчанию, в соответствие с TYPO3_CONF_VARS.

# emconf_state.alttitle
source: Development state
ru: Состояние разработки

# emconf_state.description
source: Which development state the extension is in.
ru: В какой стадии находится разработка расширения.

# emconf_state.details
source: <b>alpha</b> Very initial development. May do nothing at all. <b>beta</b> Under current development. Should work partly but is not finished yet. <b>stable</b> Stable and used in production. <b>experimental</b> Nobody knows if this is going anywhere yet... Maybe still just an idea. <b>test</b> Test extension, demonstrates concepts etc.
ru: <b>alpha</b> Самое начало разработки. Почти ничего еще не сделано. <b>beta</b> Ведется разработка. Должно частично работать, но разработка еще не закончена. <b>stable</b> Устойчивая работа, можно использовать в работе. <b>experimental</b> Никто не знает, заработает ли это где-нибудь еще... Возможно это просо идея. <b>test</b> Расширение для тестирования, демонстрация идеи и т.п.

# emconf_suggests.alttitle
source: Suggested extensions
ru: Предлагаемые расширения

# emconf_suggests.description
source: List of extension keys of extensions which you may want to try in conjunction with this extension because they bring added benefits when working together.
ru: Список ключей расширений, которые предлагаются в дополнение к этому расширению, так как они приносят преимущества или расширяют его функциональность.

# emconf_TSfiles.alttitle
source: Static TypoScript files
ru: Статические TypoScript файлы

# emconf_TSfiles.description
source: Shows which TypoScript static files may be present
ru: Выводится, если имеются статические TypoScript файлы
