Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_misc.xlf
Languages: ru

# 1_selectType
source: 1: Select type of content element:
ru: 1: Выберете тип элемента содержимого:

source: 2: Select position:
ru: 2: Выберите позицию:

# bookmark_active
source: active
ru: активна

# bookmark_all
source: All
ru: Все

# bookmark_close
source: Close bookmark editor
ru: Закрыть редактор закладок

# bookmark_create
source: Create
ru: Создать

# bookmark_delAllInCat
source: Delete all bookmarks in this group
ru: Удалить все закладки из текущей группы

# bookmark_delete
source: Remove bookmark
ru: Удалить закладку

# bookmarkDescription
source: This is the bookmarks menu. You do not have any bookmarks added yet, you can do so by clicking the bookmark icon %icon%, which you can find on each page in the backend.
ru: Это меню закладок. У вас еще нет ни одной закладки, добавлять их можно, щелкнув по значку %icon%, имеющемся на каждой странице внутреннего интерфейса.

# bookmark_edit
source: Edit
ru: Правка

# bookmark_editID
source: Edit/Search
ru: Правка/поиск

# bookmark_FEPreview
source: Enable Frontend Preview
ru: Включить предпросмотр внешнего интерфейса

# bookmark_global
source: Global
ru: Общие

# bookmark_group
source: Group
ru: Группа

# bookmark_group_1
source: Pages
ru: Страницы

# bookmark_group_2
source: Records
ru: Записи

# bookmark_group_3
source: Files
ru: Файлы

# bookmark_group_4
source: Tools
ru: Инструменты

# bookmark_group_5
source: Miscellaneous
ru: Разное

# bookmark_inactive
source: inactive
ru: не активна

# bookmark_loadEdit
source: Loading page
ru: Загрузка страницы

# bookmark_notEditable
source: No editable page found!
ru: Не найдено доступных для редактирования страниц!

# bookmark_noWSfound
source: ERROR: No workspaces found!
ru: ОШИБКА: области не найдены!

# bookmark_offlineWS
source: Draft workspace
ru: Черновая область

# bookmark_onlineWS
source: LIVE workspace
ru: ОПЕРАТИВНАЯ область

# bookmark_onlyAdmin
source: You cannot edit a shared bookmark!
ru: Невозможно править общедоступные закладки!

# bookmark_save
source: Update bookmark title
ru: Обновить название закладки

# bookmark_saveClose
source: Update and close editor
ru: Обновить и закрыть редактор

# bookmark_searchFor
source: Search for:
ru: Поиск:

# bookmark_selSC
source: Select bookmark
ru: Выбрать закладку

# bookmark_workspace
source: Go to Workspace Module
ru: Перейти в модуль рабочих областей

# bookmark_workspaceComparisonView
source: Enable comparison view
ru: Включить режим сравнения

# clickForWizard
source: Click here for wizard!
ru: Нажмите здесь для вызова мастера!

# CM_db_list
source: Web>List module
ru: Модуль Веб>Список

# CM_editAccess
source: Visibility settings
ru: Настройка видимости

# CM_editPageProperties
source: Edit page properties
ru: Свойства страницы

# CM_history
source: History/Undo
ru: История/Отмена

# CM_moveWizard
source: Move element
ru: Переместить элемент

# CM_moveWizard_page
source: Move page
ru: Переместить страницу

# CM_newWizard
source: 'Create New' wizard
ru: Мастер создания нового

# CM_perms
source: Access
ru: Доступ

source: Copy elements
ru: Копировать элементы

# createNewContent
source: Create a new content element
ru: Создать новый элемент содержимого

# createNewPage
source: Create a new page
ru: Создать новую страницу

# extDirect_timeoutHeader
source: Connection Problem
ru: Проблемы с подключением

# extDirect_timeoutMessage
source: Sorry, but an error occurred while connecting to the server. Please check your network connection.
ru: Извините, но при подключении к серверу возникла ошибка. Пожалуйста, проверьте свое сетевое подключение.

# fileMetaDataLocation
source: Location
ru: Расположение:

# fileMetaErrorInvalidRecord
source: File meta data not found
ru: Мета-данные файла не найдены

# fileUpload_allError401
source: The server returned the status code 401, which is related to a .htaccess file used for password protection on your server. Unfortunately this can not be handled by your browser's Flash plugin.
ru: Сервер вернул код состояния 401, относящийся к файлу .htaccess, использующегося для защиты сервера паролем. К сожалению, при этом невозможно использовать flash расширение Вашего браузера.

# fileUpload_allErrorMessageText
source: All of your uploads failed.<br /><br />If this problem persists, please try another browser, contact your administrator or disable this "Flash Uploader" in your User Settings.<br /><br />Detailed problem description:<br />
ru: Ошибка для всех загрузок.<br /><br />Если ошибка повторяется, попробуйте использовать другой браузер, сообщите об этом администратору или отключите "Загрузчик Flash" в персональных настройках.<br /><br />Детальное описание проблемы:<br />

# fileUpload_allErrorMessageTitle
source: All uploads failed
ru: Ошибка для всех загрузок

# fileUpload_buttonCancelAll
source: Cancel All Uploads
ru: Отменить все загрузки

# fileUpload_buttonSelectFiles
source: Select Files
ru: Выбор файлов

# fileUpload_errorQueueFileSizeLimit
source: {0} is too big
ru: {0} слишком большой

# fileUpload_errorQueueInvalidFiletype
source: Filetype not allowed for {0}
ru: Типы файлов запрещены {0}

# fileUpload_errorQueueLimitExceeded
source: Too many files selected
ru: Выбрано слишком много файлов

# fileUpload_errorQueueZeroByteFile
source: {0} is empty
ru: {0} пустой

# fileUpload_errorUploadFailed
source: Upload failed
ru: Загрузка неудачна

# fileUpload_errorUploadFileCancelled
source: Upload of {0} canceled
ru: Загрузка {0} отменена

# fileUpload_errorUploadFileIDNotFound
source: Internal error: File ID not found
ru: Внутренняя ошибка: файл с ID не найден

# fileUpload_errorUploadFileValidation
source: Internal error while validating the file
ru: Внутренняя ошибка при проверке файла

# fileUpload_errorUploadHttp
source: Too many files selected
ru: Выбрано слишком много файлов

# fileUpload_errorUploadHttpError
source: A HTTP error occurred: {0}
ru: Произошла ошибка HTTP: {0}

# fileUpload_errorUploadIO
source: Internal error: Problems while reading/writing the file
ru: Внутренняя ошибка: проблема чтения/записи файла

# fileUpload_errorUploadLimit
source: Upload limit exceeded
ru: Достигнут предел для загрузки

# fileUpload_errorUploadMissingUrl
source: Internal error: No Upload URL set
ru: Внутренняя ошибка: не установлен URL для загрузки

# fileUpload_errorUploadSecurityError
source: Internal error: {0}
ru: Внутренняя ошибка: {0}

# fileUpload_errorUploadStopped
source: Upload of {0} stopped
ru: Загрузка {0} остановлена

# fileUpload_infoComponentFileTypeLimit
source: You can upload the following file types {0}.
ru: Можно загружать файлы следующих типов {0}.

# fileUpload_infoComponentFileUploadLimit
source: You can upload a total of {0}.
ru: Можно загружать всего {0}.

# fileUpload_infoComponentMaxFileSize
source: You can upload files with a maximum size of {0}.
ru: Можно загружать файлы с максимальным размером {0}.

# fileUpload_infoComponentOverrideFiles
source: Overwrite existing files
ru: Перезаписать существующие файлы.

# fileUpload_processRunning
source: Another process is already uploading
ru: Другой процесс в настоящее время загружает файлы.

# fileUpload_uploadProgress
source: {0}% of {1} uploaded
ru: Загружено {0}% из {1}

# fileUpload_uploadStarting
source: Starting upload of {0}
ru: Начало загрузки {0}.

# fileUpload_uploadSuccess
source: {0} was successfully uploaded!
ru: {0} было успешно загружено!

# fileUpload_uploadWait
source: Waiting to start upload of {0}
ru: Ожидание начала загрузки {0}.

# fileUpload_windowTitle
source: File Upload Progress
ru: Прогресс загрузки файла

source: Go back
ru: Вернуться назад

# insertNewPageHere
source: Insert the new page here
ru: Вставить новую страницу сюда

source: Insert new record here
ru: Вставить новую запись сюда

# liveSearch_emptyText
source: Enter search term
ru: Введите искомую фразу

# liveSearch_helpDescription
source: Search in certain tables:
ru: Поиск в определенных таблицах:

# liveSearch_helpDescriptionPages
source: #page:Home will search for all pages with the title "Home"
ru: #page:Дом - будет произведен поиск всех страниц с заголовком "Дом"

# liveSearch_helpTitle
source: How to use advanced search tags
ru: Как использовать дополнительные теги для поиска

# liveSearch_listEmptyText
source: No results found.
ru: Поиск не дал результатов.

# liveSearch_loadingText
source: Searching...
ru: Поиск...

# liveSearch_showAllResults
source: Show All
ru: Показать все

# liveSearch_title
source: Short result list
ru: Краткий список результатов

source: Localize
ru: Перевести

source: Localize all records
ru: Перевести все записи

# localize.isLocalizable
source: Record can be localized
ru: Запись может быть переведена

# localizeMergeIfNotBlank
source: The value of the default language will be used if this field is left empty in the translation.
ru: Если это поле оставить в переводе пустым, то будет использовано значение из языка по умолчанию.

# localize.wasRemovedInOriginal
source: Record was removed in original language
ru: Запись на исходном языке была удалена

# makeCopy
source: Make copy instead of moving element
ru: Копирование элементов вместо их перемещения

source: Move element
ru: Переместить элемент

source: Move elements
ru: Переместить элементы

# movePageToHere
source: Move page to this position
ru: Переместить страницу на эту позицию

# movingElement
source: Move element
ru: Переместить элемент

source: New content element
ru: Новый элемент содержимого

# noEditPage
source: You asked to edit page "%s" but you cannot edit this page. Now loading backend as usual.
ru: Запрошено редактирование страницы "%s", но вы не можете редактировать эту страницу. Система загружается в обычном режиме.

source: Overwrite existing files
ru: Перезаписать существующие файлы

source: Page (select position)
ru: Страница (выбор позиции)

# pageTree_filter
source: Filter
ru: Фильтр

# selectPosition
source: Select a position for the new page
ru: Выбрать позицию для новой страницы

# selectPositionOfElement
source: Select position of the element
ru: Выбрать позицию для элемента

# shortcut_active
source: active
ru: активна

# shortcut_all
source: All
ru: Все

# shortcut_close
source: Close shortcut editor
ru: Закрыть редактор ссылок

# shortcut_create
source: Create
ru: Создание

# shortcut_delAllInCat
source: Delete all shortcuts in this group?
ru: Удалить все ссылки в этой группе?

# shortcut_delete
source: Remove shortcut
ru: Удалить указатель

# shortcutDescription
source: This is the shortcuts menu. You do not have any shortcuts added yet, you can do so by clicking the shortcut icon %icon%, which you can find on each page in the backend.
ru: Это &mdash; меню ссылок. Ссылки еще не добавлялись. Можно это сделать, щелкнув по значку ссылки %icon%, который находится на каждой странице.

# shortcut_edit
source: Edit
ru: Редактирование

# shortcut_editID
source: Edit/Search
ru: Найти/Редактировать

# shortcut_FEPreview
source: Enable Frontend Preview
ru: Включить предпросмотр во внешнем интерфейсе

# shortcut_global
source: Global
ru: Глобально

# shortcut_group
source: Group
ru: Группа

# shortcut_group_1
source: Pages
ru: Страницы

# shortcut_group_2
source: Records
ru: Записи

# shortcut_group_3
source: Files
ru: Файлы

# shortcut_group_4
source: Tools
ru: Сервис

# shortcut_group_5
source: Miscellaneous
ru: Прочее

# shortcut_inactive
source: inactive
ru: не активна

# shortcut_loadEdit
source: Loading page
ru: Загрузка страницы

# shortcut_notEditable
source: No editable page found!
ru: Страница для редактирования не найдена!

# shortcut_noWSfound
source: ERROR: No workspaces found!
ru: ОШИБКА: рабочая область не найдена!

# shortcut_offlineWS
source: Draft workspace
ru: Черновая рабочая область

# shortcut_onlineWS
source: LIVE workspace
ru: ОПЕРАТИВНАЯ рабочая область

# shortcut_onlyAdmin
source: You cannot edit a shared shortcut!
ru: Невозможно редактировать общедоступную ссылку!

# shortcut_save
source: Update shortcut title
ru: Обновить название указателя

# shortcut_saveClose
source: Update and close editor
ru: Обновить и закрыть редактор

# shortcut_searchFor
source: Search for:
ru: Искать выражение:

# shortcut_selSC
source: Select shortcut
ru: Выбрать ссылку

# shortcut_workspace
source: Go to Workspace Module
ru: Перейти к модулю рабочих областей

source: Switch to User
ru: Переключиться в режим эмуляции этого пользователя

# switchtousershort
source: SU:
ru: РЭ:

source: Synchronize with original language
ru: Синхронизировать с исходным языком

source: System Records
ru: Системные записи

# uploadMultipleFilesInfo
source: Upload multiple files by holding the Shift or CTRL-file pressed while selecting your files (works on modern browsers only).
ru: Для того чтобы загрузить несколько файлов зажмите при выделении Shift или Ctrl. (Работает только в современных браузерах)

# viewPort_tooltipDebugPanelSplitDrag
source: Drag to resize or click to collapse the Debug Panel.
ru: Тяните для изменения размера или щелкните для сворачивания панели отладки.

# viewPort_tooltipModuleMenuSplit
source: Drag to resize the Modules Menu
ru: Тяните для изменения размера меню модулей.
