Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_login.xlf
Languages: fr, it, ru

# availableInterfaces
source: Backend,Front End,Traditional Backend
fr: Backend, Frontend, Backend traditionnel
it: Backend, Front End, Backend tradizionale
ru: Внутренний интерфейс,Внешний интерфейс,Традиционный внутренний интерфейс

# clear
source: Clear this field!
fr: Réinitialiser le champ !
it: Pulisci questo campo!
ru: Очистить это поле!

source: Copyright
ru: Авторское право

# details.link
source: Go to %s for details.
fr: Rendez-vous à %s pour plus de détails.
it: Vai su %s per dettagli.
ru: За деталями обратитесь на %s.

# error.capslock
source: Attention: Caps lock enabled!
fr: Attention : la touche majuscule est verrouillée !
it: Attenzione: hai il blocca maiuscole inserito!
ru: Внимание: включен Caps lock!

# error.cookies
source: Activate Cookies, please!
fr: Veuillez activer les cookies !
it: Attiva i cookies per piacere!
ru: Включите Cookies!

# error.cookies_ignore
source: Ignore!
fr: Ignorer !
it: Ignora!
ru: Игнорировать!

# error.furtherInformation
source: For more information or further help click here
fr: Pour plus d'information ou de l'aide veuillez cliquer ici
it: Per maggiori informazioni o aiuto cliccare qui
ru: Для дополнительной информации или для помощи, щелкните здесь

# error.javascript
source: Activate JavaScript, please!
fr: Veuillez activer le Javascript !
it: Attiva Javascript per piacere!
ru: Включите JavaScript!

# error.login
source: Your login attempt did not succeed. Make sure to spell your username and password correctly, including upper/lowercase characters.
fr: Votre tentative de connexion a échoué. Veuillez vérifier votre login et votre mot de passe, en incluant les majuscules et les minuscules.
it: Il tuo login non ha avuto successo. Verifica bene il tuo username e password, con attenzione a maiuscole e minuscole.
ru: Регистрация не удалась. Убедитесь в правильности ввода имени пользователя и пароля, включая регистр символов.

# error.login.description
source: Make sure to spell your username and password correctly, including upper/lowercase characters.
fr: Veuillez vérifier votre nom d'utilisateur et votre mot de passe, notamment les majuscules et les minuscules.
it: Verifica bene il tuo username e password, con attenzione a maiuscole e minuscole.
ru: Убедитесь, что правильно вводите имя пользователя и пароль, включая регистр символов.

# error.login.title
source: Your login attempt did not succeed
fr: Votre tentative de connexion a échoué
it: Login fallito
ru: Попытка регистрации неудачна

# extension.copyright
source: Extensions are copyright of their respective owners.
fr: Les copyright des extensions appartiennent à leur propriétaires respectifs.
it: Le estensioni sono copyright dei rispettivi proprietari.
ru: Авторские права на расширения принадлежат их владельцам.

# free.software
source: This is free software, and you are welcome to redistribute it under certain conditions; %sclick for details.%s
fr: Ceci est un logiciel libre, et vous êtes invités à le redistribuer sous certaines conditions;%sveuillez cliquer pour plus de détails.%s
it: Questo è un software gratuito (free software), e sei invitato a ridistribuirlo sotto determinate condizioni. %sclicca per dettagli.%s
ru: Это бесплатное программное обеспечение, и вы можете распространять его под определенными условиями; %sподробности по ссылке.%s

# headline
source: Login to the TYPO3 CMS Backend on ###SITENAME###
fr: Connexion au backend TYPO3 du site ###SITENAME###
it: Entra nel Backend TYPO3 di ###SITENAME###
ru: Вход во внутренний интерфейс TYPO3 на ###SITENAME###

# info.about
source: This is the backend login of TYPO3. You need username and password to access this administration interface. If you are a visitor of ###SITENAME###, please visit the public website: ###SITELINK###
fr: Ceci est l'accès au backend TYPO3. You devez posséder un login et un mot de passe pour accéder à cette interface d'administration. Si vous êtes un visiteur du site ###SITENAME###, veuillez poursuivre votre visite sur le site public : ###SITELINK###
it: Questa è la form di login al Backend di TYPO3. Necessiti username e password per accedervi. Se sei un visitatore di ###SITENAME###, visita il sito pubblico ###SITELINK###
ru: Это вход во внутренний интерфейс TYPO3. Для доступа к интерфейсу управления нужно ввести имя пользователя и пароль. Если Вы обычный посетитель ###SITENAME###, перейдите на публичный сайт: ###SITELINK###

# info.cookies_and_js
source: (Note: Cookies and JavaScript must be enabled!)
fr: (Note : les Cookies et le JavaScript doivent être activés !)
it: (Nota: Cookies e JavaScript devono essere attivi!)
ru: (Помните: должны быть включены Cookies и JavaScript)

# info.reset
source: Reset this form
fr: Réinitialiser le formulaire
it: Resetta questa form
ru: Сбросить форму

# interface.backend
source: Backend
ru: Внутренний интерфейс

# interface.backend_old
source: Traditional Backend
fr: Backend traditionnel
it: Backend tradizionale
ru: Традиционный внутренний интерфейс

# interface.frontend
source: Frontend
ru: Внешний интерфейс

# keep.notice
source: Obstructing the appearance of this notice is prohibited by law.
fr: Masquer cette note est interdit par la loi.
it: Eliminare o modificare questa nota è proibito dalla legge.
ru: Удаление этого примечания преследуется по закону.

# labels.donate
source: Donate
fr: Donation
it: Donazioni
ru: Пожертвовать

# labels.interface
source: Interface
it: Interfaccia
ru: Интерфейс

# labels.password
source: Password
fr: Mot de passe
ru: Пароль

# labels.submitLogin
source: Login
fr: Connexion
ru: Вход

# labels.submitLogout
source: Log Out
fr: Déconnexion
it: Esci
ru: Выход

# labels.switchToDefault
source: Switch to default login
fr: Passer en mode connexion par défaut
it: Passa a login normale
ru: Переключиться на регистрацию по умолчанию

# labels.switchToOpenId
source: Switch to OpenID
fr: Passer en mode OpenID
it: Passa a OpenID
ru: Переключиться на OpenID

# labels.username
source: Username
fr: Utilisateur
ru: Пользователь

# labels.whatIsOpenId
source: What is OpenId?
fr: Qu'est-ce qu'OpenID ?
it: Cosa è OpenID?
ru: Что такое OpenID?

# login_process
source: Verifying Login Data ...
fr: Vérification des données de connexion...
it: Sto verificando i dati...
ru: Проверка данных регистрации...

# newsheadline
source: Important Messages:
fr: Messages importants :
it: Messaggi importanti:
ru: Важные сообщения:

# no.warranty
source: TYPO3 CMS comes with ABSOLUTELY NO WARRANTY; %sclick for details.%s
fr: TYPO3 n'est fourni avec ABSOLUMENT AUCUNE GARANTIE; %sveuillez cliquer pour plus de détails.%s
it: TYPO3 è distribuito SENZA ALCUNA GARANZIA; %sclicca per dettagli.%s
ru: TYPO3 предоставляется БЕЗ КАКОЙ-ЛИБО ГАРАНТИИ; %sподробности по ссылке.%s

source: TYPO3 logo
fr: Logo TYPO3
it: logo TYPO3
ru: Лого TYPO3

# version.short
source: ver.
ru: вер.

# warning.incompatibleBrowser
source: You are using an unsupported browser version.
fr: Vous utilisez une version d'un navigateur non supportée.
it: State usando una versione del browser non supportata.
ru: Используется неподдерживаемая версия браузера.

# warning.incompatibleBrowserHeadline
source: Unsupported Browser
fr: Navigateur non supporté
it: Browser non supportato
ru: Неподдерживаемый браузер

# warning.incompatibleBrowserInternetExplorer
source: Please install <a href="http://www.microsoft.com/internetexplorer/" target="_blank" />a more modern browser version</a>.
fr: Veuillez installer <a href="http://www.microsoft.com/internetexplorer/" target="_blank" />un navigateur plus récent</a>.
it: Installare una <a href="http://www.microsoft.com/internetexplorer/" target="_blank" />versione del browser più recente</a>.
ru: Установите <a href="http://www.microsoft.com/internetexplorer/" target="_blank" />современную версию браузера</a>.

# warranty.by
source: Warranty is supplied by %s; %sclick for details.%s
fr: La garantie est fournie par %s; %sveuillez cliquer pour plus de détails.%s
it: Garanzia fornita da %s; %sclicca per dettagli.%s
ru: Гарантия предоставляется %s; %sподробности по ссылке.%s

source: TYPO3 CMS
fr: CMS TYPO3
