Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lang/*.locallang_tsfe.xlf
Languages: ru

# adminOptions
source: ADMIN PANEL
ru: ПАНЕЛЬ АДМИНИСТРАТОРА

# adminPanelTitle
source: TYPO3 ADMIN PANEL
ru: ПАНЕЛЬ АДМИНИСТРАТОРА TYPO3

source: Cache
ru: Буфер

# cache_cacheEntries
source: Cache entries
ru: Записей в буфере

# cache_clearLevels
source: Clear levels
ru: Уровень очистки

# cache_doit
source: Clear cache now!
ru: Очистить буфер!

# cache_noCache
source: No caching
ru: Отключить буферизацию

# div_Levels_0
source: This page
ru: Текущая страница

# div_Levels_1
source: + 1 sublevel
ru: + 1 подуровень

# div_Levels_2
source: + 2 sublevels
ru: + 2 подуровня

# edit
source: Editing
ru: Правка

# edit_db_list
source: Web>List module
ru: Модуль Веб>Список

# edit_displayFieldIcons
source: Display edit icons
ru: Показать значки редактирования

# edit_displayIcons
source: Display edit panels
ru: Показать панели редактирования

# edit_editFormsOnPage
source: Editforms on page
ru: Правка на странице

# edit_editNoPopup
source: No popup window
ru: Отключить всплывающее окно

# edit_editPageOverlay
source: Edit properties of translated page
ru: Править свойства переведённой страницы

# edit_editPageProperties
source: Edit page properties
ru: Править свойства страницы

# edit_move_page
source: Move page
ru: Переместить страницу

# edit_newContentElement
source: Create new content element
ru: Создать новый элемент содержимого

# edit_newPage
source: Create new page
ru: Создать новую страницу

# edit_openAB
source: Open TYPO3 Backend
ru: Открыть внутренний интерфейс TYPO3

# edit_recordHistory
source: View record change history
ru: Показать историю изменений

source: Info
ru: Инфо

# info_countUserInt
source: Count of USER_INT objects
ru: Количество объектов USER_INT

# info_DocumentSize
source: Document size
ru: Размер документа

# info_feuserId
source: Id of logged in FE-User
ru: Id авторизованного внешнего пользователя

# info_feuserName
source: Name of logged in FE-User
ru: Количество авторизованных внешних пользователей

# info_groupList
source: Frontenduser group combination
ru: Комбинация групп внешних пользователей

# info_id
source: Page Uid
ru: Uid страницы

# info_imagesOnPage
source: Images on this page
ru: Изображения на этой странице

# info_imagesSize
source: Total image file sizes
ru: Общий размер файлов изображений

# info_noCache
source: Page cached
ru: Страница в кеше

# info_noCache_no
source: No
ru: Нет

# info_noCache_yes
source: Yes
ru: Да

# info_totalParsetime
source: Total parsetime
ru: Общее время формирования

# info_type
source: Page type
ru: Тип страницы

# p_delete
source: Delete
ru: Удалить

# p_deleteConfirm
source: Are you sure you want to delete this record?
ru: Вы уверены что хотите удалить эту запись?

# p_editRecord
source: Edit record
ru: Править запись

# p_hide
source: Hide
ru: Скрыть

# p_hideConfirm
source: Hiding a record will make it invisible on the webpage. To edit the hidden record enter the backend or enable the frontend preview. Continue?
ru: Скрытые записи не будут видны на странице. Доступ к ним будет возможен только через внутренний интерфейс или через предпросмотр веб-страницы. Продолжить?

# p_moveDown
source: Move down
ru: Переместить ниже

# p_moveUp
source: Move up
ru: Переместить выше

# p_newRecordAfter
source: New record after
ru: Новая запись после

# p_newSubpage
source: New subpage
ru: Новая подстраница

source: Preview
ru: Предварительный просмотр

# preview_showHiddenPages
source: Show hidden pages
ru: Показать скрытые страницы

# preview_showHiddenRecords
source: Show hidden records
ru: Показать скрытые записи

# preview_simulateDate
source: Simulate time
ru: Симулировать момент времени

# preview_simulateUserGroup
source: Simulate user group
ru: Симулировать группу пользователей

source: Publish
ru: Публикация

# publish_doit
source: Publish now!
ru: Опубликовать!

source: Publish levels
ru: Опубликовать уровни

# publish_tree
source: Publish pages
ru: Опубликовать страницы

# p_unhide
source: Un-Hide
ru: Сделать видимым

# tsdebug_displayContent
source: Display content
ru: Показать содержимое

# tsdebug_displayMessages
source: Display messages
ru: Показать сообщения

# tsdebug_displayQueries
source: Explain SELECT queries
ru: Объяснять запросы SELECT

# tsdebug_displayTimes
source: Display all times
ru: Показать все тайминги

# tsdebug_forceTemplateParsing
source: Force TS Rendering
ru: Принудительное формирование TS

# tsdebug_LR
source: Track content rendering
ru: Протоколировать формирование содержимого

# tsdebug_tree
source: Tree display
ru: Отобразить дерево

source: Update
ru: Обновить
