Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/Acronym/*.locallang.xlf
Languages: fr, it, ru

source: Abbreviation
fr: Abréviation
it: Abbreviazione
ru: Аббревиатура

# Abridged_term
source: Short form
fr: Forme courte
it: Forma abbreviata
ru: Сокращенная форма

source: Acronym
fr: Acronyme
it: Acronimo
ru: Акроним

# Defined_abbr
source: Pre-defined abbreviations
fr: Abréviations pré-définis
it: Abbreviazioni predefinite
ru: Предопределенные аббревиатуры

# Defined_acronym
source: Pre-defined acronyms
fr: Acronymes pré-définis
it: Acronimi predefiniti
ru: Предопределенные акронимы

source: Delete
fr: Supprimer
it: Cancellare
ru: Удалить

source: Edit abbreviation
fr: Editer une abréviation
it: Modifica abbreviazione
ru: Править аббревиатуру

source: Insert abbreviation
fr: Inserer une abréviation
it: Inserire abbreviazione
ru: Вставить аббревиатуру

# Insert/Modify Acronym
source: Insert/edit abbreviation
fr: Insérer/modifier une abréviation
it: Inserisci/Modifica Acronimo o Abbreviazione
ru: Вставить/изменить аббревиатуру

# Language_abbr_helpText
source: This is the language for which the abbreviation is defined
fr: Ceci est la langue pour laquelle l'abréviation est définie
ru: Это язык, для которого определена аббревиатура

# Language_acronym_helpText
source: This is the language for which the acronym is defined
fr: Ceci est la langue pour laquelle l'acronyme est définie
ru: Это язык, для которого определен акроним

source: Select a language
fr: Sélectionner une langue
ru: Выберете язык

# Select_an_abbr
source: Select an abbreviation
fr: Sélectionner une abbréviation
it: Selezionare un'abbreviazione
ru: Выберете аббревиатуру

source: Select an acronym
fr: Sélectionner un acronyme
it: Selezionare un acronimo
ru: Выберете акроним

source: Select a term
fr: Sélectionner un terme
it: Selezionare un termine
ru: Выберете термин

source: Term
fr: Terme
it: Termine
ru: Термин

# Term_to_abridge
source: Term to abbreviate
fr: Terme à abrévier
ru: Сокращаемый термин

# Unabridged_term
source: Term
fr: Terme
it: Termine
ru: Термин

source: Use this term
fr: Utiliser ce terme
it: Usare questo termine
ru: Использовать этот термин

# Use_this_term_explain
source: Associate this term to the current selection
fr: Associer ce terme à la sélection courante
ru: Связать данный термин с текущим выбором
