Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/css_styled_content/pi1/*.locallang.xlf
Languages: it, ru

# eIcon.bodytext
source: Edit bodytext
it: Edita testo principale
ru: Редактировать текст

# eIcon.bullets
source: Edit bullet list
it: Edita lista
ru: Редактировать перечисление

# eIcon.caption
source: Edit image caption
it: Edita didascalia immagini
ru: Редактировать подпись изображения

# eIcon.caption_position
source: Edit image caption alignment
it: Modifica l'allineamento della didascalia dell'immagine
ru: Редактировать положение подписи

# eIcon.filelist
source: Edit filelist
it: Modifica lista file
ru: Править список файлов

# eIcon.form
source: Edit email form
it: Edita email form
ru: Редактировать почтовую форму

# eIcon.header
source: Edit header
it: Edita header
ru: Редактировать заголовок

# eIcon.html
source: Edit pure HTML content
it: Edita il contenuto in HTML
ru: Редактировать непосредственно HTML

# eIcon.images
source: Edit images
it: Edita immagini
ru: Редактировать изображения

# eIcon.login
source: Edit login element
it: Edita elemento di login
ru: Редактировать вход в систему

# eIcon.menuSitemap
source: Edit menu / sitemap
it: Edita menu / mappa del sito
ru: Редактировать меню / карту сайта

# eIcon.multimedia
source: Edit multimedia element
it: Edita elemento multimediale
ru: Редактировать мультимедиа-элемент

# eIcon.page
source: Page:
it: Pagina:
ru: Страница:

# eIcon.plugin
source: Change/configure plugin
it: Cambia/configura il plugin
ru: Изменить/настроить плагин

# eIcon.recordList
source: Edit recordlist
it: Edita recordlist
ru: Редактировать список записей

# eIcon.search
source: Edit search element
it: Edita elemento di ricerca
ru: Редактировать поиск

# eIcon.subheader
source: Edit subheader
it: Edita subheader
ru: Редактировать подзаголовок

# eIcon.table
source: Edit table
it: Edita tabella
ru: Редактировать таблицу

# label.toTop
source: To top
it: Torna s√π
ru: Наверх

# login.login
source: Login
ru: Вход

# login.logout
source: Logout
ru: Выход

# login.password
source: Password:
ru: Пароль:

# login.username
source: Username:
ru: Имя пользователя:

# menu.bypassNavigation
source: Skip navigation block
it: Salta il blocco di navigazione
ru: Пропустить блок навигации

# search.emptySearch
source: Sorry, your search was empty!
it: Mi dispiace, non ho trovato niente!
ru: Поиск не дал результатов!

# search.headersKeywords
source: Headers and keywords
it: Headers e keywords
ru: заголовках и ключевых словах

# search.pageContent
source: Page content
it: Contenuto della pagina
ru: содержании страниц

# search.resultRange
source: Searchresult: ###RANGELOW###-###RANGEHIGH### of ###TOTAL###
it: Risultati della ricerca: ###RANGELOW###-###RANGEHIGH### su ###TOTAL###
ru: Результат поиска: ###RANGELOW###-###RANGEHIGH### из ###TOTAL###

# search.searchButton
source: Search now!
it: Cerca ora!
ru: Найти!

# search.searchIn
source: Search in:
it: Cerca in:
ru: Поиск в:

# search.searchResultNext
source: Next
it: Prossimo
ru: Следующая

# search.searchResultPrev
source: Prev
it: Precedente
ru: Предыдущая

# search.searchWord
source: Searchword:
it: Parola da cercare:
ru: Поиск слова:

# uploads.icon
source: File link icon for %s
it: Icona link per %s
ru: Значок ссылки на файл для %s
