Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/form/Resources/Private/Language/*.locallang_controller.xlf
Languages: it, ru

# tx_form_domain_model_element_button.value
source: Push this button
it: Premi questo pulsante
ru: Нажмите эту кнопку

# tx_form_domain_model_element_reset.value
source: Clear form
it: Pulisci form
ru: Очистить форму

# tx_form_domain_model_element_submit.value
source: Submit form
it: Invia form
ru: Отправить форму

# tx_form_system_validate_alphabetic.error
source: The value contains not only alphabetic characters
it: Il valore deve contenere solo caratteri alfanumerici
ru: Значение содержит не только буквенные символы

# tx_form_system_validate_alphabetic.message
source: Use alphabetic characters
it: Usare caratteri alfabetici
ru: Используйте только буквенные символы

# tx_form_system_validate_alphabetic.message2
source: whitespace allowed
it: spazi consentiti
ru: пробелы разрешены

# tx_form_system_validate_alphanumeric.error
source: The value contains not only alphanumeric characters
it: Il valore deve contenere solo caratteri alfanumerici
ru: Значение содержит не только буквенные и числовые символы

# tx_form_system_validate_alphanumeric.message
source: Use alphanumeric characters
it: Usare caratteri alfanumerici
ru: Используйте буквенные и числовые символы

# tx_form_system_validate_alphanumeric.message2
source: whitespace allowed
it: spazi consentiti
ru: пробелы разрешены

# tx_form_system_validate_between.error
source: The value is not between %minimum and %maximum
it: Il valore non è tra %minimum e %maximum
ru: Значение выходит из диапазона от %minimum до %maximum

# tx_form_system_validate_between.error2
source: inclusively
it: inclusivamente
ru: включительно

# tx_form_system_validate_between.message
source: The value must be between %minimum and %maximum
it: Il valore deve essere tra %minimum e %maximum
ru: Значение должно быть в диапазоне от %minimum до %maximum

# tx_form_system_validate_between.message2
source: inclusively
it: inclusivamente
ru: включительно

# tx_form_system_validate_date.error
source: The value does not appear to be a valid date
it: Il valore non sembra essere una data valida
ru: Значение содержит недопустимую дату

# tx_form_system_validate_date.strftime.a
source: ddd
ru: ддд

# tx_form_system_validate_date.strftime.A
source: dddd
ru: дддд

# tx_form_system_validate_date.strftime.b
source: mmm
ru: ммм

# tx_form_system_validate_date.strftime.B
source: mmmm
ru: мммм

# tx_form_system_validate_date.strftime.d
source: dd
ru: дд

# tx_form_system_validate_date.strftime.I
source: hh
ru: чч

# tx_form_system_validate_date.strftime.m
source: mm
ru: мм

# tx_form_system_validate_date.strftime.M
source: mm
ru: мм

# tx_form_system_validate_date.strftime.S
source: ss
ru: сс

# tx_form_system_validate_date.strftime.y
source: yy
ru: гг

# tx_form_system_validate_date.strftime.Y
source: yyyy
ru: гггг

# tx_form_system_validate_digit.error
source: The value contains not only digit characters
it: Il valore deve contenere solo caratteri numerici
ru: Значение содержит не только цифры

# tx_form_system_validate_digit.message
source: Use digit characters
it: Usa caratteri numerici
ru: Используйте цифровые символы

# tx_form_system_validate_email.error
source: This is not a valid email address
it: Non è un indirizzo email valido
ru: Неверный адрес email

# tx_form_system_validate_equals.error
source: The value does not equal the value in field '%field'
it: Il valore non eguaglia il valore nel campo '%field'
ru: Значение отличается от значения поля '%field'

# tx_form_system_validate_equals.message
source: This field must be equal to '%field'
it: Questo campo deve essere uguale a '%field'
ru: Поле должно быть эквивалентно '%field'

# tx_form_system_validate_fileallowedtypes.error
source: The file type is not allowed
it: Il tipo di file non è consentito
ru: Недопустимый тип файла

# tx_form_system_validate_filemaximumsize.error
source: The filesize is too big
it: La dimensione del file è troppo grande
ru: Файл слишком большого размера

# tx_form_system_validate_filemaximumsize.message
source: The filesize must be smaller than %maximum
it: La dimensione del file deve essere minore di %maximum
ru: Размер файла должен быть меньше %maximum

# tx_form_system_validate_fileminimumsize.error
source: The filesize is too small
it: La dimensione del file è troppo piccola
ru: Файл слишком маленького размера

# tx_form_system_validate_fileminimumsize.message
source: The filesize must be bigger than %minimum
it: La dimensione del file deve essere maggiore di %minimum
ru: Размер файла должен быть больше %minimum

# tx_form_system_validate_float.error
source: The value does not appear to be a float
it: Il valore non sembra essere un numero in virgola
ru: Значение не является числом с плавающей точкой

# tx_form_system_validate_float.message
source: Enter a float
it: Inserire un numero in virgola
ru: Введите число с плавающей точкой

# tx_form_system_validate_greaterthan.error
source: The value does not appear to be greater than %minimum
it: Il valore non sembra essere più grande del %minimum
ru: Значение не больше %minimum

# tx_form_system_validate_greaterthan.message
source: The value must be greater than %minimum
it: Il valore deve essere maggiore di %minimum
ru: Значение должно быть больше %minimum

# tx_form_system_validate_inarray.error
source: The value does not appear to be valid
it: Il valore inserito non è valido
ru: Неверное значение

# tx_form_system_validate_inarray.message
source: Only a few values are possible
it: Sono possibili solo pochi valori
ru: Допустимы лишь несколько значений

# tx_form_system_validate_integer.error
source: The value does not appear to be an integer
it: Il valore inserito non è un numero intero
ru: Значение не является целым числом

# tx_form_system_validate_integer.message
source: Use an integer
ru: Используйте целое число

# tx_form_system_validate_ip.error
source: The value does not appear to be a valid IP address
it: Il valore inserito non è un indirizzo IP valido
ru: Значение не является адресом IP

# tx_form_system_validate_length.error
source: The value is less than %minimum characters long
it: Il valore inserito contiene meno di %minimum caratteri
ru: Значение короче %minimum символов

# tx_form_system_validate_length.error2
source: or longer than %maximum
it: oppure più di %maximum caratteri
ru: или длиннее %maximum

# tx_form_system_validate_length.message
source: The length of the value must have a minimum of %minimum characters
it: Il valore inserito deve contenere un minimo di %minimum caratteri
ru: Длина значения должна иметь минимум %minimum символов

# tx_form_system_validate_length.message2
source: and a maximum of %maximum
it: ed un massimo di %maximum
ru: и максимум %maximum

# tx_form_system_validate_lessthan.error
source: The value does not appear to be less than %maximum
it: Il valore non sembra essere minore del %maximum
ru: Значение превышает %maximum

# tx_form_system_validate_lessthan.message
source: The value must be less than %maximum
it: Il valore inserito deve contenere meno di %maximum caratteri
ru: Значение должно быть меньше %maximum

# tx_form_system_validate_regexp.error
source: The value does not match against pattern
it: Il valore non coincide con il pattern
ru: Значение не соответствует принятому шаблону

# tx_form_system_validate_regexp.message
source: Use the right pattern
it: Usa il giusto pattern
ru: Используйте правильный шаблон

# tx_form_system_validate_required.error
source: This field is required
it: Questo campo è obbligatorio
ru: Обязательное поле

# tx_form_system_validate_required.message
source: Required
it: Obbligatorio
ru: Обязательно

# tx_form_system_validate_uri.error
source: The value does not appear to be a URI
it: Il valore non sembra essere un URI
ru: Значение не является URI

# tx_form_system_validate_uri.message
source: The value must be a URI
it: Il valore deve essere un URI
ru: Значение должно быть URI

# tx_form_view_confirmation.confirm
source: Confirm
it: Conferma
ru: Отправить

# tx_form_view_confirmation.donotconfirm
source: Go back to the form
it: Torna indietro alla form
ru: Назад к форме

# tx_form_view_confirmation.message
source: Please check your input and confirm by using the appropriate button
it: Per favore verifica il tuo inserimento e conferma usando il bottone appropriato
ru: Проверьте введенные данные и отправьте форму, используя соответствующую кнопку

# tx_form_view_mail.error
source: There was an error when sending the form by mail
it: C'era un errore inviando il modulo via email
ru: Ошибка при отправке формы

# tx_form_view_mail.success
source: The form has been sent successfully by mail
it: La richiesta di contatto è stata inoltrata per email
ru: Форма успешно передана через почту
