Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/lowlevel/Resources/Private/Language/*.locallang.xlf
Languages: ru

source: Configuration
ru: Настройка

# typo3ConfVars
source: $GLOBALS['TYPO3_CONF_VARS'] (Global Configuration)
ru: $GLOBALS['TYPO3_CONF_VARS'] (глобальная настройка)

# tca
source: $GLOBALS['TCA'] (Table configuration array)
ru: $GLOBALS['TCA'] (область настройки таблиц)

# tcaDescr
source: $GLOBALS['TCA_DESCR'] (Table Help Description)
ru: $GLOBALS['TCA_DESCR'] (описание таблицы справки)

# loadedExt
source: $GLOBALS['TYPO3_LOADED_EXT'] (Loaded Extensions)
ru: $GLOBALS['TYPO3_LOADED_EXT'] (загруженные расширения)

# tbeStyles
source: $GLOBALS['TBE_STYLES'] (Skinning Styles)
ru: $GLOBALS['TBE_STYLES'] (стили оформления)

# beUser
source: $GLOBALS['BE_USER']->uc (User Settings)
ru: $GLOBALS['BE_USER']->uc (пользовательские настройки)

# usersettings
source: $GLOBALS['TYPO3_USER_SETTINGS'] (User Settings Configuration)
ru: $GLOBALS['TYPO3_USER_SETTINGS'] (настройки для пользователей)

# t3services
source: $GLOBALS['T3_SERVICES'] (Registered Services)
ru: $GLOBALS['T3_SERVICES'] (зарегистрированные службы)

# tbemodulesext
source: $GLOBALS['TBE_MODULES_EXT'] (BE Modules Extensions)
ru: $GLOBALS['TBE_MODULES_EXT'] (расширения модулей внутреннего интерфейса)

# tbemodules
source: $GLOBALS['TBE_MODULES'] (BE Modules)
ru: $GLOBALS['TBE_MODULES'] (модули внутреннего интерфейса)

source: Crop lines
ru: Линии обрезки

source: Variable:
ru: Переменная:

source: Enter search phrase:
ru: Введите искомую фразу:

source: Search
ru: Поиск

# useRegExp
source: Use regular expression
ru: Использовать регулярное выражение

# writeValue
source: Write value to configuration file
ru: Записать значение в файл конфигурации

# writeMessageFailed
source: Write to configuration file failed (%s)!
ru: Запись в файл конфигурации не удалось (%s)!
