Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/linkvalidator/Resources/Private/Language/Module/*.locallang_csh.xlf
Languages: ru

# checkboxes.description
source: Click the following checkboxes to consider or to ignore the corresponding broken links.
ru: Отметьте следующие флажки для выбора или пропуска соответствующих битых ссылок.

# tablehead_element.description
source: Type of the element containing the broken link, its headline and the field in which the broken link is located.
ru: Тип элемента с битой ссылкой, его заголовок и поле, в котором находится битая ссылка.

# tablehead_headlink.description
source: The linking text.
ru: Текст ссылки.

# tablehead_lastcheck.description
source: Date and time of the last update of the information in each table row.
ru: Дата и время последнего обновления информации в каждом ряду таблицы.

# tablehead_linkmessage.description
source: Status of that link.
ru: Статус этой ссылки.

# tablehead_linktarget.description
source: URL to which the broken link is pointing.
ru: URL на который указывает битая ссылка.

# tablehead_path.description
source: Path to the content element, which contains the broken link.
ru: Путь к элементу содержимого с битой ссылкой.

# task_configuration.alttitle
source: Special TSconfig code
ru: Специфичный код TSconfig

# task_configuration.description
source: TSconfig Code which defines settings for linkvalidator to be used for this task.
ru: Код TSconfig, определяющий настройки проверки ссылок для этой задачи.

# task_depth.alttitle
source: Depth of the task
ru: Глубина задачи

# task_depth.description
source: Level of pages the task should check.
ru: Количество уровней страниц, проверяемых в этой задаче.

# task_email.alttitle
source: Email address
ru: Адрес email

# task_email.description
source: Email address to which an email report is sent.
ru: Адрес email, на который отсылается отчёт.

# task_emailfile.alttitle
source: Email template file
ru: Файл шаблона email

# task_emailfile.description
source: Define a template to be used for the email.
ru: Определение шаблона, используемого для email.

# task_emailonbrokenlinkonly.alttitle
source: Mailing option
ru: Параметры отсылки

# task_emailonbrokenlinkonly.description
source: Only send an email, if new broken links were found.
ru: Отсылать отчёт только при обнаружении новых битых ссылок.

# task_page.alttitle
source: Start page of the task
ru: Начальная страница задачи

# task_page.description
source: UID of the start page for this task.
ru: UID стартовой страницы этой задачи.
