Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/layout/*.locallang_db_new_content_*.xlf
Languages: fr, it, ru

# common
source: Typical page content
fr: Contenu de page
it: Contenuto tipico
ru: Обычные типы содержимого

# common_bulletList_description
source: A single bullet list.
fr: Une liste à puce simple.
it: Una semplice lista puntata
ru: Обычный маркированный список.

# common_bulletList_title
source: Bullet List
fr: Liste à puce
it: Lista Puntata
ru: Маркированный список

# common_headerOnly_description
source: Adds a header only.
fr: Ajoute un simple titre
it: Aggiungi solo un header.
ru: Добавлять только заголовок.

# common_headerOnly_title
source: Header Only
fr: Titre seulement
it: Solo Header
ru: Только заголовок

# common_imagesOnly_description
source: Any number of images aligned in columns and rows with a caption.
fr: Images alignées en colonnes, avec une légende.
it: Un numero qualsiasi di immagini allineate per colonne e righe, con didascalie
ru: Набор изображений, выстроенных в столбцы и строки с подписями.

# common_imagesOnly_title
source: Images Only
fr: Images seules
it: Immagini
ru: Только изображения

# common_regularText_description
source: A regular text element with header and bodytext fields.
fr: Elément de texte avec titre et paragraphe.
it: Testo regolare, con un'intestazione e un corpo centrale.
ru: Обычный текстовый элемент с полем для заголовка и содержимого

# common_regularText_title
source: Regular Text Element
fr: Elément de texte
it: Testo Normale
ru: Обычный текстовый элемент

# common_table_description
source: A simple table.
fr: Un tableau simple.
it: Una tabella semplice.
ru: Простая таблица.

# common_table_title
source: Table
fr: Tableau
it: Tabella
ru: Таблица

# common_textImage_description
source: Any number of images wrapped right around a regular text element.
fr: Images alignées à droite d'un élément de texte.
it: Come il precedente, ma con la possibilità di impaginare automaticamente un qualsiasi numero di immagini.
ru: Набор изображений, помещенных около обычного текстового элемента.

# common_textImage_title
source: Text & Images
fr: Texte & images
it: Testo & Immagini
ru: Текст с изображением

# forms
source: Form elements
fr: Formulaires
it: Elementi Form
ru: Формы

# forms_login_description
source: Login/logout form used to password protect pages allowing only authorised website users and groups access.
fr: Formulaire d'identification et de déconnexion utilisé pour permettre des accès restreints sur certaines parties du site.
it: form Login/Logout usata per limitare l'accesso a determinate sezioni del sito solo agli utenti e gruppi autorizzati.
ru: Форма авторизации в системе. Используется для организации доступа пользователей и определенных групп к защищённым паролем страницам сайта.

# forms_login_title
source: Login Form
fr: Formulaire d'identification
ru: Форма авторизации

# forms_mail_description
source: A mail form allowing website users to submit responses.
fr: Un formulaire qui permet aux utilisateurs du site d'envoyer des réponses.
it: Una form che permette di inviare via email i dati inseriti dall'utente
ru: Почтовая форма, позволяющая посетителям отправлять сообщения.

# forms_mail_title
source: Mail Form
fr: Formulaire de contact
ru: Почтовая форма

# forms_search_description
source: Draws a search form and the search result if a search is performed.
fr: Insère un formulaire de recherche et les résultats si une recherche est lancée.
it: Una form di ricerca e mostra i risultati quando viene eseguita una ricerca
ru: Форму поиска и результаты поиска.

# forms_search_title
source: Search Form
fr: Formulaire de recherche
it: Cerca nel Sito
ru: Форма поиска

source: Plugins
ru: Дополнения

# plugins_general_description
source: Select this element type to insert a plugin which cannot be found amongst the options below.
fr: Choisissez ce type d'élément pour insérer un plugin qui ne peut pas être trouvé parmi les options ci-dessous.
it: Seleziona questo elemento per inserire un plugin non presente in questa lista.
ru: Выберите этот пункт для вставки дополнений, отсутствующих в списке ниже.

# plugins_general_title
source: General Plugin
fr: Plugin général
it: Plugin Generico
ru: Общие дополнения

# sel1
source: Please select the type of page content you wish to create:
fr: Veuillez sélectionner le type de contenu de page vous souhaitez créer :
it: Seleziona il tipo di contenuto che vuoi creare:
ru: Выберите, пожалуйста, какой тип содержимого вы хотите создать:

# sel2
source: Now, click the position where you wish to place the element on the page:
fr: Maintenant, cliquez à l'endroit où vous souhaitez placer le contenu dans la page :
it: Clicca nella posizione della pagina in cui vuoi inserire l'elemento:
ru: Теперь выберите то место в странице, куда вы хотите поместить элемент:

# special
source: Special elements
fr: Eléments spéciaux
it: Contenuti speciali
ru: Особые элементы

# special_divider_description
source: This element inserts a visual divider, which is by default a horizontal line.
fr: Cet élément insère un diviseur visuel, qui est par défaut une ligne horizontale.
it: Questo elemento inserisce un divisore visuale, di default una linea orizzontale.
ru: Этот элемент представляет из себя визуальное разделение в виде горизонтальной линии.

# special_divider_title
source: Divider
fr: Diviseur
it: Divisore
ru: Разделитель

# special_filelinks_description
source: Makes a list of files for download.
fr: Crée une liste de fichiers pour téléchargement.
it: Lista di files da scaricare
ru: Список файлов для загрузки.

# special_filelinks_title
source: File Links
fr: Liens vers des fichiers
ru: Ссылки на файлы

# special_media_description
source: Inserts a media element like a Flash animation, audio file or video clip.
fr: Insère un élément de type média tel qu'une animation Flash, un fichier audio ou un fichier vidéo.
it: Inserisce un elemento multimediale tipo animazione Flash, file audio o video
ru: Вставьте медиа элемент, вроде флеш-анимации, аудио файла или видео клипа.

# special_media_title
source: Media
fr: Média
ru: Медиа

# special_menus_description
source: Creates a menu of pages, sitemap or other special menus.
fr: Crée un menu des pages, un plan du site ou d'autres menus spéciaux.
it: Crea un menù di pagine, una sitemap o un altro menu speciale.
ru: Создание меню страниц, карты сайта или других специфичных меню.

# special_menus_title
source: Special Menus
fr: Menus spéciaux
it: Menù speciale
ru: Специальное меню

# special_multimedia_description
source: Inserts a media element like a Flash animation, audio file or video clip.
fr: Insère un élément de type média tel qu'une animation Flash, un fichier audio ou un fichier vidéo.
it: Inserisce un contenuto multimediale tipo Flash, file audio o video.
ru: Мультимедийный элемент, такой как флеш-анимация, аудиофайл или видеоклип.

# special_multimedia_title
source: Multimedia
fr: Multimédia
ru: Мультимедиа

# special_plainHTML_description
source: With this element you can insert raw HTML code on the page.
fr: Avec cet élément vous pouvez insérer du code HTML brut sur la page.
it: Con questo elemento puoi inserire del codice HTML nella pagina.
ru: С помощью этого элемента вы можете поместить необработанный HTML непосредственно на страницу.

# special_plainHTML_title
source: Plain HTML
fr: HTML brut
it: HTML semplice
ru: Чистый HTML

# special_qtobject_description
source: Inserts a Quicktime element like a Quicktime audio file or video clip (*.mov).
fr: Insère un élément Quicktime de type vidéo ou audio (*.mov)
it: Inserisce un file Quicktime, audio o video ( *.mov)
ru: Вставка элемента Quicktime в виде Quicktime аудио или видео клипа (*.mov).

# special_qtobject_title
source: Inserts a Quicktime element.
fr: Insère un élément Quicktime
it: Inserisce un file Quicktime
ru: Вставка элемента Quicktime

# special_shortcut_description
source: With this element you can embed other content elements.
fr: Avec cet élément, vous pouvez incorporer d'autres éléments de contenu
it: Tramite questo elemento è possbile "embeddare" altri contenuti
ru: При помощи этого элемента возможно подключать другие элементы содержимого.

# special_shortcut_title
source: Insert records
fr: Insérer des enregistrements
it: Inserisci record
ru: Вставить записи

# special_sitemap_title
source: Sitemap
fr: Plan du site
it: Mappa del sito
ru: Карта сайта

# special_swfobject_description
source: Inserts Flash media element, audio file or video clip.
fr: Insère un élément Flash de type vidéo ou audio
it: Inserisce un oggetto Flash, audio o video
ru: Вставка флеш медиа элемента, аудио файла или видео клипа

# special_swfobject_title
source: Inserts a Flash media element.
fr: Insère un élément Flash
it: Inserisce un oggetto Flash
ru: Вставка флеш медиа элемента.
