Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/impexp/app/*.locallang.xlf
Languages: it

source: ALL tables
it: TUTTE le tabelle

# execlistqu_maxNumberLimit
source: Max number limit!
it: Limite massimo:

# execlistqu_structureToBeExported
source: Structure to be exported:
it: Struttura da espertare:

# export
source: Export to .t3d
it: Esporta file .t3d

# exportdata_advancedOptions
source: Advanced Options
it: Opzioni Avanzate

# exportdata_badPathS
source: Bad path: "%s"
it: Indirizzo errato: "%s"

# exportdata_messages
source: Messages
it: Messaggi

# exportdata_problemsSavingFile
source: Problems saving file
it: Problemi nel salvare il file

# exportdata_savedFile
source: SAVED FILE
it: FILE SALVATO

# exportdata_savedInSBytes
source: Saved in "%s", bytes %s
it: Salvato in "%s", bytes %s

# filterpage_structureToBeImported
source: Structure to be imported:
it: Struttura da importare:

# impexpcore_displaycon_controls
source: Controls:
it: Controlli:

# impexpcore_displaycon_currentPath
source: Current Path:
it: Path attuale:

# impexpcore_displaycon_insidePagetree
source: Inside pagetree:
it: Dentro l'albero delle pagine:

# impexpcore_displaycon_message
source: Message:
it: Messaggio:

# impexpcore_displaycon_result
source: Result:
it: Risultato:

# impexpcore_displaycon_size
source: Size:
it: Dimensioni:

# impexpcore_displaycon_title
source: Title:
it: Titolo:

# impexpcore_displaycon_updateMode
source: Update Mode:
it: Modalità di aggiornamento:

# impexpcore_printerror_description
source: Description:
it: Descrizione:

# impexpcore_singlereco_descr
source: Descr:
it: Descriz:

# impexpcore_singlereco_exclude
source: Exclude
it: Escludi

# impexpcore_singlereco_filename
source: Filename:
it: Nome file:

# impexpcore_singlereco_forceUidSAdmin
source: Force UID [%s] (Admin)
it: Forza PID [%s] (Admin)

# impexpcore_singlereco_ignorePid
source: Ignore PID
it: Ignora PID

# impexpcore_singlereco_importAsNew
source: Import as new
it: Importa come nuovo

# impexpcore_singlereco_insert
source: Insert
it: Inserisci

# impexpcore_singlereco_outsidePagetree
source: Outside pagetree:
it: Fuori l'albero delle pagine:

# impexpcore_singlereco_respectPid
source: Respect PID
it: Rispetta PID

# impexpcore_singlereco_title
source: Title:
it: Titolo:

# impexpcore_singlereco_update
source: Update
it: Aggiorna

# impexpcore_singlereco_value
source: Value:
it: Valore:

# impexpcore_softrefsel_editable
source: Editable
it: Editabile:

# impexpcore_softrefsel_exclude
source: Exclude
it: Escludi:

# import
source: Import from .t3d
it: Importa file .t3d

# importdata_action
source: Action:
it: Azione:

# importdata_allowToWriteBanned
source: Allow to write banned file extensions (eg. PHP scripts), if any
it: Permetti di scrivere files con estensioni proibite (ad esempio script PHP), se ce ne fossero

# importdata_areYouSure
source: Are you sure?
it: Sei sicuro/a?

# importdata_browse
source: Browse:
it: Sfoglia:

# importdata_description
source: Description:
it: Descrizione:

# importdata_doNotShowDifferences
source: Do not show differences in records
it: Non mostrare le differenze nei records

# importdata_enableLogging
source: Enable logging:
it: Attiva il logging

# importdata_failureNoFileUploaded
source: Failure: No file uploaded - was it too big? Check system log.
it: Errore: nessun file uploadato - forse era troppo grande? Controlla il log di sistema

# importdata_force_all_UIDS
source: Force ALL UIDs values
it: Forza il valore di TUTTI gli UID

# importdata_force_all_UIDS_descr
source: With this option the original UID value of all imported records are forced to be the same. BE VERY CAREFUL WITH THIS! (Admin Only).
it: Con questa opzione il valori UID originali di tutti i records importati saranno forzati ad essere gl istessi. FATE ATTENZIONE CON QUESTA OPZIONE!! (solo per gli Admin)

# importdata_fromPathS
source: (From path: %s)
it: (Dal percorso: %s)

# importdata_greenValuesAreFrom
source: Green values are from the import file, red values from the current database record and black values are similar in both versions.
it: I valori in verde sono dal file importato, quelli rossi sono dall'attuale database, e quelli neri sono simili in entrambe le versioni.

# importdata_icon
source: Icon:
it: Icona:

# importdata_ifYouSetThis
source: If you set this option, the position of updated elements will not be updated to match the structure of the input file.
it: Se selezioni questa opzione, la posizione degli elementi aggiornati non sarà modificata per corrispondere alla struttura del file importato.

# importdata_ignorePidDifferencesGlobally
source: Ignore PID differences globally
it: Ignora globalmente le differenze di PID

# importdata_import
source: Import
it: Importa

# importdata_importOptions
source: Import Options:
it: Opzioni di importazione

# importdata_messages
source: Messages
it: Messaggi

# importdata_newImport
source: New import
it: Nuova importazione

# importdata_noteNoDecompressorAvailable
source: NOTE: No decompressor available for compressed files!
it: NOTA: non è disponibile nessun decompressore per i files compressi!

# importdata_notes
source: Notes:
it: Note:

# importdata_options
source: Options:
it: Opzioni:

# importdata_saveToFilename
source: Save to filename
it: Salva su file

# importdata_selectFileToImport
source: Select file to import:
it: Seleziona il file da importare:

# importdata_structureHasBeenImported
source: Structure has been imported, here is the result:
it: La struttura è stata importata, ecco il risultato:

# importdata_success
source: Success:
it: Esito:

# importdata_thisIsDisabledBy
source: This is disabled by default since there may be hundred of entries generated.
it: Questa opzione è disabilitata di default dato che potrebbero esserci centinaia di voci generate.

# importdata_thisOptionRequiresThat
source: This option requires that the structure you import already exists on this server and only needs to be updated with new content!
it: Questa opzione richiede che la struttura da importare esista di già su questo server, e che necessita solamente di essere aggiornata con i nuovi contenuti!

# importdata_title
source: Title:
it: Titolo:

# importdata_update
source: Update:
it: Aggiorna:

# importdata_update_299e
source: Update
it: Aggiorna

# importdata_updateRecords
source: Update records
it: Aggiorna records

# importdata_uploadFileFromLocal
source: Upload file from local computer:
it: Aggiorna il file dal computer locale:

# importdata_uploadStatus
source: Upload status:
it: Stato di upload:

# importdata_writeIndividualDbActions
source: Write individual DB actions during import to the log
it: Scrivi nel log le singole azioni del DB durante l'importazione

# makeadvanc_excludeHtmlCssFile
source: Exclude HTML/CSS file resources:
it: Escludi le risorse HTML/CSS

# makeadvanc_extensionDependencies
source: Extension dependencies:
it: Dipendenze dell'estensione:

# makeadvanc_selectExtensionsThatThe
source: Select extensions that the exported content depends on:
it: Seleziona le estensioni su cui dipende il contenuto esportato:

# makeadvanc_update
source: Update
it: Aggiorna

# makeconfig_1Level
source: 1 level
it: 1 livello

# makeconfig_2Levels
source: 2 levels
it: 2 livelli

# makeconfig_3Levels
source: 3 levels
it: 3 livelli

# makeconfig_4Levels
source: 4 levels
it: 4 livelli

# makeconfig_anSqlQueryReturned
source: An SQL query returned exactly the amount of records specified by the limit value (%s) - that could indicate an incomplete selection of records! Make sure this is on purpose.
it: Una querty SQL ha restituito esattamento il numero di records specificati dal valore limite (%s) - ciò potrebbe indicare uan selezione incompleta di records! Assicurati che ciò sia voluto.

# makeconfig_clearAllExclusions
source: Clear all exclusions:
it: Cancella tutte le esclusioni:

# makeconfig_excludeElements
source: Exclude elements:
it: Escludi elementi:

# makeconfig_expandedTree
source: Expanded tree
it: Albero esteso:

# makeconfig_exportPagetreeConfiguration
source: Export pagetree configuration:
it: Esporta la configurazione dell'albero delle pagine:

# makeconfig_exportSingleRecord
source: Export single record:
it: Esporta un singolo record:

# makeconfig_exportTablesFromPages
source: Export tables from pages:
it: Esporta le tabelle dalle pagine:

# makeconfig_includeRelationsToTables
source: Include relations to tables:
it: Includi le relazioni alle tabelle:

# makeconfig_includeTables
source: Include tables:
it: Includi le tabelle:

# makeconfig_infinite
source: Infinite
it: Infiniti

# makeconfig_levels
source: Levels:
it: Livelli:

# makeconfig_maxNumberOfRecords
source: Max number of records:
it: Numero massimo di records:

# makeconfig_noExcludedElementsYet
source: No excluded elements yet. Exclude by setting checkboxes below in the element display.
it: Nessun elemento escluso. Escludi selezionando i checkbox sottostanti.

# makeconfig_noTreeExportedOnly
source: No tree exported - only tables on the page.
it: Nessun albero esportato - solo le tabelle nella pagina.

# makeconfig_onlyThisPage
source: Only this page
it: Solo questa pagina

# makeconfig_pageId
source: Page ID:
it: ID pagine:

# makeconfig_relationsAndExclusions
source: Relations and Exclusions:
it: Relazioni ed esclusioni:

# makeconfig_showStaticRelations
source: Show static relations:
it: Mostra le relazioni statiche:

# makeconfig_tablePids
source: Table/Pids:
it: Tabella/Pids:

# makeconfig_tablesOnThisPage
source: Tables on this page
it: Tabelle in questa pagina:

# makeconfig_tree
source: Tree:
it: Albero:

# makeconfig_useStaticRelationsFor
source: Use static relations for tables:
it: Usa relazioni statiche per le tabelle:

# makesavefo_areYouSure
source: Are you sure?
it: Sei sicuro?

# makesavefo_delete
source: Delete
it: Elimina

# makesavefo_description
source: Description:
it: Descrizione:

# makesavefo_downloadExport
source: Download export
it: Scarica l'esportazione

# makesavefo_fileFormat
source: File format:
it: Formato file:

# makesavefo_filenameSavedInS
source: Filename (saved in "%s"):
it: Nome del file (salvato in "%s"):

# makesavefo_load
source: Load
it: Carica

# makesavefo_maxSizeOfFiles
source: Max size of files to include (kb):
it: Dimensione massima dei files da includere (kb):

# makesavefo_merge
source: Merge
it: Unisci

# makesavefo_notes
source: Notes:
it: Note:

# makesavefo_outputOptions
source: Output options:
it: Opzioni di output:

# makesavefo_public
source: Public:
it: Pubblico:

# makesavefo_save
source: Save
it: Salva

# makesavefo_selectPreset
source: Select preset:
it: Seleziona preset:

# makesavefo_t3dFile
source: T3D file
it: file T3D

# makesavefo_t3dFileCompressed
source: T3D file / compressed
it: file T3D / compresso

# makesavefo_title
source: Title:
it: Titolo:

# makesavefo_titleOfNewPreset
source: Title of new preset:
it: Nome del nuovo preset

# makesavefo_update
source: Update
it: Aggiorna

# tableselec_configuration
source: Configuration
it: Configurazione

# title
source: Import / Export
it: Importa / Esporta
