Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/4.5/*.locallang_csh_pages.xlf
Languages: ru

# nav_title.description
source: Alternative Navigation Title for menu items in the Frontend. When set, this value is used instead of the Page Title.
ru: Альтернативный заголовок для элемента меню во внешнем интерфейсе. При установке, это значение имеет преимущество над значением заголовка страницы.

# newUntil.description
source: Enter the date at which this page is no longer considered new.
ru: Введите дату, до которой текущая страница будет рассматриваться как новая.

# newUntil.details
source: The 'New Until' date of the page has no effect on the display of the webpage. This value is instead for internal use as a reminder of the date when the content of this page should be revised. If the content of the page will become outdated on a certain day, you could set this value to that approximate date. To get an overview of when pages will be outdated, use the 'Pagetree overview' in the 'Web>Info' Module.
ru: Отметка о "новой" вплоть до не влияет на отображение страницы. Она нужна скорее для внутреннего применения, как напоминание о пересмотре содержимого страницы. Так, если содержимое страницы планируется изменить в определенный момент времени, можно поставить здесь это время. Чтобы просмотреть такие даты, используйте "Обзор дерева страниц" в модуле "Веб>Инфо".

# newUntil.syntax
source: See Page / Publication Date (click below)
ru: Смотрите Страница / Дата публикации (щелкните ниже)

# no_cache.description
source: This option disables server caching of the page.
ru: Этот параметр отключает кеширование страницы на сервере.

# no_cache.details
source: Normally pages in TYPO3 are cached on the server after being constructed for the first time. This means a page is displayed much faster the second time it's requested. For most pages this presents no problems; indeed, it boosts the performance of the website. However you may need to disable caching for a page if it contains dynamic content which must not be cached under any circumstances. Normally the PHP-code rendering such content is programmed to disable the caching automatically. But with this option you can force the page not to be cached.
ru: Обычно страницы в TYPO3 кешируются на сервере после начального создания. Что приводит к значительному убыстрению отображения страницы после запроса. Для большинства страниц это не составляет проблему, наоборот, повышает производительность web сайта. Однако может понадобиться отключить кеширование страниц, если она содержит динамическое информационное наполнение, которое не должно кешироваться ни при каких обстоятельствах. Так или иначе, этот параметр отключает кеширование страницы на сервере.

# no_search.description
source: If enabled, this option excludes the page from searching operations on the website.
ru: Если включено, то страница исключается из операций поиска на web сайте.

# shortcut.description
source: Select a page to act as the Shortcut Target. When the current page is requested in the Frontend, it will be redirected to the Shortcut Target.
ru: Вставьте ссылку на страницу. Запрос страницы с этим ID во внешнем интерфейсе перенаправит к странице, на которую установлена ссылка.

# shortcut.details
source: Click the 'Browse for Records' icon and a new window will appear in which you can easily select a page to act as the Shortcut Target. This option is used only if the page 'Type' is set to 'Shortcut.'
ru: Щелкните по значку "Обзор записей", для выбора в новом окне страницы, на которую будет указывать данная страница. Этот параметр используется, только для "Типа" страницы – "Ссылка".

# shortcut.image_descr
source: Select a Shortcut Target page with the Element Browser.
ru: Выберете страницу в Обзоре записей, на которую будет ссылаться данная страница.

# shortcut_mode.description
source: Select a Shortcut Mode. By default the shortcut page must have a Shortcut Target to jump to. Other options are to go to the first subpage, to a random subpage, or back up to the parent page.
ru: Выберете режим ссылки. По умолчанию страница ссылка должна иметь цель для перехода. При помощи альтернативных параметров можно перейти на первую или случайную подстраницу текущей страницы, или назад, на родительскую страницу.

# starttime.description
source: The Publish Date determines when the page will be visible online. If the Publish Date is not set, the page will be available immediately.
ru: Дата публикации определяет дату, начиная с которой страница будет видна в сети. Если время публикации не определено, страница будет в любом случае видна в сети (конечно, если она не скрыта другим способом).

# starttime.syntax
source: The Publish Date Format is either DD-MM-YYYY or MM-DD-YYYY depending on how TYPO3 is configured. There are also several shortcuts you can use when entering the date. If you insert a 'd' the current date will be inserted. You can also append any value in the field with a number such as '+10' which will add 10 days to the current value. For example, entering 'd+10' would result in a date 10 days from now.
ru: Формат ДД-ММ-ГГГГ. Можно и по другому вводить значения - оно моментально будет вычислено. Например, если Вы введете "d", будет вставлена текущая дата. Можно ввести в поле любое значение, например "+10", что добавить 10 дней к текущей дате. То есть, введя "d+10", получите день, отстоящий от сегодня на 10 дней.

# subtitle.description
source: Enter a subtitle if needed.
ru: Введите подзаголовок при необходимости.

# subtitle.details
source: Whether this field is used or not depends on the template. In most cases it's not used.
ru: Использование этого поля зависит от шаблона. В большинстве случаев оно не используется.

# target.description
source: This sets the default Link Target for menu items linking to this page. Can also used to open the page as a popup window.
ru: HTML цель для элементов меню, связанных с этой страницей. Также может использоваться для открытия страниц во всплывающем окне.

# target.details
source: The Link Target overrides the default Link Target behavior, which should already be configured correctly for most pages in the website TypoScript template. There are additional options available by using the Link Target field Setting an integer value at the beginning of the field sets it as the default type for the page. For example, if an RSS feed is configured in TypoScript as typeNum=100, setting the Link Target to 100 could be used to add an RSS link in the menu. The following syntax is used to open the page in a popup window: 400x200 - Opens the page in a 400x200 popup window. 230x450:resizable=0,location=1 - Opens the page in a 230x450 popup window that is not resizable and has an address bar. Combined: 100 600x350 - Opens the page in a 600x350 popup with type=100 2 _blank - Opens the page with target "_blank" and type=2
ru: Устанавливайте это значение только для переназначения ссылок по умолчанию, которые в большинстве своем правильно настроены для большинства страниц в шаблоне TypoScript. Больше параметров имеется в поле для цели. Установка целого значения в начале поля, добавляет его в виде типа страницы по умолчанию. Например, если подача RSS настроена в Typoscript как typeNum=100, установка цели равной 100 может использоваться для добавления RSS ссылки в меню. Для открытия во всплывающем окне, используйте следующий синтаксис: 400x200 - страница будет открыта во всплывающем окне, размером 400x200 230x450:resizable=0,location=1 - страница будет открыта во всплывающем окне, с заданными параметрами. Комбинация: 100 600x350 - страница будет открыта во всплывающем окне с типом 100 2 _blank - страница будет открыта с в окне с целью "_blank" и типом 2

# title.description.+
source: This is normally shown in the website navigation.
ru: Обычно отображается в меню навигации сайта.

# TSconfig.details.+
source: <strong>Example:</strong> The 'Web>Page' module lets you create content in four columns, Left, Normal, Right, Border if the template has been configured to use this option. (However, most websites use only one or two columns so some of these content columns are just taking up space and confusing users.) If you enter this string in the 'TSConfig' field, the 'Web>Page' Module will only show the 'Normal' and 'Border' column! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Must be entered in a single line!)
ru: <strong>Пример:</strong> Обычно модуль "Веб>Страница" позволяет создавать содержимое в четырех колонках – левой, обычной, правой, крайней. Но обычно на сайтах используются лишь одна или две колонки. И некоторые из этих колонок содержимого лишь занимают место и даже сбивают пользователей с толку. Введя эту строку в поле "TSconfig" модуля "Веб>Страница", можно будет работать лишь с "Обычной" или "Крайней" колонками! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Должно вводиться в одну строку!)

# url.description
source: Enter the URL this page redirects to.
ru: Введите URL на который будет перенаправлять данная страница.

# url.details
source: For example, 'http://www.typo3.org' or just 'www.typo3.org' if the 'Protocol' selector is set to 'http://'. Use the 'Protocol' selector to select a prefix for the URL. This option is used only if the page 'Type' is set to 'Link to External URL.'
ru: Пример: "http://www.typo3.com" или просто "www.typo3.com", при установке "Протокол" "http://". Селектор "Протокол" используется для префикса URL. Этот параметр используется только если "Тип" страницы установлен на "Внешняя ссылка".

# urltype.description
source: Set the Protocol for the URL.
ru: Настройка протокола URL.
