Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/4.5/*.locallang_csh_ttcontent.xlf
Languages: ru

# bodytext.description
source: Enter the main text.
ru: Введите основной текст.

# bodytext.details
source: The main text of the Content Element is entered here and can be formatted with HTML or a Rich Text Editor. The field is reused in other Content Element types so changing the type will cause any text to be reused in that new Content Element type. When you're using this field with the "Text" and "Text & Images" types, the content is normal body text. Each linebreak signifies a new paragraph, you can use the special TYPO3 tag, &lt;LINK&gt;, for making links. You can use many HTML tags but there are limitations depending on your website configuration. A Rich Text Editor is commonly used to add a visual editing interface for 'Text' and 'Text & Images' Content Elements. <b>Bullet Lists:</b> If the type is "Bullet List" each line in this field is a bullet item. <b>Tables:</b> If the type is "Table" each line represents a table row. Within each line, columns are divided by a vertical bar ('|'). A table row with 3 columns could look like "This is column 1 | Column 2 here | Third column!". The table wizard can also be used for creating tables and is much easier than hand coding them. <b>Parameters:</b> Types like "Form" and "Multimedia" use this field for parameters than can be passed to the Content Element. The "HTML" type expects raw HTML which is simply displayed on the website without any processing. <b>Making a mail form:</b> When you have selected the "Form" Content Element you can enter form field and other options. This is a brief example: Your name: | *name=input,40 | [Enter name!] Your email: | *email=input,40 Your address: | address=textarea,40,10 Your haircolor: |hair=radio|Blue=blue, Red=red |formtype_mail = submit | Send Form |subject=hidden| Enter a subject here! |html_enabled=hidden | 1 The first two lines makes input fields for name and email. Both are marked as "required" and are designated by the *, and the name field has a default value of "[Enter name!]". The third line is a text box and the fourth makes radio buttons to select a hair color. After the input fields, there are three important lines in the end. The first makes a submit button with the label "Send Form", the second line is the subject of the email the receiver gets, and the third line formats the email using HTML. Like the table wizard, it is easier to use the form wizard rather than hand coding the forms. <b>Note:</b> For a form to work you must add an email address for the Recipient Email in its field.
ru: Здесь вводится основной текст элемента содержимого. Обычно возможно использовать некоторые теги форматирования HTML или воспользоваться Rich Text Editor. Поле по своему используется в других типах элементов содержимого, поэтому изменение типа может повлечь использование введенного здесь текста по другому. Используя это поле в типах содержимого "Текст" и "Текст с изображением", это поле соответствует простому тексту. Каждый переход строки соответствует параграфу, можно использовать специальный TYPO3 тег, &amp;lt;LINK&amp;gt;, для обозначения ссылок. Можно использовать многие HTML теги, но с некоторыми ограничениями, зависящими от настроек сайта. Rich Text Editor является общепринятым внешним интерфейсом для редактирования элементов содержимого "Текст" и "Текст с изображением". <b>Списки:</b> В типе "Список", каждая строка в этом поле представляет элемент списка. <b>Таблицы:</b> Если тип – "Таблица", каждая строка представляет строку таблицы. Каждая стрка разделяется на столбцы, вставкой вертикальной черты, |. Так для создания строки таблицы с 3 столбцами выглядит так: "Это - столбец 1 | Столбец 2 здесь | Третий столбец!". Используйте мастера таблицы для ее составления, что намного более просто чем их "кодирования". <b>Параметры:</b> Типы подобные "Форма" и "Мультимедиа" используют это поле для параметров, передаваемых элементу. А тип "HTML" принимает любое введенное значение, как необработанный HTML, который просто отображается на Web-сайте без какой-либо предварительной обработки. <b>Создание почтовой формы:</b> Выбрав элемент содержимого типа "Форма", нужно ввести строки параметров в это поле. Вот короткий пример: Ваше имя: | *name=input,40 | [Введите имя!] Ваш email: | *email=input,40 Ваш адрес: | address=textarea,40,10 Цвет Ваших волос: |hair=radio|Blue=blue, Red=red |formtype_mail = submit | Отослать форму |subject=hidden| Введите тему! |html_enabled=hidden | 1 Первые две строки создают поле вводы для имени и email, оба отмечены как "требуемые", установкой * в конце и у поля имя введено значение по умолчанию "[Введите имя!]". Третяя строка – текстовый блок, а четвертая создает переключатели для выбора цвета волос. В конце идут три важные строки. Первая создает кнопку подтверждения формы, с название "Отослать форму", вторая содержит тему email, отсылаемого получателю, а третяя помещает результат обработки формы в таблицу HTML. Намного проще использовать мастера создания форм. <b>Примечание:</b> перед тем, как заработает любая форма, нужно ввести адрес получателя. Для этого используется поле "Email получателя:" (фактически для этого используется поле подзаголовок!).

# colPos.description
source: Select the column position of this element. <strong>Notice:</strong> This may affect whether the Content Element is visible depending on your website template.
ru: Выберете в какую колонку поместить этот элемент. <strong>Примечание</strong> это затрагивает видимость элемента, в зависимости от используемого шаблона.

# colPos.details
source: Many websites only use one column of content. Some templates, however, let you put content in multiple columns using the Column option. <strong>Notice:</strong> Selecting a column other than "Normal" may cause the Content Element to disappear if the website template does not use that column. If your Content Element mysteriously disappears make sure the Column and Language selectors are set correctly.
ru: На большинстве сайтов используется лишь один столбец для содержимого. Но некоторые шаблоны позволяют располагать содержимое в нескольких столбцая, а этот параметр определяет в каких. <strong>Примечание</strong> выбрав здесь любой столбец, кроме "Обычный" может сделать элемент невидимым, если этот столбец не задействован в шаблоне сайта. Если элемент содержимого "никак" не появляется, проверьте установку параметров Столбец и Язык.

# cols.description
source: Select a fixed number of table columns
ru: Выберете определенное количество столбцов таблицы.

# CType.description
source: Select the kind of Page Content this element represents. New options will appear when you save the record.
ru: Выберете, какой тип содержимого страницы представляет этот элемент. При сохранении элемента появятся дополнительные параметры.

# CType.details
source: The 'Type' of content you select determines which options are available in the editing form so be sure to save the record before making other changes. This is a description of the various types: <strong>Header</strong> This type allows you to insert a standard Content Element header and nothing more. Almost all the other types described below also include the Header and its options. The Header type provides a way to insert a header without any other content. <strong>Text</strong> The Text type allows you to insert regular page content. It is generally used for text only content. <strong>Text & Images</strong> This is the same as the Text type (regular page content) but with the option of attaching images. <strong>Image</strong> The Image type allows you to insert image only page content. <strong>Bullet List</strong> Lets you create a bullet list. Each line in the text field will appear as a single bullet. <strong>Table</strong> Lets you create <em>simple</em> tables. Each line represents a row in the table and vertical bars ('|') separate each column. A popup wizard is also available. <strong>File Links</strong> Allows you to present a list of files for download. Thumbnails can be attached to the list and you can also display the file size. <strong>Form</strong> Lets you create mail forms using a special syntax or a popup wizard. <strong>Search</strong> This inserts a search box and also shows the search results when a search is performed on the page. <strong>Login</strong> Displays a login box for website users. This is only useful if you have already created website users and usergroups. <strong>Menu/Sitemap</strong> Offers a selection of menus and a sitemap you can insert on a page. <strong>Insert records</strong> This acts as placeholder for other records. With this Content Element, you can resuse multiple content elements from other pages. <strong>Insert plugin</strong> This will allows you to insert news, forums, guestbooks, lists of addresses, and other functionality. Plugins are typically provided by TYPO3 extensions. The available fields and required configuration depend on the extension. <strong>Divider</strong> This inserts a simple horizontal rule on a page. <strong>HTML</strong> This is plain HTML content. Anything added in the HTML Code of this Content Element will be displayed directly on the page without any preprocessing.
ru: "Тип" элемента влияет на параметры, отображаемые в форме его редактирования, поэтому удостоверьтесь, что сохранили запись перед дальнейшими ее изменениями. Вот описание различных типов: <strong>Заголовок</strong> Этот тип позволяет вставить стандартный заголовок элемента содержимого и ничего более. Почти все другие типы, описанные ниже, также включают заголовок в своих параметрах. Но тип Заголовок, просто предоставляет возможность вставки заголовка, и <em>ничего</em> более. <strong>Текст</strong> Позволяет вставить обычное содержимое страницы. Обычно используется для текстового содержимого. <strong>Текст с изображением</strong> То же, что и тип Текст (обычное содержимое страницы), но с возможностью вставки изображения. <strong>Изображение</strong> То же, что и Текст с изображением, но без текста. <strong>Список</strong> Позволяет создать список. Каждая строка в текстовом поле превращается в отдельный элемент списка. <strong>Таблица</strong> Позволяет создать <em>единственную</em> таблицу. Каждая строка преобразуется в строку таблицы, а вертикальная черта "|" разделяет колонки. Также доступен мастер, появляющийся во всплывающем окне. <strong>Ссылка на файл</strong> Предоставляет создать список файлов для скачивания. Можно вставить эскизы в список, также как и размер файлов. <strong>Форма</strong> Позволяет создавать почтовые формы. Существует специальный синтаксис для их создания. Также доступен мастер, появляющийся во всплывающем окне. <strong>Форма поиска</strong> Вставка поисковой формы с отображением результатов поиска, если запрос относится к странице. <strong>Форма авторизации на сайте</strong> Отображает форму регистрации/авторизации пользователей на сайте. Нужно создать хотя бы одного пользователя и их группу, перед тем как появиться смысл в ее использовании. <strong>Меню/карта сайта</strong> Предлагает на выбор различные меню ссылки и карты сайта, которые Вы можете вставить на страницу. <strong>Вставить записи</strong> Это место для размещения других записей. Другими словами, этот элемент позволяет прикрепить несколько других элементов содержимого с других страниц. <strong>Вставить дополнение</strong> Позволяет вставить новости, форум, гостевую книгу, список адресов, корзину покупок и т.п. Дополнения обычно предлагаются расширениями TYPO3. Доступные поля и требуемая настройка зависят от расширения. <strong>Разделитель</strong> На страницу помещается простая горизонтальная строка. <strong>HTML</strong> Обычный HTML код. Все, помещенное здесь, будет отображено на странице без какой-либо обработки.

# date.description
source: Enter a date to be displayed above the header.
ru: Введите данные, отображаемые под заголовком.

# .description
source: All visible content on webpages is typically made by "Page Content" records, often referred to as "Content Elements". Content Elements are managed by the "Page" Module which organizes Content Elements in multiple columns and languages.
ru: Все видимое наполнение web страниц в TYPO3 обычно формируется записями "Pagecontent", обычно упоминаемые как "Элементы содержимого". Часто Элементы содержимого управляются через модуль "Страница", спроектированный для обработки содержимого в нескольких колонках и на нескольких языках.

# .details
source: "Page Content" records are sortable and can be rearranged. The "Language" and "Column" selectors of the "Page Content" records determines when and where they appear. If you do not change the value of the "Language" and "Column" selectors the Content Element will appear in the default configuration.
ru: Записи "Pagecontent" идут в определенном порядке, который может быть изменен. Также помните, что выбор "Столбца" и "Языка" влияет на место и контекст появления содержимого. Если Вы не изменяли значения "Язык" и "Столбец", то можете быть уверенны, что содержимое сформируется по умолчанию.

# endtime.description
source: Enter the date when the Content Element should expire and disappear from the website.
ru: Введите дату, начиная с которой элемент содержимого будет скрыт на сайте.

# fe_group.description
source: If Usergroup Access Rights are set to a usergroup name, only website users who are logged in and members of the selected usergroup will be able to view the Content Element. The special option 'Hide at Login' means the Content Element will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the Content Element visible for any logged in website user.
ru: Если права доступа группы пользователей установлены на определенную группу, то только лишь входящие в нее внешние пользователи смогут видеть элемент содержимого. Специальный параметр "Скрыть после входа в систему" позволяет <em>скрыть</em> элемент от всех авторизованных на сайте пользователей. И наоборот, "Виден при любом входе" делает элемент видимым любому авторизованному пользователю.

# fe_group.details
source: The 'Hide at Login' option is is useful if you want to present information like "How to Login" that becomes irrelevant when a website user is actually logged in.
ru: Параметр "Скрыть после входа в систему" полезен для предоставления информации, например о том, как зарегистрироваться на сайте, которая уже не нужна после регистрации пользователя.

# filelink_size.description
source: Enable the display of file sizes.
ru: Включите, если нужно отобразить размер файла.

# header.description
source: Enter header text for the Content Element.
ru: Введите заголовок элемента содержимого.

# header.details
source: Almost all Content Elements will display this header above the content. If you don't want the header displayed, set the header Layout to "Hidden". You can also choose not to enter any content in this field. Some content element types do not display the header by default. In those cases the Header field is typically labeled "Name" instead. One example is the HTML Content Element.
ru: Почти все элементы содержимого (за исключением пожалуй лишь типа HTML), отображают заголовок над содержимым. Если Вы не желаете отображать заголовок, установите тип заголовка как "Скрытый". Или Вы можете ничего не вводить в это поле. Некоторые типы элементов содержимого не отображают по умолчанию заголовок. В этом случае поле заголовка называется "Название". Один из таких типов – элемент содержимого HTML.

# header_layout.description
source: Select a visual design for the header.
ru: Выберете внешний вид заголовка.

# header_layout.details
source: If you select "Default" the standard design (which is one of the layouts 1-5) will be used. Alternatively you can select from Layout 1 through 5 which are configured in the website template with individual visual designs. If you select "Hidden" the header will simply not appear. This is useful when you don't need a header to display on the website but still want to identify the Content Element in the Backend.
ru: Если Вы выберете "Стандартный", будет использован стандартный дизайн (одна из компоновок 1-5). Либо Вы можете выбрать компоновку с 1 по 5, которые настраиваются в шаблоне сайта, как индивидуальный визуальный дизайн. Выбрав "Скрытый", Вы скроете заголовок. Это нужно, если Вы хотите назвать свой элемент содержимого (для идентификации его во внутреннем интерфейсе), но не хотите отображать заголовок на web сайте.

# header_link.description
source: Creates a link from the header to a Page ID, email address, or URL.
ru: Создается ссылка от заголовка. Можно вставить id страницы, адрес email или URL.

# header_link.syntax
source: If you insert a Page ID (ex. 51), the link will point to the page with id=51 <em>inside</em> TYPO3. If you insert an email address (ex. name@my-domain.test), the link will point to that email address. If you insert an URL or domain, (ex. www.typo3.org or http://www.my-domain.org), the link will point to that website.
ru: Если Вы вставите id-номер, например "51", будет создана ссылка на страницу с id=51 <em>внутри</em> TYPO3. Если Вы вставите email адрес, например "name@my-domain.test", ссылка будет указывать на этот адрес электронной почты. Если Вы вставите URL или домен, например "www.typo3.com" или "http://www.my-domain.org", ссылка будет указывать на этот web сайт.

# header_position.description
source: Aligns the header to the left, center, or right.
ru: Выравнивание заголовка по левому, правому краю или по центру.

# hidden.description
source: Check this box if you wish to disable the Content Element and keep it from being displayed on the website.
ru: Установите этот флажок, если хотите скрыть элемент содержимого на веб сайте.

# imageborder.description
source: Displays a colored border around the images.
ru: Цветная рамка вокруг изображений.

# imagecaption.description
source: Enter captions for the images. For multiple images, enter one caption per line.
ru: Введите подписи для изображений. Для нескольких изображений вводите подписи построчно.

# imagecaption.details
source: By default, the caption is positioned below the images. However, your TypoScript template may be configured to allow individual image captions by setting "styles.content.imgtext.captionSplit=1" in your template constants. In this case, each line in this field will be the image caption of the corresponding image in the list. The caption text field is also used by the Content Element type "File Links" where each line represents a description of a file in the list.
ru: По умолчанию подпись позиционируется под всем блоком изображений. Но шаблон TypoScript может быть настроен для включения подписи для каждого изображения, посредством настройки "styles.content.imgtext.captionSplit=1" в константах шаблона. При этом каждая строка этого поля становиться заголовком соответствующего изображения в списке. Поле текста подписи также используется элементами содержимого типа "Ссылки на файлы", где каждая строка представляет собой описание соответствующего файла в списке.

# imagecaption_position.description
source: Aligns the image captions to the left, center, or right.
ru: Выравнивание подписей к изображениям по правому, левому краю или по центру.

# imagecols.description
source: Set the number of columns when the images are displayed in the Frontend of the website.
ru: Определите количество столбцов в блоке изображений при отображении во внешнем интерфейсе сайта.

# image_compression.description
source: Select image quality and image type options.
ru: Определить параметры сжатия и типа изображения.

# .image_descr
source: The Page Module is used to manage Content Elements arranged in columns and languages. A Content Element has an editing form with many options. The "Type" determines which options are visible. In the Frontend, a Content Element like the above could look like this.
ru: Модуль Страница используется для удобства управления элементами содержимого, упорядочивания их по столбцам и языкам. Элементы содержимого имеют большие формы редактирования со множеством параметров. "Тип" определяет выводимые параметры. Во внешнем интерфейсе – на web странице, элемент содержимого может выглядеть примерно так.

# image.description
source: Insert one or more images.
ru: Вставьте одно или несколько изображений.

# image.details
source: You can attach multiple images to the Content Element. Depending on the configuration of TYPO3, you can attach images in many formats without worrying about size and compression. TYPO3's graphics processing handles these details for you. When you use the "Text & Images" type, it's important to select a proper position for images. For this purpose, use the Position and Aligment selector. See link to "Page Content / Position" below. You can also display images in multiple columns and even enable an option that opens full size images when thumbnails are clicked.
ru: Можно прикрепить к элементу содержимого нужное количество изображений. В зависимости от настроек TYPO3, возможно использовать любой нравящийся формат, не беспокоясь о размере и сжатии, так как обработка происходит внутри TYPO3. При использовании типа "Текст с изображением", важно выбрать правильное положение блока изображений. Для этого используйте селектор положения и выравнивания. Смотрите ссылку на "Содержимое страницы / Положение" ниже. Можно отображать изображения в несколько столбцов и включить параметр, открывающий увеличенную версию изображения.

# image_effects.description
source: Select special image processing effects, such as rotation and color adjustments.
ru: Выберете специальный эффект для обработки изображения, например, поворот и настройка цвета.

# image_frames.description
source: Select special image framing options.
ru: Выберете специальные параметры обрамления изображения.

# imageheight.description
source: Enter the height (in pixels) for displaying the images in the Frontend of your website.
ru: Введите высоту изображения в пикселях для отображения во внешнем интерфейсе сайта.

# image.image_descr
source: This shows all the options related to inserting images in Content Elements. Depending on user permissions, you may not be able to use all of them.
ru: Здесь показаны все параметры, доступные для вставки изображения в элемент содержимого. В зависимости от разрешений пользователя, далеко не все из них могут быть доступны.

# image_link.description
source: Enter a link for the image. For multiple images, separate the links with commas.
ru: Определите ссылку для изображения. Для нескольких изображений разделяйте ссылки запятыми.

# image_link.details
source: By default all images share the same link. Your TypoScript template may be configured to allow a separate link for each image. If this is the case, you simply separate the links with a comma. See Page Content>Link below for details on syntax.
ru: По умолчанию, все изображения имеют одинаковую ссылку. Но можно попросить администратора настроить шаблон TypoScript так, чтобы для каждого изображения была отдельная ссылка. В этом случае можно ввести ссылки через запятую. Смотрите Содержимое страницы>Ссылка ниже для ознакомления синтаксисом.

# image_noRows.description
source: Disables tablerows in the image block.
ru: Отключение строк таблицы в блоке изображений.
