Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/4.5/*.locallang_csh_ttcontent.xlf
Languages: ru

# image_noRows.details
source: To illustrate, imagine you have 2 or more columns <em>and</em> rows of images. If one image in the upper row is taller than the second this will generate empty space beneath the second image. This is due to the normal flow in which the images are placed in table cells. If you enable the No Rows option, the table will place the images in a column into a single table cell which make the distance between them vertically identical throughout. This may provide a better look if the alternative is unacceptable.
ru: Это трудно поясняемый параметр, но вообразите, что имеется 2 или более столбцов <em>и</em> строк с изображениями. И если одно из изображений верхнего ряда находится немного выше соседнего, то под вторым изображением появится больший промежуток. Это происходит из-за того, что изображения помещаются в каждую ячейку таблицы. Включив этот параметр, получим, что все изображения в столбце будут находится в одной ячейки таблицы, поэтому они будут на равном расстоянии друг от друга. Возможно это будет лучше выглядеть.

# imageorient.description
source: Select the position and alignment of the images relative to the body text.
ru: Выберете позицию блока изображений по отношению к основному тексту.

# imageorient.details
source: The positions above and below the body text are pretty straight forward. The options for "In text" mean that images are displayed with text wrapped around them. When you select this option the template will probably force the images into smaller dimensions to accommodate the width of the template and the width of the text. The bodytext will float <em>under</em> the image block when it reaches the end of the image block. In other words, the body text <em>wraps around</em> the image block. If you select "In text" below the "No wrap" divider, the body text will not float under the image block, but simply continue in its column. Apart from the visual difference there is a technical aspect as well. If you choose to allow the content to wrap the image block you will experience a strange phenomenon when you do not have enough bodytext to make it float around the image: subsequent content elements on the page will appear to be layered on top of the image block. However it's easily solved by changing the "In text" position to the equal value but below the "No wrap" divider.
ru: Позиции выше и ниже основного текста довольно понятны. Параметр "В тексте" значит, что блок изображения отображается с обтеканием текста. Этот параметр возможно сделает изображение меньше, для сопоставления ширины изображения и текста ширине шаблона. Основной текст будет обтекать блок изображений <em>снизу</em> по достижении края этого блока. Другими словами, текст <em>обтекает</em> блок изображений. Выбрав пункт "Без обтекания", ниже "В тексте", можно сделать так, что основной текст не будет обтекать блок изображений, а просто будет продолжен в столбце под ним. Кроме визуального отличия, есть и технический аспект. Если вы позволите тексту обтекать блок изображения, и если текста будет недостаточно для полного обтекания – создается впечатление наслоения элементов содержимого на странице. Это легко устранить, изменив "В тексте" на аналогичное значение, но под разделителем "Без обтекания".

# imagewidth.description
source: Enter the width (in pixels) for displaying the image in the Frontend of your website.
ru: Введите ширину изображения в пикселях для отображения во внешнем интерфейсе сайта.

# imagewidth.details
source: The TypoScript template is normally configured with maximum image width so you shouldn't need to specify a width. In unique cases, this provides additional flexibility though.
ru: Обычно максимальная ширина изображения настраивается в шаблоне TypoScript, и Вам не нужно ничего вводить. Это обеспечивает лишь дополнительную гибкость для отдельных ситуаций.

# image_zoom.description
source: When enabled, clicking an image will open a larger version in a popup window.
ru: Включите этот параметр и для изображения будет сделана ссылка на его увеличенную версию во всплывающем окне.

# image_zoom.details
source: This option overrides the value in the Links field.
ru: Этот параметр переопределяет значение в поле Ссылки.

# layout.description
source: Select a Layout.
ru: Выберете шаблон.

# layout.details
source: This option does not work by default for all Content Elements but your website may display Content Elements differently depending on the layout. The File Links Content Element does make use of the Layout field by default: "Normal" will provide a list of file links with no thumbnail. "Layout 1" adds a file icon to the left of the link "Layout 2" adds a thumbnail for image files and an icon for other files. A black border is wrapped around the icon. "Layout 3" is similar to Layout 2, but without the black border.
ru: Этот параметр не используется в шаблоне по умолчанию для всех элементов содержимого, но на веб сайте возможно по разному отображать содержимое, в зависимости от шаблона. Элемент содержимого ссылки на файлы по умолчанию использует поле шаблона следующим образом: "Стандартный" – список ссылок без эскизов. "Компоновка 1" слева от ссылки добавляется значок файла. "Компоновка 2" добавляется эскиз для изображения для которого нет значка. Вокруг добавляется черная рамка. "Компоновка 3" то же, что и Компоновка 2, но без черной рамки.

# linkToTop.description
source: If checked, a small "To Top" link will be added after the Content Element, linking back to the top of the page.
ru: Если включено, после элемента содержимого появится ссылка "На верх", ведущая к началу страницы.

# list_type.description
source: Select a plugin to insert.
ru: Выберете вставляемое дополнение.

# list_type.details
source: The list of plugins you can insert on a page. The available plugins depend on which extensions are installed.
ru: Список дополнений, доступных для помещения на страницу. Зависит от установленных расширений.

# media.description
source: Files can be added to the list here.
ru: Дополните список файлов.

# menu_type.description
source: Select the type of menu you wish to create.
ru: Выберете тип создаваемого меню.

# menu_type.details
source: This is a short description of each type: <strong>Menu of selected pages</strong> This will create a menu with links to the pages in the Selected Pages list. <strong>Menu of subpages of selected pages</strong> This will create in a menu with links to the subpages of the pages in the Selected Pages list. If you do not specify any pages, the subpages to the current page will be used. <strong>Menu of subpages of selected pages (with abstract)</strong> Like the previous option, but also displays the content of the Abstract field (or the Description field) for each page in the menu. The Abstract field is given priority over the Description field if both are complete. <strong>Menu of subpages of selected pages + sections</strong> Like the previous option, but includes links to all Content Elements on the page that are marked to Show In Section Menus. <strong>Sitemap</strong> Generates a classic tree sitemap. Notice that the sitemap will begin from the current page unless you select another page instead. <strong>Section index (page content marked for section menus)</strong> This makes a menu of Content Elements on the selected pages for all Content Elements marked to Show In Section Menu. This is a great way to make an index at the top of the page. If you don't want certain Content Elements to appear in the list, just uncheck the Show in Section Menus checkbox for those elements. <strong>Recently updated pages</strong> This displays the 10 most recently updated pages. <strong>Notice:</strong> If you update a page and the updated page is not included in this list, clearing the Page Cache will resolve the issue. <strong>Related pages (based on keywords)</strong> Displays other related pages based on the keywords of the selected pages matched against the keywords of other pages.
ru: Вот краткое описание каждого типа: <strong>Меню выбранных страниц</strong> Список ссылок на страницы, вставленные в список "Исходная точка". <strong>Меню подстраниц выбранных страниц</strong> Общий список ссылок на подстраницы для страниц из списка "Исходная точка". Если страницы не определены, будут выбраны подстраницы текущей страницы. <strong>Меню подстраниц этих страниц с резюме</strong> Подобно предыдущему, но включая содержимое поля "Резюме" (или "Описание") этих страниц. Поле "Резюме" имеет приоритет при заполнении обоих. <strong>Меню подстраниц этих страниц с разделами</strong> Подобно предыдущему, но включая ссылки ко всем элементам содержимого на странице, с установленным параметром "Включить в меню". <strong>Карта сайта</strong> Отображает классическое дерево сайта. Помните, что карта сайта будет начинаться с текущей страницы, независимо от настроек страниц в поле "Исходная точка". <strong>Меню разделов (содержимое страниц, включенных в меню)</strong> Отображает меню с элементами содержимого этой страницы (или страниц, определенных в списке "Исходная точка"). Хорошая возможность создания содержимого в начале длинной страницы. Помните, что выбираются все элементы содержимого с включенным параметром "Включить в меню". Если не нужно представлять элемент в этом меню, просто снимите флажок "Включить в меню" в свойствах этого элемента. <strong>Недавно обновленные страницы</strong> Отображаются 10 последних обновленных страниц. <strong>Примечание:</strong> если, при обновлении страниц, эти страницы не появились в этом меню, просто очистите кеш страниц, и проблема разрешится. <strong>Связанные страницы (по ключевым словам)</strong> Отображаются связанные страницы, на основе ключевых слов, установленных для страниц.

# multimedia.description
source: Insert a multimedia element here (ex. Flash movie)
ru: Вставьте мультимедиа элемент, например ролик flash.

# pages.description
source: Select a target page or multiple target pages.
ru: Выберете целевую страницу или несколько таких страниц.

# pages.details
source: This field is used by many of the Content Element types to create a relation to either a single target page or multiple target pages. If no target page is specified, the current page will generally be used. Using the "Search" Content Element, the target page is where search results will appear. You must make sure that this page has a similar "Search" Content Element to display the results. The "Login" Content Element (not to be confused with the Login plugin available when the felogin extension is installed) also uses this field to redirect the login to a certain page. That page does not need to contain a "Login" Content Element in order to perform the authentication since any TYPO3 page can handle a login request. If you specify a second page in this list, the ID will be passed to the login system as the page inside TYPO3 where website users are found. You should use this only if your template is not already configured to pass this value on. In order for the login procedure to work you must make sure that you have created website users and website usergroups, have specified where these website users can be found (typically a SysFolder), a page ID in the page list, and ensured that cookies are enabled for the site. The "Menu/Sitemap" Content Elements also use this field. In this case the page will determine the starting point for the menu or the actual pages shown in the menu. This behavior depends on the menu type you have selected. Finally the "Form" element uses this field as the target page to which the form is submitted. A common use is the "Thank you" page after the form is completed.
ru: В этом поле можно создать связи со страницей (или несколькими) в TYPO3. Это поле используется многими типами элементов содержимого. Если страница не определена, будет использоваться текущая. В типе "Блок поиска", введенная страница будет целевой для результатов поиска. Удостоверьтесь, что на ней имеется аналогичный элемент типа "Блок поиска" для отображения результатов поиска. Иначе в этом не будет смысла. "Авторизация в системе" (не путайте со схожим дополнением, доступным при установке расширения felogin) также использует это поле для перенаправления при авторизации на определенную страницу. Но эта страница не обязательно должна содержать однотипный элемент, в случае успешной регистрации можно перенаправить пользователя на любую страницу TYPO3! Если в этом списке определена вторая страница, то ее ID будет передан в систему авторизации на сайте, как страница внутри TYPO3, где содержатся записи пользователей сайта. Используйте это, только если шаблон не настроен должным образом. Для работы процедуры авторизации в системе, нужно удостовериться, что созданы по крайней мере один пользователь и группа пользователей Web-сайта, и что в шаблоне TypoScript настроены страницы с записями пользователей (обычно Папки), что ID страницы определена в списке страниц и включены cookies для сайта. Элементы типа "Меню/карта сайта" также используют это поле. В этом случае страница определяет начальную точку меню или страницы, показываемые в меню. Это зависит от типа меню/карты сайта. И наконец, элементы типа "Форма" используют это поле, как страницу, на которую перенаправляется пользователь после подтверждения формы. Можно вставить страницу с информацией типа "Спасибо, с вами свяжутся".

# pi_flexform.description
source: Plugin Configuration
ru: Настройка дополнения

# pi_flexform.details
source: Some plugins may provide configuration options, but the actual options vary based on the plugin. Behind the scenes, these are based on FlexForms and stored as XML.
ru: Некоторые дополнения имеют определенные параметры настройки, которые сильно различаются для разных дополнений. Технически это реализовано в стиле FlexForm (хранится в виде XML).

# records.description
source: Insert records to be displayed on this page.
ru: Вставьте записи, которые нужно отобразить на этой странице.

# recursive.description
source: The number of subpage levels that should also be included for each page in the list.
ru: Выберете, сколько подуровней может быть дополнительно включено для каждой страницы из списка.

# recursive.details
source: This feature depends on the TypoScript template configuration and Content Element type. If enabled, each page listed in the "Pages" field will also have its subpages included to the specified depth. <strong>Warning:</strong> If there are many subpages, be aware that this option may return a large number of results
ru: Имеет ли эта возможность смысл или нет, зависит исключительно от реализации шаблона и/или типа элемента содержимого. Если эта возможность включена, то для каждой страницы из списка в поле "Страницы" будут включены и ее подстраницы с определенной глубины вложенности. <strong>Внимание:</strong> если здесь назначено много страниц. То с этим параметром будет выбрано невообразимое их количество!

# rte_enabled.description
source: If checked, the Rich Text Editor will be disabled for the "Text" and "Text & Image" types (<em>in this Content Element only</em>).
ru: Если включено, то редактор текста (Rich Text Editor) будет отключен для "Текста" и "Текста с изображением" (<em>лишь в этих элементах</em>)

# section_frame.description
source: Select indention or framing options for the Content Element.
ru: Определите параметры обрамления для этого элемента содержимого.

# sectionIndex.description
source: If set, the Content Element will appear in Section Menus.
ru: Если включено, элемент содержимого появится в меню разделов.

# sectionIndex.details
source: See more details about Section Menus by clicking below.
ru: Детали приведены в описании типов меню (щелкните ниже).

# _.seeAlso
source: Page Content Principles | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout
ru: Принципы работы с содержимым страницы | https://docs.typo3.org/typo3cms/GettingStartedTutorial/GeneralPrinciples/PageContent/, _MOD_web_layout

# select_key.description
source: Enter a special string to define the Content Element's operation or leave it blank for the default mode. Possible values depend on the Content Element being used.
ru: Введите определенную строку для определения поведения элемента содержимого, либо оставьте пустой для действий по умолчанию. Возможные значения зависят от типа используемого элемента содержимого.

# select_key.details
source: Whether or not the content of this field is used and how it's intepreted depends on the Content Element and/or plugin being used. It is considered obsolete for plugins today, but is used in some Content Elements such as File Links.
ru: Используется ли содержимое этого поля, зависит от элемента содержимого и/или используемого дополнения. На данный момент его не рекомендуется использовать, но пока употребляется в некоторых элементах содержимого, вроде Ссылки на файлы.

# spaceAfter.description
source: Bottom Margin (in pixels) inserts whitespace <em>after</em> this Content Element.
ru: Введите расстояние (в пикселях) <em>после</em> этим элементом содержимого.

# spaceBefore.description
source: Top Margin (in pixels) inserts whitespace <em>before</em> this Content Element.
ru: Введите расстояние (в пикселях) <em>перед</em> этим элементом содержимого.

# starttime.description
source: Enter the date when the Content Element should be published and displayed on the website.
ru: Введите дату, начиная с которой элемент содержимого будет опубликован и начнет отображаться на веб сайте.

# subheader.description
source: Enter a subheader to be displayed below the main header. If the Content Element is a "Form" this field is instead used as the Recipient Email.
ru: Введите подзаголовок. Он отображается под обычным заголовком. В случае "Формы", это поле – электронная почта получателя.

# subheader.details
source: A subheader is displayed only with "Header" Content Elements and with "Form" Content Elements (as the Recipient Email).
ru: Подзаголовок отображается только с типом элемента содержимого "Заголовок" и "Форма", где это поле называется "E-mail получателя:" и содержит электронный адрес получателя формы. Поэтому важно предоставить доступ к этому полю для пользователей.

# sys_language_uid.description
source: Select the system language of this Content Element. <strong>Notice:</strong> This will affect the Content Element visibility by limiting it to a certain language.
ru: Выберете системный язык для этого элемента. <strong>Примечание</strong> это затрагивает видимость элемента, ограничивая ее определенным языком.

# sys_language_uid.details
source: This allows you to assign a specific language to the Content Element. If you select anything but the default value, the element will <em>not</em> be visible unless the language assigned is also configured by the TypoScript template. The available system languages are created by the administrator.
ru: Позволяет назначить определенный язык для элемента содержимого. Выбрав что-либо, кроме значения по умолчанию, Вы <em>скроете</em> элемент, если только выбранный язык не был настроен в шаблоне TypoScript. Доступные в системе языки создаются администратором.

# table_bgColor.description
source: Select the table background color.
ru: Выберете фон таблицы.

# table_border.description
source: Select the table border thickness.
ru: Выберете толщину рамки таблицы.

# table_cellpadding.description
source: Select the table cellpadding.
ru: Выберете расстояние от рамки до содержимого ячейки.

# table_cellpadding.details
source: Cell padding is the 'internal' margin of a table cell. The distance is equally applied in all directions, top, bottom, left, and right.
ru: Это расстояние "внутрь" ячейки. Одинаковое расстояние по всем направлениям, сверху, снизу, справа и слева.

# table_cellspacing.description
source: Select the table cell spacing.
ru: Выберете расстояние между ячейками таблицы.

# table_cellspacing.details
source: Cell spacing is the distance between table cells in rows and columns. The distance is equally applied in all directions, top, bottom, left, and right.
ru: Это расстояние между ячейками в столбцах и строках. Одинаковое расстояние по всем направлениям, сверху, снизу, справа и слева.
