Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/4.5/*.locallang_csh_pages.xlf
Languages: ru

# abstract.description
source: Enter an abstract of the contents. It may be displayed in an overview of articles.
ru: Введите резюме содержимого. Оно может использоваться как краткий обзор статей.

# abstract.details
source: An abstract is a short description of the page content that might be a little longer than the one in the <i>Description</i> field. Unlike the description, the abstract is not meant for display in search engine result lists, but is instead intended for you own use. If you create a Content Element of type <i>Sitemap</i> and then choose <i>Menu of subpages to these pages (with abstract)</i> an overview of pages will be created. If an abstract is available for a page it will be used instead of the description. <b>Note:</b> You do not have to enter the text of the description into the <i>Abstract field</i> again. Admins can also make custom use of this field via their TypoScript templates.
ru: Резюме – это краткое содержимое страницы, которое может быть немного длиннее поля <i>Описание</i>. В отличии от описание, резюме не отображается в результатах поиска в поисковых машинах, оно предназначено для использования лишь в Ваших личных целях. По умолчанию, TYPO3 позволяет создавать элемент содержимого типа <i>Карта сайта</i>, выбрав тип <i>Меню подстраниц данных страниц (по резюме)</i> для создания резюме статей. При заполненном резюме, оно используется вместо описания. <b>Примечание:</b> не нужно вводить снова текст текст описания в <i>поле Резюме</i>. Конечно, администраторы могут по своему использовать это поле в своих шаблонах TypoScript.

# alias.description
source: A URL Alias is a unique identification string for a page. You can use this string instead of the ID number to refer to the page.
ru: "Псевдоним URL" – уникальная строка идентификации страницы. Можно использовать эту строку вместо идентификационного номера, для ссылки на страницу.

# alias.details
source: Ultimately a page is identified by its ID number. For example, you may access a page in TYPO3 at '.../?id=123'. If the page with ID '123' has the URL Alias 'one_two_three', then the URL '.../?id=one_two_three' would display exactly the same page, because 'one_two_three' is a URL Alias for the ID '123'. URL Aliases are normally assigned to only the most frequently used pages rather than all pages. In most TYPO3 configurations you would be able to use the syntax '.. &lt;link one_two_three&gt;go to the page&lt;/link&gt; ..' to create a link to the page. This is easier to remember. Another use is if you need to change which page a commonly used link points to. In this case you can delete the URL Alias for the original page and re-add it on the new page. All links using the URL Alias would now refer to the new page and its ID number.
ru: В конечном счете страница определеяется ее идентификационным номером. Например, в TYPO3 можно сослаться на страницу ".../? id=123". Если у страницы с id "123" есть псевдоним 'one_two_three', то по URL ".../? id=one_two_three" будет отображена та же самая страница, потому что "one_two_three" - псевдоним для id "123". Обычно, псевдонимы назначаются для ограниченного количества страниц, предположительно, связанным с большим числом страниц. В большинстве конфигураций TYPO3 можно использовать синтаксис ".. &amp;lt;link one_two_three&amp;gt;go to the page&amp;lt;/link&amp;gt; .." для создания ссылки на страницу. Это легко запоминается. Другое применение - изменение ссылок, которые должны вести на другую страницу. Можно удалить псевдоним с одной страницы и дать его другой, на которую теперь нужно ссылаться. При этом все ссылки, указывающие на страницу по псевдониму, будут физически указывать на страницу с другим id номером.

# alias.syntax
source: A URL Alias can contain only lowercase alphanumeric characters and must be unique. Please note: If the URL Alias already exists in the site, it will have a number added to the end of it.
ru: Псевдоним URL может содержать лишь строчные алфавитно-цифровые символы и должен быть уникальным. Пожалуйста помните: если введенное значение не было уникально, оно будет автоматически дополнено числом.

# author.description
source: Enter the page author's name.
ru: Введите имя автора страницы.

# author.details
source: Whether the author name is used or not depends on the setup of your TypoScript template. - You may use it in a meta-tag. - If you're using TYPO3 pages as 'articles' then you could use this field to display the name of the page (article) author.
ru: Как используется имя автора, зависит от настроек в шаблоне TypoScript. - Вы использовать его в мета-теге. - Если страницы TYPO3 используются как "статьи", можно использовать это поле как имя автора страницы (статьи).

# author_email.description
source: Enter the page author's email address.
ru: Введите e-mail адрес автора страницы.

# cache_timeout.description
source: Sets the Cache Lifetime for the page.
ru: Устанавливается время повторного кеширования для страницы.

# cache_timeout.details
source: By default, pages are cached for 24 hours. After 24 hours, the page is constructed again and rewritten to the cache. Depending on your configuration, the cache may be cleared at midnight. When specific pages need a longer or shorter cache lifetime than the default, this option can be used.
ru: По умолчанию, страницы хранятся в кеше в течение 24 часов. По истечению этого периода страницы заново формируются и обновляются в кеше. В зависимости от Вашей настройки, кеширование может обновлятся в полночь. В любом случае, здесь Вы можете установить другое время для обновления страниц в кеше. Этот параметр довольно редко используется.

# content_from_pid.description
source: If set, this is an alternative page to select Content Elements from. Whether this field is used depends on the website's TypoScript template.
ru: Если установлено, то это расценивается как id альтернативной страницы из которой будут взяты элементы содержимого. Применение зависит от реализации шаблона.

# description.description
source: Enter a short description of the page. It will be displayed in the result lists of most search engines.
ru: Введите короткое описание страницы, которое будет отображаться в списке результатов поисковых движков.

# description.details
source: Most websites insert this description in a meta-tag on the page, but you may have to configure this yourself in your TypoScript template. Most search engines will display the description in their result list. Thus, the text should be short (about 160 characters maximum), and its wording should make sense when it shows up in the result list. In addition, the description will be displayed if you create a Content Element of type 'Sitemap' and then choose the menu type <i>Menu of subpages to these pages (with abstract)</i>. If an abstract exists for the page, it will be used instead of the description. <b>Note:</b> Some search engines only use the description if the text is not found elsewhere in the content. So do not just repeat yourself.
ru: Большинство сайтов на TYPO3 используют описания в мета тегах страницы, но можно изменить шаблон TypoScript под собственные нужды. Поисковые системы отображают описание в списке результатов поиска. Поэтому текст не должен быть длинным (максимально около 160 символов), кроме того, в нем должен быть определенный смысл при его отображении. Также, описание будет отображаться, если Вы создадите элемент содержимого типа "Карта сайта", выбрав тип меню <i>Меню подстраниц данных страниц (по резюме)</i>. <b>Примечание:</b> некоторые поисковые машины используют описание, только если текст не найден в содержимом страницы. Так что не повторяйтесь.

# doktype.description
source: Page Type determines whether the page is normal webpage, a shortcut to another webpage, or used in other internal ways.
ru: Выберете тип страницы, определяющий, будет ли страница представлять обычную страницу во внешнем интерфейсе, ссылкой на другую страницу или предназначена для других целей.

# doktype.details
source: 'Standard' is the most common Page Type and is used for normal webpages. 'Backend User Section' is an option which creates pages that are only visible in the Frontend for Backend users who are logged in. <b>Link</b> 'Shortcut' pages jump to another page in the Pagetree. 'Mount Point' pages bring content from another branch of the Pagetree into the current branch. 'Link to External URL' is similar to 'Shortcut' but points to external URLs instead of TYPO3 pages. <b>Special</b> 'Folder' is a page type which is not shown as a webpage but is instead stores records of your choice. 'Recycler' is a garbage can. Pages and records in the Recycler are not visible in the Frontend. 'Menu Separator' is only useful if your Frontend memus are programmed to use it. It does not represent a page with content but is intended to be an unclickable placeholder in the menu. <b>Notice</b> Each Page Type is represented by a unique icon. The available page types can be restricted for users so all of the options described above may not be visible. Finally, particuilar record typoes may only be allowed on certain page types, but any record can be placed in a 'Folder.'
ru: "Стандартная" – наиболее часто используемый тип страниц, представляющий обычную страницу сайта. "Секция внутренних пользователей" – параметр, делающий страницу видимой лишь для внешних или внутренних пользователей, авторизованных на сайте. <b>Ссылка</b> Страница "Ссылка" перенаправляет к другой странице в дереве страниц. "Точка крепления" выводит содержимое из другой ветви дерева страниц в текущей ветви. "Внешняя ссылка" похожа на "Ссылку", но указывает на внешний URL, вместо внутренней страницы. <b>Специальные типы:</b> "Папка" - тип страницы, не видимый во внешнем интерфейсе как web страница, она используется для хранения выбранных Вами записей. "Корзина", может использоваться для скрытия страниц и записей из внешнего интерфейса. "Распорка" имеет значение, если используется в навигации во внешнем интерфейсе. При этом, она не представляет обычную страницу с содержимым, но будет просто пунктом в меню, который нельзя будет выбрать. <b>Примечание:</b> За каждым типом закреплен определенный значок. Определенные типы могут быть недоступны для пользователя. И наконец, каждому типу присущи его определенные настройки и каждый из них может содержать лишь определенные записи элементов, но в "Папку" можно поместить любые записи.

# _doktype.seeAlso
source: pages:shortcut, pages:url
ru: страницы:ярлык, страницы:url

# endtime.description
source: The Expiration Date specifies when the page will no longer be visible online.
ru: Время истечения публикации - дата, начиная с которой страница не будет видна в сети.

# endtime.syntax
source: See Page / Publication Date (click below)
ru: Смотрите Страница / Дата публикации (щелкните ниже)

# extendToSubpages.description
source: By default the Publication Date, Expiration Date, Usergroup Access Rights, and Page Visibility options <em>only</em> affect the page where they are set. If the option 'Extend to Subpages' is checked for the page, then all subpages are affected as well.
ru: По умолчанию Дата публикации, Срок истечения, Доступ и параметры Скрытия эффективны <em>только</em> для страницы на которой они установлены. Если установлен флажок "Включая подстраницы", то эти параметры будут наследоваться и на подстраницах этой страницы.

# extendToSubpages.details
source: Consider a scenario where you want to create a section of subpages that are only visible for logged in users. Setting the Usergroup Access Rights for the top page in the section would remove the page from menus if no user was logged in. However, the subpage could still be accessed by guessing the ID number of the page and entering it manually in the URL. Setting the 'Extend to Subpages' option would extend the Usergroup Access Rights from the top page through all subpages as well.
ru: Представим, что нужно создать целый набор подстраниц, видимых для авторизованных пользователей. Установка параметров "Доступа" для корневой страницы этого раздела удалит ее из меню, если пользователь не был авторизован. Однако доступ к подстраницам получить будет все еще возможно, дополнив URL параметром с id номером нужной страницы. Но, установив параметр "Включая подстраницы", мы установим те же параметры доступа, что и у корневой страницы, на подстраницах.

# extendToSubpages.image_descr
source: This page has access restricted to a certain group and has "Extend to Subpages" set as well. This is reflected in the way the page icon has changed.
ru: Такая страница имеет ограниченный определенной группой доступ с установленным флажком "Включая подстраницы". Эти условия отразились на внешнем виде ее значка.

# fe_group.description
source: If Usergroup Access Rights is set to a usergroup name, only website users who are members of the selected usergroup will be able to view the page. The special option 'Hide at Login' means the page will <em>not</em> be visible for any website users that are logged in. Likewise "Show at Any Login" will make the page visible for any logged in Frontend user.
ru: Если в "Доступе" выбрано название группы пользователей, то лишь ее члены смогут видеть эту страницу при регистрации. Специальный параметр "Скрыть после входа в систему", означает, что страница <em>не</em> будет видна пользователям web сайта после их регистрации на сайте. И наоборот, "Видна при любом входе", сделает страницу доступной для любых зарегистрированных на сайте пользователей.

# hidden.description
source: If this is checked, the page will be disabled on the website.
ru: Включив этот параметр, Вы скроете страницу на web сайте.

# hidden.details
source: The 'Disable,' 'Start,' 'Stop,' and 'Access' options are all about limiting access to pages and are thus related in functionality. When a page is not visible due to one of these options, the page will not show up in the site navigation. Notice, these options are related <em>only</em> to the page for which they are set. If you want their effect to cover the subpages as well, you must enable the 'Extend to Subpages' option. When you're logged in as a Backend user you can preview disabled pages if you have read access to them.
ru: Параметры "Скрыть", "Старт", "Стоп" и "Доступ" относятся к ограничению доступа к страницам и в этом они схожи по функциональности. В любом случае, страница, скрытая через эти параметры, не будет присутствовать в меню навигации сайта. Помните, что эти параметры относятся <em>только</em> к странице, для которой они установлены. Если Вы хотите, чтобы установка распространялась и на подстраницы, нужно включить параметр "Включая подстраницы" в разделе доступ. Войдя как пользователь внутреннего интерфейса, можно просмотреть скрытые страницы, конечно, если у Вас есть к ним доступ.

# hidden.image_descr
source: The page icon of a disabled page is dimmed and a red X is added. If you view a page that is hidden and you are logged in into the Backend you will still be able to see the page. The red "Preview" box will tell you that this page is visible to you because of this special circumstance.
ru: Значок скрытой страницы затемнен и к нему добавляется красный крестик. Вы можете просматривать скрытую страницу при регистрации во внутреннем интерфейсе. Красный квадрат с надписью "Preview", говорит Вам, что страница отображается для Вас ввиду специальных обстоятельств.

# keywords.description
source: Enter keywords for the page separated by commas. You may also use short phrases.
ru: Введите ключевые слова через запятую для данной страницы. Можно использовать короткие фразы.

# keywords.details
source: Most TYPO3 websites use these keywords in a meta-tag on the page, but you may have to setup the appropriate TypoScript template yourself. To optimize your page for search engines like Google you should not use more than 3 to 6 keywords. You should also make sure that the keywords are found in the content of the page. Note that search engine extensions for TYPO3 such as Indexed Search can also be configured to make use of the keywords. The keywords can also be used to create a menu of related pages. Create a Content Element of type 'Sitemap' and then choose the menu type <i>Related pages (based on keywords)</i>.
ru: Большинства сайтов на TYPO3 используют эти ключевые слова в мета тегах страницы, но можно изменить шаблон TypoScript под собственные нужды. Для оптимизации страницы для поисковых систем, подобных Google, не нужно использовать более 3-6 ключевых слов. Нужно удостовериться, что ключевые слова находятся в содержимом страницы. Помните, что использовать ключевые слова можно и в поисковых расширениях для TYPO3 (напр. Индексный поиск) при соответствующей их настройке. Ключевые слова в TYPO3 можно использовать и для создания меню страниц со сходной тематикой. Для этого создайте элемент содержимого типа "Карта сайта", в которой выберете тип меню <i>Связанные страницы (на основе ключевых слов)</i>.

# l18n_cfg.description
source: Affect availability of pages in the various languages.
ru: Влияет на доступность страниц на различных языках.

# l18n_cfg.details
source: <b>Hide default translation of page</b> If set, the page is only available in translated versions and not in the default language. Any attempt to access the page in the default language will result in an error message. <b>Hide page if no translation for current language exists</b> If set, any attempt to access the page in a translation that does not exist will result in an error message. By default, accessing an untranslated page will just show the default language instead.
ru: <b>Спрятать стандартный язык страницы</b> При включении, страница становиться доступной лишь на одном из языков. И любые попытки вывода страницы на языке по умолчанию закончатся сообщением об ошибке. <b>Спрятать страницу, если нет перевода данного языка</b> При установке, доступ к текущей странице без перевода на выбранный язык приведет к сообщению об ошибке. По умолчанию, при доступе к не переведенной странице будет показана страница на языке по умолчанию.

# lastUpdated.description
source: Enter the date and time of the most recent update to this page.
ru: Введите время и дату последнего обновления этой страницы.

# lastUpdated.details
source: How the value of this field is used is determined by the TypoScript template of the website. 'Last Update' content needs to be inserted on the pages and the TypoScript template must be configured to use this value. The most common use is to display the date from the automatically updated 'tstamp' field <em>unless</em> the 'Last Update' field is set. In this case, the date in 'Last Update' is used.
ru: Как используется значение этого поля, определяет шаблон TypoScript веб сайта. Сначала нужно вставить примечание "Последнее обновление" на страницы, а затем нужно настроить шаблона на использование этого значения. Обычно оно используется для автоматического отображения даты и времени последнего обновления страницы, <em>если</em> значение в это поле не будет принудительно вставлено.

# lastUpdated.syntax
source: The format is HH:MM DD-MM-YYYY or HH:MM MM-DD-YYYY depending on your TYPO3 configuration. If you insert a 'd' the current time and date is inserted. You can also append any value in the field with a number lie '+10' which will add 10 days to the current value.
ru: Формат : ЧЧ:ММ ДД-ММ-ГГГГ или ЧЧ:ММ ММ-ДД-ГГГГ, в зависимости от настроек TYPO3. Если вставить, например "d", то будет вставлено текущее время и дата. Можно вставить любое числовое значение в это поле, например "+10", что добавит 10 дней к текущему значению.

# layout.description
source: The Frontend Layout can change the way a page design appears.
ru: Шаблон внешнего интерфейса отвечает за внешний вид страницы сайта.

# layout.details
source: This option may not have any impact on the Frontend page design since it depends on whether the Frontend template uses it. Most templates do not use it.
ru: Этот параметр не может оказать влияние на дизайн страницы, так как он зависит от того, как (и если) шаблон внешнего интерфейса его использует. В большинстве шаблонов по умолчанию он не используется.

# media.description
source: Attach media files related to the page.
ru: Прикрепление мультимедийных файлов, связанных с текущей страницей.

# media.details
source: This field allows you to attach various files to the page, but how these files are used depends on your template. As an example the template could be use this field to allow a logo to be attached to the page or it might expect the first file to be an image used as a link in the navigation menu. Remember, this totally depends on how the template is programmed.
ru: Это поле позволяет прикрепить различные файлы к записи страницы. Как используются эти файлы, зависит от используемого шаблона. Например, это поле можно использовать для прикрепления логотипа к странице. Или можно запрограммировать шаблон, чтобы использовать первый прикрепленное изображение как ссылку в меню навигации. Но помните, это в основном зависит от того, как это поле запрограммировано в шаблоне.

# module.description
source: Define the page as containing a Frontend plugin.
ru: Определяет, что на странице имеется дополнение внешнего интерфейса.

# module.details
source: Setting this option lets the Backend knows this page contains specific content or has a specific purpose, such as containing a forum or acting as the root page of a shop section on the website. Based on this setting the Backend is able to display a shortcut list as well as relevant functionality in the 'Web>Modules' module. The Frontend display is largely not affected. Marking a page as containing a 'Shop' plugin simply means it'll show up in the shortcut list of modules in the backend. For additional details on this option, refer to the administration documentation. It's recommended that only admin-users have access to this field!
ru: Установка этого параметра позволяет быстро определить во внутреннем интерфейсе, что страница предназначена для определенных целей, например, содержит форум, или что это корневая страница раздела магазина на web сайте. И на основе этого, во внутреннем интерфейсе возможно отобразить список ссылок на основе сходной функциональности в модуле "Веб>Модули". На внешнем интерфейсе это в основном не сказывается. Отметка страницы, как содержащей дополнение "Магазин", просто скажется на списке ссылок на модули во внутреннем интерфейсе. Дополнительные сведения по этому параметру имеются в документации по управлению. Рекомендуется ограничить доступ к этому полю только лишь пользователями-администраторами!

# mount_pid.description
source: Mount this page. If set, subpages of this page come from the Mounted Page instead.
ru: Сделать текущую страницу точкой доступа. Если установлено, подстраницы этой страницы будут взяты из точки доступа.

# mount_pid.details
source: In the Frontend this is done by adding a new variable, &MP, to the URL. This links the mounted branch to the main branch by pairing page ids.
ru: Во внешнем интерфейсе это осуществляется посредством добавления новой переменной &MP к URL, связывающей ветвь из точки доступа с основной ветвью, спаривая id страниц.

# mount_pid_ol.description
source: Show content for the current page or replace it completely with the Mounted Page.
ru: Отображение содержимого для текущей страницы или его полная замена на монтируемую страницу.

# nav_hide.description
source: With this option the page will be not appear in menus in the Frontend. The page can still be viewed if linked by going directly to its URL.
ru: Включение этого параметра, спрячет страницу из меню навигации по web сайту во внешнем интерфейсе. Но страница все еще будет доступна по ее непосредственному URL.
