Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/impexp/*.locallang_csh.xlf
Languages: ru

# action.alttitle
source: Import Action
ru: Действия при импорте

# action.description
source: Press "Preview" to see the content of the import file or update the preview display according to changed configurations. Press "Import"/"Update" if you want to perform the actual import. Before importing make sure you change any editable soft references that are shown in the preview data.
ru: Нажмите "Предварительный просмотр" для просмотра содержимого импортируемого файла или обновите предварительный просмотр для соответствия сделанным изменениям в настройках. Нажмите "Импорт"/"Обновить", если вы хотите импортировать текущие данные. Перед импортом убедитесь, что все редактируемые гибкие ссылки, отображаемые в предварительном просмотре, изменены.

# action.image_descr
source: Example of the result view after importing. As you can see the RTE attached images (soft references) has been written to new file names and the difference view tells you that the names changed in the bodytext content.
ru: Пример результирующего отображения после импорта. Как видно, прикрепленное в RTE изображение (гибкая ссылка) было записано с новым названием, а отображение различий говорит, что изменились названия в текстовом содержимом.

# .alttitle
source: Import/Export
ru: Импорт/экспорт

# .description
source: Native Import/Export module for TYPO3 data. Can export single records, content of tables, single pages or whole branches of the page tree. Includes attached media like image and preserves relations between records. Exports only to TYPO3 specific format, either a binary format (.T3D) or XML. The format is meant for exchange between TYPO3 systems.
ru: Встроенный модуль TYPO3 для импорта данных. Можно импортировать одну запись, содержимое таблиц, страницы или целые ветви дерева страниц. Можно включать прикрепленные медиа файлы, например изображения, и сохранять отношения между страницами. Экспорт производиться только в определенный формат TYPO3, либо бинарный формат (.T3D) или XML. Формат используется для обмена между системами TYPO3.

# enableLogging.alttitle
source: Enable System Logging
ru: Включить журнал

# enableLogging.description
source: If you set this the system backend log will be filled with entries for all the actions that the import actually performs. By default this is left out for the sake of clarity.
ru: При включении, системный журнал внутреннего интерфейса будет заполнен записями о реально совершенных действиях при импорте. По умолчанию отключено.

# excludedElements.alttitle
source: Excluded elements
ru: Исключить элементы

# excludedElements.description
source: By the "Exclude" checkbox you can exclude specific records from the preview display of the export. Which records has been picked for specific exclusion is listed here. You can also clear the exclusion configuration.
ru: Записи с флажком "Исключить" не будут включены в экспорт. Здесь можно посмотреть список исключенных из экспорта записей. Можно также очистить установленные исключения.

# export.alttitle
source: Exporting records from TYPO3
ru: Экспорт записей из TYPO3

# export.details
source: There are a number of methods by which you can export data from TYPO3: - Export a single page or branch of the page tree (use page icon context menu) - Export a single record from any page (use record icon context menu) - Export all records from a specific table on a specific page (using the Web>List module) - Export an arbitrary selection of records from the clipboard (using the Web>List module) The export format observes all TYPO3s methods for relations between the records in the export file. But you will have to configure how these relations are maintained, at least to some degree. Sometimes you would want to include records referred to, at other times you surely want to keep the original mapping. That depends on your objectives with the export. Regardless of your configuration for export you will always see a complete reflection of all chosen records and their internal relations in the preview display found in the bottom of the export module page. <b>Error messages:</b> Remember to consult the Message-tab before exporting if there are any error messages there!
ru: Существует несколько способов экспорта данных из TYPO3: - Экспорт одной страницы или ветви из дерева страниц (щелчком по значку страницы для вызова контекстного меню). - Экспорт одной записи с любой страницы (щелчком по значку записи для вызова контекстного меню). - Экспорт всех записей из определенной таблицы на определенной странице (используя модуль Веб>Список). В формате экспорта сохраняются все методы, используемые в TYPO3, для соблюдения отношений между записями. Но вы должны настроить до некоторой степени, как эти отношения будут поддерживаться. Иногда нужно включать записи, на которые имеются ссылки, иногда нужно сохранить оригинальную разметку. Это зависит от цели экспорта. Независимо от настроек экспорта, вы всегда будете видеть общую картину, все выбранные записи и их внешние ссылки, в предварительном просмотре внизу страницы модуля экспорта. <b>Сообщения об ошибках:</b> не забудьте свериться перед экспортом с вкладкой Сообщения, нет ли там каких либо сообщений об ошибках!

# export.image_descr
source: To export a page or record, simply click the icon and select "Export" from the context menu. With the Web>List module you can also export all records from a table by first clicking the table title to see only this table, then next to the CSV export you will find the export button for a T3D export of the table. You can export the contents of the clipboard as well by simply selecting "Export" in the menu.
ru: Для экспорта страницы или записи, просто щелкните по значку и выберете "Экспорт" из контекстного меню. В модуле Веб>Список, можно экспортировать все записи из таблицы, сначала щелкнув по ее заголовку для ее просмотра, а затем, рядом с кнопкой CSV экспорта, вы найдете кнопку T3D экспорта этой таблицы. Можно экспортировать содежимое буфера обмена, просто выбрав "Экспорт" в меню.

# extensionDependencies.alttitle
source: Extension Dependencies
ru: Зависимости от расширений

# extensionDependencies.description
source: Select which extensions should be installed in the import system in order for your exported content to work correctly. Examples could be "templavoila" for templating, "css_styled_content" for the template, "tt_news" for a news archive etc.
ru: Выберете, какие расширения должны быть установлены на целевой системе, для корректной работы экспортируемого содержимого. Например, для шаблонов это может быть "templavoila", "css_styled_content" и "tt_news" для системы новостей.

# extensionDependencies.details
source: During import warnings will appear for all selected extensions from this list which were not installed.
ru: При импорте будут выведены предупреждения для всех выбранных в списке не установленных расширений

# fileFormat.alttitle
source: File format options
ru: Формат файла

# fileFormat.description
source: You can export your records to a TYPO3 specific binary format (serialized PHP array) called "T3D". Alternatively you can select a plain-text XML export which potentially can be imported by other applications written to support this format. However the schema of the XML is TYPO3 specific.
ru: Можно экспортировать записи в специфичный бинарный формат TYPO3 (сериализованны массив PHP), называемый "T3D". Либо можно выбрать экспорт в виде простого текста XML, который в принципе может быть импортирован в другие приложения, поддерживающие этот формат. В любом случае здесь используется специальная схема XML для TYPO3.

# fileFormat.details
source: Generally you should use the T3D format, preferably compressed. The T3D compressed format normally yields a size about 10 times less than the XML format which is bloaded due to the plain-text nature of the format. With "Max size of files to include" you can set a limit to the size of attached files to records. This is useful if you have large PDF files or videoclips attached to records which you do not desire (or do desire!) to include; then with this limit you can adjust whether they are allowed in or not. Entering a file name to save to makes it possible to write your export directly to a file (pressing "Save to filename") instead of downloading it (pressing "Download export"). The correct file extensions depending on file format is automatically applied. Files are saved in a proper filemount in "fileadmin/". This is shown to you upon saving. Existing files are overwritten.
ru: В основном нужно использовать формат T3D, предпочтительно сжатый. Сжатый формат T3D имеет размер, примерно в 10 раз меньший, чем формат XML, сделанный на основе обычного текстового формата файлов. Установив "Максимальный размер файла (kb)", можно ограничить размер прикрепленных к записям файлов. Это полезно, если имеются большие PDF файлы или видеоклипы, прикрепленные к записям, которые вы не желаете (или желаете!) включать; этим размером можно откорректировать подобные разрешения. Введя название файла, возможно произвести экспорт непосредственно в файл (нажав "Сохранить в файл") вместо его загрузки (нажав "Загрузка экспорта"). The correct file extensions depending on file format is automatically applied. Файлы сохраняются в соответствующей папке в "fileadmin/". Что будет показано при сохранении. Существующие файлы перезаписываются.

# htmlCssResources.alttitle
source: Exclude resources from HTML and CSS files
ru: Исключить HTML/CSS файлы

# htmlCssResources.description
source: When an HTML or CSS file is found as a soft reference the files are parsed for references to external media (such as images) and if any are found they are also exported. If you don't want this behaviour, click this option.
ru: Если найдены гибкие ссылки на файлы HTML или CSS, они обрабатываются на предмет поиска внешних файлов (например изображений), и если они найдены, то также экспортируются. Если это не нужно, включите этот параметр.

# htmlCssResources.details
source: Notice: Resources found inside an HTML or CSS file are not analysed further. For instance it means that any CSS files referred to from within an HTML will not be traversed - but CSS files referred to inside the Setup or Constant field of a TypoScript template record will be!
ru: Примечание: найденные вне HTML или CSS файлов ресурсы, не анализируются. Например, это значит, что любые CSS, на которые ссылаются из HTML не будут анализироваться, но CSS файлы, на которые ссылаются из поля Настроек или Констант в записе шаблона TypoScript будут проанализированы!

# htmlCssResources.image_descr
source: In this example you can see that a soft reference has been found pointing to an HTML file inside fileadmin/ Since it was an HTML file it was parsed and further a number of files were found referenced inside it and now included with the export. This feature is specifically created to support export of template configurations where external HTML files play a role.
ru: В этом примере можно увидеть, что были найдены гибкие ссылки, указывающие на HTML файл внутри fileadmin/. Так как это был файл HTML, он был проанализирован и в нем были найдены ссылки на несколько файлов, которые были включены в экспорт. Эта функция была специально разработана для поддержки экспорта настроенных шаблонов, в которых внешние HTML файлы играют огромную роль.

# .image_descr
source: Example of the preview display during export configuration of a page. Notice how records on the page are include plus how references inside the record is found and included as well (bottom of screen).
ru: Пример предварительного просмотра настроек страницы экспорта. Обратите внимание как включаются записи на странице и как находятся и включаются ссылки со страницы (низ экрана).

# import.alttitle
source: Importing TYPO3 records
ru: Импорт записей TYPO3

# importFile.alttitle
source: Select file to import
ru: Выбор импортируемого файла

# importFile.description
source: The files displayed are those with an extension T3D or XML from fileadmin/, fileadmin/export/ and your "TEMP" folder (if any).
ru: Здесь отображаются файлы с расширениями T3D или XML из fileadmin/, fileadmin/export/ и папки "TEMP" (если они есть).

# inclRelations.alttitle
source: Include relations
ru: Включая связи к таблицам

# inclRelations.description
source: Configure the tables from which you want to include records that are found as relations in the main export configuration.
ru: Настройка таблиц, записи из которых нужно включить, так как на них существуют ссылки из уже экспортируемых таблиц.

# inclRelations.details
source: Background: When you export a record in TYPO3 it might contain relations to other records in the system. You have to tell the export interface what to do with these relations. Basically there are three scenarios: - If relations are found between records that are all in the export configuration, there is no problem: The relations are automatically mapped to the new id's of those records when imported. - If the records related to are not included the relation will be lost (indicated with an error message in the preview) unless you a) either select that table in this selector box in which case all relations to that table will be included or b) if you set the table as a static table (in which case the relation is untouched and imported as-is - but which will of course break if no record with that UID is found in the import system). <b>Soft References:</b> Soft references are when a record contains pointers to external files or records but in fields where there are no formal relation configured. Examples of this is when a content element contains a "&lt;link 123&gt;" tag that represents a link to the page 123. This is not picked up formally as a reference, but is found anyhow as a "soft reference". The same goes for &lt;img&gt; tags with images from eg. "fileadmin/". By default soft references pointing to records or files will act as normal references; either including the referenced item or showing an error. However you can also choose to exclude the handling of individual soft references or maybe set the value as "editable" upon import. This is done with a selector box in the export preview.
ru: За сценой: при экспорте записи в TYPO3, они могут содержать ссылки на другие системные записи. Нужно сказать системе экспорта, что ей делать с этими связями. Существуют три основных сценария: - Не возникает проблем, когда все связи находятся в одной экспортируемой предустановке: ссылки автоматически перестраиваются при импорте. - Если запись, на которую ссылаются не включена, отношения будут потеряны (отображается сообщение об ошибке на предпросмотре), чтобы избежать этого можно а) включить таблицы на которые существуют ссылки или б) установить жесткие связи для таблиц (в любом случае, отношения остаются нетронутыми и импортируются "как есть", но если записи с таким UID не будет найдено системой импорта, то ссылка конечно же окажется битой). <b>Гибкие связи:</b> гибкие связи возникают, когда запись содержить указание на веншние файлы или записи, но поля не содержать формально настроенных связей. Например, элемент содержимого содержит тег "&lt;link 123&gt;", представляющий ссылку на страницу 123. Формально это не является ссылкой, но будет в любом случае найдено как "гибкая связь". То же самое для тега &lt;img&gt; для изображения из, например "fileadmin/". По умолчанию, гибкие связи, указывающие на записи или файлы будут действовать как нормальные ссылки; либо включая элемент, на который ссылаются, либо произодет ошибка. Однако можно исключить обработку отдельных гибких ссылок или усановить "редактируемое" значение при импорте. Это можно сделать в предпросмотре экспорта.

# inclRelations.image_descr
source: This example shows tree examples of references; a) an image attached to a content element, b) a relation to a frontend usergroup UID, and c) a soft reference found in the bodytext field of a record, here it is the link-tag pointing to the page with UID 1. Notice in the previous image how the relation to the frontend user group was lost. This has been corrected in this screenshot where the fe_group table has been selected in the list of table for which to include relations. The result is that the frontend usergroup is included as a record outside the exported pagetree. If you wanted to keep the relation but not include the usergroup you have to set "fe_groups" as a static table instead. See below. This example shows a TypoScript Template Record where multiple soft references has been found. The first one is an email address. Here it is configured to be editable. This means that upon import the user will have a chance to edit the value before the import is actually done. This is very useful when exported files are used as templates. Another example includes a PHP script which we don't want to include in the export and therefore we have selected the exclude option for the soft reference.
ru: В этом примере показано три вида ссылок; a) изображение, прикрепленное к элементу содержимого, b) ссылка на UID группы внешних пользователей, и c) гибкая ссылка, найденная в поле основного текста записи, здесь это тег, указывающий на страницу с UID 1. Обратите внимание как было утеряна ссылка на группу внешних пользователей на предыдущем рисунке. Это было исправлено на этом рисунке, где таблица fe_group была включена для сохранения связей. В результате группа внешних пользователей включена как запись вне экспортируемого дерева страниц. Для сохранения отношений, без включшения группы внешних пользователей, нужно выбрать "fe_groups" как таблицу с жесткими связями. Смотрите ниже. Этот пример демонстрирует запись шаблона TypoScript, в которой было найдено множество гибких ссылок. Первая – это адрес email. Здесь он настроен как редактируемый. Это значит, что во время импорта пользователь сможет изменить это значение. Это полезно для использования файлов экспорта в качестве шаблонов. А другой пример включает сценарий PHP, который не должен быть экспортирован, поэтому для него выбран параметр исключения гибкой ссылки.

# metadata.alttitle
source: Meta data setting
ru: Дополнительные данные

# metadata.description
source: Set meta data for the export. This is highly encouraged if your exported content goes into eg. a template collection of sorts.
ru: Установка дополнительных данных для экспорта. Будет очень полезно, если экспортируемое содержимое будет собрано, например в коллекцию шаблонов по видам.

# no-presets
source: No presets found!
ru: Заданий не найдено!

source: Notes
ru: Замечания

# options.alttitle
source: Import options
ru: Параметры импорта

# options.description
source: Various options for import.
ru: Различные параметры для импорта

# options.details
source: <b>Do not show differences in records</b> When a structure has been imported you will see a difference view of all records which tells you whether the written content matched the import data or if not, what changed. In many cases content <i>should</i> change (eg. relations and file references) so it is not an error if you see red and green values. Basically the difference view is a feature you can use for visual validation of the import success. It brings piece-of-mind to those who is enlightened to understand what it tells... :-) Green strings represent the actual written data while red represents the original value from the import file and black represents data that is the same. <b>Allow to write banned file extensions (eg. PHP scripts), if any</b> Also an option for admins-only; Allows PHP-files (for example from soft references in TypoScript templates) to be written to the system. This is normally not allowed behavior for security reasons.
ru: <b>Не показывать отличия между записями</b> После импортирования структуры, будут видны различия между всеми записями, говорящие, соответствует ли импортированное содержимое записанным данным или нет, что изменилось. В большинстве случаев, содержимое <i>должно</i> измениться (напр. связи или ссылки на файлы), таким образом, если вы видите красные или зеленые значения, это не обязательно ошибки. Основное назначение просмотра различий – возможность визуальной проверки результатов импорта. Это полезно тем, кто знает что хотел сделать... :-) Зеленые строки представляют записанные данные, в то время как красные – оригинальные значения в импортируемом файле, а черные – не изменившиеся данные. <b>Позволить записывать файлы с запрещенными расширениями (например, PHP скрипты), если таковые имеются</b> Также параметр только для администраторов; позволяет перезаписывать PHP-файлы (например из гибких ссылок в шаблонах TypoScript) в системе. По умолчанию это запрещено по причинам системы безопасности.

# options.image_descr
source: Options for import. Here you are told that this PHP file cannot be allowed - because you didn't select the option "Allow to write banned file extensions (eg. PHP scripts), if any"
ru: Параметры импорта. Здесь Вам скажут, что этот PHP файл не может быть записан, потому что не установлен параметр "Позволить записывать файлы с запрещенными расширениями (например, PHP скрипты), если таковые имеются".

# pageTreeCfg.alttitle
source: Configuration of page tree export
ru: Настройка экспорта дерева страниц

# pageTreeCfg.description
source: Here you configure how a page or a branch of the page tree should be exported. Using the selector box you can set the number of levels of subpages to include in the export. By default all records belonging to a page is included when a page is exported.
ru: Здесь настраивается экспорт страницы или ветви из дерева страниц. Используя выпадающий список, можно выбрать количество экспортируемых уровней страниц. По умолчанию включены все записи, начиная с текущей страницы.

# pageTreeDisplay.alttitle
source: Page Tree
ru: Дерево

# pageTreeDisplay.description
source: Based on the levels selected for page tree export this will show the structure that is about to be exported. If any pages are specifically excluded by the exclude option they are not shown either.
ru: На основе выбранных уровней дерева страниц для экспорта, будет отображена структура экспорта. Если какие-либо страницы специально исключены, они также не будут показаны.

# pageTreeMode.alttitle
source: Levels
ru: Уровней

# pageTreeMode.description
source: Here you select how deeply in the page tree from the current starting point to go for this export.
ru: Здесь выбирается глубина экспортируемого дерева страниц, начиная с текущей.

# pageTreeMode.details
source: If you select "Expanded tree" it will base the export on the currently expanded levels of the page tree. Another special option is "Tables on this page" which will not include the page record itself but only include records from tables on the page, depending on the table configuration of course.
ru: Если выбрано "Развернутое дерево", экспортируются лишь в данный момент развернутые ветви дерева страниц. Другой параметр "Таблицы на этой странице", при этом сама по себе запись страницы не будет включена в экспорт, там будут присутствовать лишь записи из таблиц, расположенных на этой странице, конечно в зависимости от их настроек.

# pageTreeRecordLimit.alttitle
source: Include tables
ru: Включая таблицы

# pageTreeRecordLimit.description
source: When you export a page all records on the page is included by default. By this selector you can pick which tables to include exclusively if there are certain records you are not interested in seeing included.
ru: При экспорте страницы, все записи на ней по умолчанию включаются. Здесь можно выбрать, какие записи не представляют интереса и их не нужно включать в экспорт.
