Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/impexp/*.locallang_csh.xlf
Languages: ru

# pageTreeRecordLimit.details
source: In the box "Max number of records" you can set a limit to how many records are selected from a single table. This is a runaway brake in case you have an unusual large amount of records from a table.
ru: В поле "Максимальное количество записей" можно ограничить количество включаемых в одну таблицу записей. Это способ ограничения записей, если их количество огромно.

# presets.alttitle
source: Configuration presets
ru: Предустановленные настройки

# presets.description
source: Enables you to save an export configuration for later re-use. Useful if you need to export the same configuration with regular intervals.
ru: Позволяет сохранить настройки экспорта для дальнейшего повторного использования. Полезно для регулярного повторного использования экспорта.

# presets.details
source: In the "Select preset" box you can select any previously saved preset to load. If you are exporting a page the presets listed will be those found for the start page ID. For records, any preset can be loaded. To load a preset, select it in the selector and press "Load". If you press "Merge" instead the settings from the preset will be merged with the current configuration. This is meaningful in cases where you select multiple individual tables or records. To save a preset, simply enter a title in the title box and press "Save". This will create a new preset. If you press save while having selected an existing preset you will overwrite it. To delete old presets, simply select it and press "Delete". The checkbox "Public" can be set if you want to share your preset with other users of the system. Otherwise they are personal to you. In the Taskcenter you can see a list of your presets and jump directly to them.
ru: В поле "Выбрать предустановку" можно загрузить сохраненную в прошлом предустановку. Если экспортируется страница, будут найдены предустановки для ID начальной страницы. Для записей могут быть загружены любые предустановки. Для загрузки предустановки, выберете ее в списке и нажмите "Загрузить". Если нажать "Объединить", то текущие настройки будут объединены с выбранной предустановкой. Это полезно в случае экспорта нескольких единичных таблиц или записей. Для сохранения настройки как предустановки, просто введите ее название и нажмите "Сохранить". Будет создана новая предустановка. Если нажать "Сохранить", предварительно выбрав предустановку, она будет перезаписана. Для удаления старых предустановок, выберете их и нажмите "Удалить". Флажок "Общедоступно" нужно включить, если хотите сделать предустановку доступной для других пользователей системы. Иначе она создается только для вас. В Центре заданий можно увидеть все сделанные предустановки и перейти непосредственно к ним.

# presets.image_descr
source: The preset selector in the export interface. Presets from the task center.
ru: Выбор предустановок для экспорта. Предустановки из центра заданий.

source: Single record
ru: Одна запись

# singleRecord.alttitle
source: Export single record
ru: Экспорт единственной записи

# singleRecord.description
source: This overview tells you which independent records has been independently selected for export.
ru: Это резюме включенных для экспорта независимых записей.

# singleRecord.image_descr
source: The way to export multiple records like this is using the clipboard like shown below.
ru: Способ экспорта нескольких записей - использование буфера обмена, как показано ниже.

# staticRelations.alttitle
source: Set static tables
ru: Использовать жесткие связи для таблиц

# staticRelations.description
source: Select which tables in addition to the static TYPO3 tables to keep relations untouched for. Takes precedence over "Include relations" configured tables.
ru: Выберете, какие связанные таблицы, в дополнение к статическим таблицам TYPO3 нужно сохранить. Имеет приоритет над настройкой "Включая связи к таблицам".

# staticRelations.details
source: By default all relations to static tables in TYPO3 are kept untouched. Of course those static tables should be present in the import system in order for this to work correctly. However there might be circumstances where you move information between two systems where theoretically non-static tables should just keep relations untouched. Examples could be "sys_languages" or TemplaVoila data structures / template objects where two systems might contain the same set of records in those tables while you are importing pages and content elements freely.
ru: По умолчанию все связи со статическими таблицам в TYPO3 сохраняются. Конечно эти статические таблицы должны присутствовать при импорте для обеспечения правильной работы. Но при некоторых обстоятельствах, при перемещении информации между двумя системами в которых теоретически лишь нестатические таблицы должны сохранить связи. Примерами могут быть "sys_languages" или структуры данных/объекты шаблона TemplaVoila, потому что две системы, вполне вероятно, могли бы содержать те же записи в тех же таблицах, при этом можно просто импортировать страницы и содержащиеся на них элементы.

# staticRelations.image_descr
source: In this example you see how a number of records are pointing to a System Language record which will become lost relations when imported because the record is not included in the export. However; in the target system the System Languages are exactly the same and therefore you just want a static mapping of the relations. The static mapping is obtained by selecting the "sys_language" table as a static template meaning that the relations are kept at their current values assuming that they will be exactly the same in the target system when imported.
ru: В этом примере показано, что несколько записей указывают на запись Системного языка, и при импорте связь будет потеряна, потому что запись не включена в экспорт. Но, в целевой системе Системный язык тот же и поэтому нужно просто указать статическую разметку ссылок. Статическая разметка получается при выборе таблицы "sys_language", как жестко связанной, что значит сохранение текущих значений ссылок. То есть все ссылки в целевой системе остануться такими же, как и в текущей.

# tableList.alttitle
source: Table export
ru: Экспорт таблицы

# tableList.description
source: Export of all records on a page from a specific table. This is configured from the Web>List module where you will have to select table-only view and click a button in the top of the page.
ru: Экспорт всех записей на странице из определенной таблицы. Настраивается из модуля Веб>Список, где нужно выбрать для просмотра единственную таблицу и щелкнуть по кнопке вверху страницы.

# tableList.details
source: Tip: You can select multiple table lists by simply saving each selecting as a preset and finally load/merge the selections together.
ru: Совет: можно выбрать несколько таблиц, просто сохранив каждую как предустановку и в конце загрузить/объединить выбранное вместе.

# tableList.image_descr
source: Here two tables from different pages are selected. This is done by first selecting the one, saving it as a preset, then select the other and merge with the saved preset. Here you see how to use the Web>List module to export all records from a table on a page.
ru: Здесь выбраны две таблицы с разных страниц. Сначала была выбрана первая таблица и сохранена как предустановка, после чего была выбрана вторая и объединена с сохраненной предустановкой. Здесь можно видеть, как используется модуль Веб>Список для экспорта всех записей из таблицы на странице.

# tableListMaxNumber.alttitle
source: Max number to export
ru: Максимальное количество записей для экспорта

# tableListMaxNumber.description
source: Run-away brake that will make sure a large amount of records does not halt the interface. Default is 100, but you can change it to anything you like of course.
ru: Способ избежания ошибок при экспорте огромного количества записей. По умолчанию ограничение установлено на 100, но конечно же его можно изменить.

# task.icon
source: Icon
ru: Значок

# task.meta
source: Meta data
ru: Дополнительные данные

# task.own
source: Own
ru: Свое

# task.owner
source: Owner
ru: Владелец

# task.page
source: Page
ru: Страница

# task.path
source: Path
ru: Путь

# task.public
source: Public
ru: Общее

# task.title
source: Preset title
ru: Название задания

# update.alttitle
source: Update instead of Insert
ru: Обновление

# update.description
source: By default the import operation inserts new records in the system. Using this option will update existing records.
ru: По умолчанию, операция импорта вставляет новые записи в систему. Этот параметр используется для обновления существующих записей.

# update.details
source: There are certain requirements you have to meet if you want the "Update" process to work. The main thing is that the records updated are those with the SAME uid as the uid in the export file. Thus an update operation only makes real sense if the export and import systems are somehow related and the same UIDs can be expected in both ends. Otherwise it will be a mess! When you update page structures the import operation will automatically try to rearrange records so they also appear in the same hierarchy and order as in the export file. This can be disabled by checking the option "Ignore PID differences globally". In any case you can set individual records to Ignore/Respect the PID with a selectorbox in the preview. In the preview display you can also select if individual records should be flatly ignored during import or if you want them created as new records instead of being updates. As a help for managing updates the preview display will inform you about the path where the existing element with that UID is found. Use this to verify that you get what you expect! <b>Forcing the UID:</b> If you intend to update a system and some elements from the import are not mappable to a UID already (ei. does not exist) you can choose in the preview display to force the UID during creation. This is an unorthodox thing to do since UIDs are normally created automatically by the database. The option makes most sense if you are trying to "synchronize" a copy of another system. The option may mess up certain database internals and the feature is therefore only available for admins.
ru: Существует несколько требований, которым должен соответствовать процесс "Обновления". Главное из них то, что обновляемые записи должны иметь ТЕ ЖЕ САМЫЕ uid, что и uid в экспортируемом файле. Таким образом, обновление имеет смысл, если системы в которых производился экспорт и импорт так или иначе связаны, и в них используются одинаковые UID. Иначе произойдет смешение! При обновлении структуры страниц, операция импорта будет автоматически стараться переставить записи так, чтобы они максимально соответствовали иерархии файла экспорта. Это можно отключить, установив параметр "Игнорировать общие различия в PID". В любом случае, для каждой отдельной записи можно установить соответствующий параметр в предварительном просмотре. В предварительном просмотре также можно выбрать игнорирование отдельных записей при импорте или, вместо обновления, создание новой записи. В качестве помощи при управлении обновлением, предварительный просмотр информирует о пути по которому найден существующий элемент с UID. Используйте это для сравнения желаемого результата с получаемым! <b>Принудительные UID:</b> Если при обновлении системы некоторые элементы из импортируемого файла с UID не размечены (т.е. не существуют), можно выбрать в предварительном отображении, принудительно создать UID. Это не ортодоксальная вещь, так как обычно UID автоматически создаются базой данных. Параметр имеет смысл при попытке синхронизации с другой системой. Этот параметр может внести сумбур в существующую базу данных, поэтому доступен только для администраторов.

# update.image_descr
source: In Update mode you can select various settings for each record. You will also be able to see a diff-view where the differences between the existing record and the one from the import is shown.
ru: В режиме обновления можно задавать различные параметры для каждой записи. Можно также просмотреть различия между существующими в базе данных записями и импортируемыми.

# upload.alttitle
source: Upload import file
ru: Загрузить файл локально с компьютера

# upload.details
source: Notice that there are usually limits set by the server (PHP) to the size of uploaded files at around 2 MB in which case nothing will happen.
ru: Помните, что обычно установлено ограничение на размер загружаемого файла на сервере (PHP), примерно в 2 мегабайта.
