Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/linkvalidator/Resources/Private/Language/*.locallang.xlf
Languages: ru

# mod_linkvalidator
source: Linkvalidator
ru: Проверка ссылок

# tasks.error.invalidEmailTemplateFile
source: The email template file is not existing!
ru: Файл шаблона письма не существует!

# tasks.error.invalidFromEmail
source: Invalid format of the email address in the from header
ru: Неверный формат адреса в заголовке От

# tasks.error.invalidToEmail
source: Invalid format of one or more of the recipient email addresses!
ru: Неверный формат одного или нескольких адресов получателей!

# tasks.error.invalidTSconfig
source: Invalid TSconfig in the task configuration!
ru: Неверный TSconfig в настройке задачи!

# tasks.error.noSubject
source: No subject for the notification email
ru: Не указана тема для отчётного письма

# tasks.validate.conf
source: Overwrite TSconfig
ru: Переназначить TSconfig

# tasks.validate.depth
source: Depth
ru: Глубина

# tasks.validate.description
source: Search for broken links and store the result into the temporary table tx_linkvalidator_link in order to ease up the backend module.
ru: Поиск битых ссылок и сохранение результатов во временной таблице tx_linkvalidator_link для упрощения работы модуля.

# tasks.validate.email
source: Send email report to
ru: Отослать письмо с отчётом на

# tasks.validate.emailOnBrokenLinkOnly
source: Send email on new broken links only
ru: Отсылать письмо только при появлении новых битых ссылок

# tasks.validate.emailTemplateFile
source: Email template file
ru: Файл шаблона для письма

# tasks.validate.invalidDepth
source: There is no depth set, please set it to one of the offered values!
ru: Ну указана глубина, установите приемлемое значение!

# tasks.validate.invalidEmail
source: Invalid email format!
ru: Неверный формат письма!

# tasks.validate.invalidPage
source: Invalid page uid, please enter a valid page uid!
ru: Неверный uid страницы, введите верный!

# tasks.validate.name
source: Linkvalidator
ru: Проверка ссылок

# tasks.validate.page
source: Start page (uid)
ru: Начальная страница (uid)
