Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/BlockElements/*.locallang.xlf
Languages: ru

# Blockquote-helpText
source: Makes a large quotation block
ru: Создание большого блока цитаты

# Blockquote-Tooltip
source: Large quotation
ru: Большая цитата

# FormatBlock-Tooltip
source: Type of block
ru: Тип блока

# Indent-helpText
source: Increases text indentation
ru: Увеличение отступов в тексте

# Indent-Tooltip
source: Increase indent
ru: Увеличить отступ

# InsertHorizontalRule-helpText
source: Inserts an horizontal rule
ru: Вставка горизонтальной линии

# InsertHorizontalRule-Tooltip
source: Horizontal Rule
ru: Горизонтальная линия

# InsertOrderedList-Tooltip
source: Ordered List
ru: Маркированный список

# InsertParagraphAfter-contextMenuTitle
source: Insert paragraph after
ru: Вставить параграф после

# InsertParagraphAfter-helpText
source: Inserts a paragraph after the current block
ru: Вставка параграфа после текущего блока

# InsertParagraphAfter-Tooltip
source: Insert a paragraph after the current block
ru: Вставить параграф после текущего блока

# InsertParagraphBefore-contextMenuTitle
source: Insert paragraph before
ru: Вставить параграф перед

# InsertParagraphBefore-helpText
source: Inserts a paragraph before the current block
ru: Вставка параграфа перед текущим блоком

# InsertParagraphBefore-Tooltip
source: Insert a paragraph before the current block
ru: Вставить параграф перед текущим блоком

# InsertUnorderedList-helpText
source: Makes a bulleted list from the current selection
ru: Создание нумерованного списка из выделения

# InsertUnorderedList-Tooltip
source: Bulleted List
ru: Нумерованный список

# JustifyCenter-helpText
source: Centers the text
ru: Выключить текст по центру

# JustifyCenter-Tooltip
source: Center
ru: Центрировать

# JustifyFull-helpText
source: Aligns the text both to the left and the right
ru: Выключить текст по ширине

# JustifyFull-Tooltip
source: Justify left and right
ru: Выровнять текст по ширине

# JustifyLeft-helpText
source: Aligns the text to the left
ru: Выключка текста влево

# JustifyLeft-Tooltip
source: Justify left
ru: Выровнять влево

# JustifyRight-helpText
source: Aligns the text to the right
ru: Выключить текст вправо

# JustifyRight-Tooltip
source: Justify right
ru: Выровнять вправо

# Left-Tooltip
source: Left
ru: Слева

# No block
source: No block format
ru: Блок без форматирования

# Outdent-helpText
source: Reduces text indentation
ru: Уменьшение отступов в тексте

# Outdent-Tooltip
source: Reduce indent
ru: Уменьшить отступ

# Remove block
source: Remove block format
ru: Удалить форматирование блока

# Technische Universitat Ilmenau
source: Technische Universität Ilmenau
ru: Технический университет Ильменау
