Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_sysfilestorage.xlf
Languages: ru

# .description
source: File storage, which acts as an entry root point to a file-based structure. See it like a drive or a hard drive volume in your local machine.
ru: Файловое хранилище, выполняющее роль отправной точки для файловой структуры. Рассматривайте его как носитель или раздел жёсткого диска на вашем компьютере.

# description.description
source: A description of this storage.
ru: Описание данного хранилища.

# description.details
source: This description field is used to explain e.g. the location of the storage, also what this storage is meant for or what it contains.
ru: Поле описания используется, например, чтобы пояснить расположение хранилища, для чего оно нужно или что содержит.

# driver.description
source: Choose the driver as the technical backbone of the storage. Once you've chosen a driver, and saved it, additional configuration will show up.
ru: Выберите драйвер, на котором будет основано хранилище. После выбора драйвера и сохранения изменений появятся дополнительные настройки.

# driver.details
source: The driver is the technical background of a storage, and thus also defines whether the location of the storage is local (= on the same machine as this TYPO3 installation) or remote like a WebDAV server connection. Search for extensions in the TYPO3 Extension Repository that extend this driver list.
ru: Драйвер - технологическая суть хранилища, помимо прочего определяющая, является ли хранилище локальным (читай - находится на той же машине, что и сама установленная система TYPO3), либо удалённым, вроде соединения с сервером WebDAV. Ищите в репозитории расширения TYPO3, дополняющие список драйверов.

# hidden.description
source: Disabling the storage will result in removing it from any listings in the backend. Existing file relations will still exist.
ru: Отключение хранилища приведёт к исчезновению его из всех списков в панели управления. Существующие файловые связи останутся прежними.

# hidden.details
source: If you set up a file storage, it will show up on any folder lists, thus allowing to basically browse through the files in this file repository. If you set this checkbox, this storage will be excluded from any listings in the backend. Any existing file references will still exist further.
ru: Если вы создаёте хранилище, оно отображается во всех списках папок, тем самым позволяя просматривать файлы в этом репозитории. Если вы установите этот флаг, данное хранилище будет исключено изо всех списков панели управления. Все существующие файловые связи останутся прежними.

# is_browsable.description
source: If set, backend users can browse through this storage. Otherwise it will show up as a unselectable item in the list.
ru: Если установлено, внутренние пользователи смогут использовать это хранилище. Иначе оно будет видно, как недоступный элемент в блоке выбора.

# is_online.description
source: This flag is usually set. If TYPO3 cannot connect to this storage (because it maybe temporary down), then the flag will be checked, and the storage will behave like it is non-browsable in the TYPO3 backend. The admin needs to manually activate it again if it was offline.
ru: Этот флаг обычно установлен. Если TYPO3 не может получить доступ к этому хранилищу (возможно, из-за временных неполадок), то это проверяется и хранилище будет рассматриваться как недоступное из интерфейса управления TYPO3. Администратору необходимо будет вручную снова его подключить.

# is_public.description
source: If set, then the files in this storage can be linked directly from the outside world. If this is not set, make sure to provide additional possibilities to access the files in this storage.
ru: Если установлено, то файлы в этом хранилище могут быть доступны извне напрямую. Если не установлено, то убедитесь, что возможен доступ к файлам этого хранилища.

# is_writable.description
source: If set, then users are allowed to modify, add, delete files/folders on this storage.
ru: Если установлено, то пользователям разрешено изменять, добавлять, удалять файлы/папки этого хранилища.

# name.description
source: The visible identifier for this file storage.
ru: Отображаемый идентификатор данного файлового хранилища.

# name.details
source: The label entered here will be shown as the name for the entry point in the TYPO Backend. Be sure to make it descriptive and logical for your editors.
ru: Введённая здесь метка будет отображаться как имя точки входа в панели управления TYPO3. Постарайтесь сделать её логичной и понятной для редакторов.
