Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_ttcontent.xlf
Languages: ru

# image.details
source: You can attach images to the content element and almost as many as you like. Depending on the configuration of TYPO3 you can even attach them in any format you like. Especially you do not need to worry about size and compression because these factors are normally handled by TYPO3 internally. When you use the "Text & Images" type, it's important to select a proper position of the image block. For this purpose, use the Position selector which is displayed below (or if you click in the image list field in the Classic backend). See link to "Page content / Position" below. You can also display images in multiple columns and enable an option which enables a link so you can click the image and see a bigger version. Just to name a few options. Most likely you don't have all options available. This depends on your permissions in the system.
ru: Вы можете прикрепить к элементу содержимого нужное количество изображений. В зависимости от настроек TYPO3, Вы можете использовать любой нравящийся Вам формат. И даже особенно не беспокойтесь об их размере и сжатии, так как их обработка происходит внутри TYPO3. При использовании типа "Текст с изображением", важно выбрать правильное положение блока изображений. Для этого используйте селектор полжения ниже (или щелкните по полю списка изображений в Классическом внутреннем интерфейсе). Смотрите ссылку на "Содержимое страницы / Положение" ниже. Можно отображать изображения в несколько рядов и включить параметр ссылки, показывающей увеличенную версию изображения. Это лишь несколько параметров. Обычно доступны не все настройки. Это зависит от настройки ваших прав в системе.

# image_effects.description
source: Select special image processing effects.
ru: Выберете специалный эффект для обработки изображения.

# image_frames.description
source: Select special image framing options.
ru: Выберете специальные параметры обрабмления изображения.

# imageheight.description
source: Enter the height of the image in pixels.
ru: Введите высоту изображения в пикселях.

# image.image_descr
source: This shows all the options related to inserting images in Content Elements. You might not be able to use all of them.
ru: Это откроет все параметры, доступные для вставки изображения в элемент содержимого. Далеко не все из них вам понадобятся.

# image_link.description
source: Enter a link for the images.
ru: Определите ссылку для изображения.

# image_link.details
source: By default all images share the same link. However you may ask the administrator to configure the TypoScript template to allow a separate link for each image. If this is the case, you simply separate the link values by a comma. See Page content>Link below for details on syntax.
ru: По умолчанию, все изображения имеют одинаковую ссылку. Но Вы можете попросить администратора настроить шаблон TypoScript, чтобы для каждого изображения была отдельная ссылка. В этом случае можно ввести ссылки через запятую. Смотрите Содержимое страницы>Ссылки ниже для ознакомления с деталями синтаксиса.

# image_noRows.description
source: Disables strict tablerows in the image block.
ru: Отключает строгие строки таблицы в блоке изображения.

# image_noRows.details
source: This options is kind of hard to explain, but imagine you have 2 or more columns <em>and</em> rows of images. If one image in the upper row is a bit taller than the second this will generate an empty extra space beneath the second image. This is due to the normal procedure in which the images are placed in a table cell each. If you set this option, the table will place all images in a column in a single table cell which make the distance between them vertically identical throughout. This may provide a better look if the alternative looks stupid.
ru: Это трудно поясняемый параметр, но вообразите, что у вас есть 2 или более колонок <em>и</em> строк изображений. И если одно изображение в верхнем ряду немного выше второго, то это создаст больший промежуток во втором ряду между верхним и нижним изображением. Это происходит из-за того, что изображения помещаются в каждую ячейку таблицы. Включив этот параметр, то все изображения в столбце будут в одной ячейки таблицы, поэтому они будут на равном расстоянии друг от друга. Возможно это будте лучше восприниматься.

# imageorient.description
source: Select the position of the imageblock relative to the body text.
ru: Выберете позицию блока изображений по отношению к основному тексту.

# imageorient.details
source: The position above and below the body text is pretty straight forward. The options "In text" means that the image block is displayed with text aside it. When you select this option the template will probably force the images into smaller dimensions because they cannot take up the same space when text is supposed to float around them. When you select "In text" you can choose the options either above or below the divider "No wrap". If you select the "In text" option above, the bodytext will float <em>under</em> the image block when the bodytext reaches the end of the image block. So in other words the body text <em>wraps around</em> the image block. If you select "In text" below the "No wrap" divider, the body text will not float under the image block, but simply continue in its column. Apart from the visual difference there is a technical aspect as well. Because if you choose to allow the content to wrap the image block you will experience a strange phenomenon when you do not have enough bodytext to make it float around the image: You experience that the subsequent content elements on the page is somehow layered on top of the image block - and this certainly looks like a bug. However it's easily solved by changing the "In text" position to the equal value but below the "No wrap" divider.
ru: Позиции выше и ниже основного текста довольно понятны. Параметр "В тексте" значит, что блок изображения отображается с обтеканием текста. Выбирав этот параметр, шаблон уменьшит изображения, чтобы они занимали меньше места, оставляя пространство для текста. Выбрав "В тексте" можно уточнит, ниже, выше или "Без обтекания". Выбрав "В тексте" выше, основной текст будет обтекать изображение <em>снизу</em> при достижении начала блока изображений. Другими словами, текст <em>обтекает</em> блок изображений. Выбрав "В тексте" ниже "Без обтекания", текст не будет продолжаться под блоком изображений, а просто заполнит всю колонку. Кроме визуального отличия, есть и технический аспект. Если вы позволите тексту обтекать блок изображения, и если текста будет недостаточно для полного обтекания – создается впечатление, что происходит наслоение элементов содержимого на странице. Это легко утранить, изменив "В тексте" на аналогичную но "Без обтекания".

# imagewidth.description
source: Enter the width in pixels of the image.
ru: Введите ширину изображения в пикселях.

# imagewidth.details
source: The template is normally configured to a max width of an image and so you don't need to specify the width if the image fits perfectly into those dimensions. However this does give you an opportunity to specify a specific width.
ru: Обычно максимальная ширина изображения настраивается в шаблоне и Вам не нужно ничего вводить, если используемое изображение соответствует этим размерам. Но можно определить и нужную, определенную ширину.

# image_zoom.description
source: Check this option, and the image will link to a new window with a bigger version.
ru: Включите этот параметр и для изображения будет сделана ссылка на его увеличенную версию

# image_zoom.details
source: This option overrides the value in the Link-field.
ru: Этот параметр переопределяет значение в поле ссылки.

# layout.description
source: Select a layout.
ru: Выберете схему.

# layout.details
source: This option is not used in the default templates but may be used by any custom rendering. There are a number of default implementations depending on the content element type: <b>"Filelinks":</b> "Normal" will provide a list of filelinks with no thumbnail. "Layout 1" adds a file icon to the left of the link "Layout 2" adds a thumbnail if the file is an image file and if not an icon. A black border is wrapped around. "Layout 3" is like Layout 2, but without the black border.
ru: Этот параметр не используется в шаблоне по умолчанию, но может использоваться для дополнительной обработки. Количество реализаций по умолчанию зависит от типа элемента содержимого: <b>"Ссылки на файлы":</b> "Обычный" – список ссылок без эскизов. "Макет 1" слева от ссылки добавляется значек файла. "Макет 2" добавляется эскиз для изображения для которого нет значка. Вокруг добавляется черная рамка. "Макет 3" то же, что и Макет 2, но без черной рамки.

# linkToTop.description
source: If checked, a little "To top" link will be inserted after the content element.
ru: Если включено, после элемента содержимого появится маленькая ссылка "На верх".

# list_type.description
source: Select a plugin to insert.
ru: Выберете вставляемое расширение.

# list_type.details
source: The list of plugins you can insert on a page. The available plugins depends on which extensions are installed.
ru: Список расширений, которые Вы можете вставить на страницу. Можно вставить установленные расширения.

# media.description
source: Add files to the list here.
ru: Дополните список файлов.

# menu_type.description
source: Select which kind of menu you wish to create.
ru: Выберете тип создаваемого меню.

# menu_type.details
source: This is a short description of each type: <strong>Menu of these pages</strong> This will create a list of links to the pages you insert in the Startingpoint list. <strong>Menu of subpages to these pages</strong> This results in a list of links to the subpages of the pages in the Startingpoint list. If you do not specify a startingpoint, subpages to the current page will be selected. <strong>Menu of subpages to these pages (with abstract)</strong> Like the previous, but this will include the content of the Abstract field of the pages. <strong>Menu of subpages to these pages + sections</strong> Like the previous, but including 'submenu' links to all content elements on the page which has the "Index" checkbox set. <strong>Sitemap</strong> Generates a classic tree sitemap. Maybe your TypoScript template is configured to another design of the sitemap, but anyhow you'll get a sitemap out of this. Notice that the sitemap will begin from the current page unless you specify another "Startingpoint" page in the list below. <strong>Section index (page content w/Index checked)</strong> This makes a menu to the content elements on this page (or the page specified in the Starting point list). Great way to make an index in the top of the page. Notice that all content elements with the "Index" checkbox set is selected. So if you don't want certain content elements to appear in the list, just un-check the Index checkbox for those elements. <strong>Recently updated pages</strong> This displays the 10 most recently updated pages. <strong>Notice:</strong> If you update a page and this list seems not to be updated instantly, just clear the cache of the page and the problem is solved. <strong>Related pages (based on keywords)</strong> Displays other related pages based on the keywords set for this page matched up with the keywords on other pages. <b>Notice:</b> With many of the above menu types, the default starting point is the current page. However you can specify another startingpoint (or more than one in fact!) by adding pages to the "Startingpoint" list. See link below.
ru: Вот краткое описание каждого типа: <strong>Меню этих страниц</strong> Список ссылок на страницы, вставленные в список "Исходная точка". <strong>Меню подстраниц этих страниц</strong> Общий список ссылок на подстраницы страниц, находящихся с списке "Исходная точка". Если Вы не определите исходной точки, будут выбраны подстраницы исходной страницы. <strong>Меню постраниц этих страниц с резюме</strong> Подобно предыдущему, но включая содержимое поля "Резюме" этих страниц. <strong>Меню постраниц этих страниц с разделами</strong> Подобно предыдущему, но включая ссылки "подменю" ко всем элементам содержимого на странице, с установленным параметром "Включить в меню". <strong>Карта сайта</strong> Отображает классическое дерево сайта. Возможно Ваш шаблон TypoScript спроектирован для другого дизайна карты сайта, но Вы получите карту сайта не зависящую от него. Помните, что карта сайта будет начинаться с текущей страницы, независимо от настроек страниц в поле "Исходная точка". <strong>Меню разделов (содежимое страниц, включенных в индексирование)</strong> Отображает меню с элементами содержимого этой страницы (или страниц, определенных в списке "Исходная точка"). Хорошая возможность создания содержимого в начале длинной страницы. Помните, что выбираются все элементы содержимого с включенным параметром "Включить в меню". Поэтому, если Вы не хотите представить элеменит в этом меню, просто снимите флажок "Включить в меню" для этого элемента. <strong>Недавно обновленные страницы</strong> Отображаются 10 последних обновленных страниц. <strong>Примечание:</strong> если, при обновлении страниц, эти страницы не появились в этом меню, просто очистите кеш страниц, и проблема разрешится. <strong>Связанные страницы (по ключевым словам)</strong> Отображаются связанные страницы, на основе ключевых слов, установленных для страниц. <b>Примечание:</b> исходная точка многих перечисленных типов меню - текущая страница. Но можно определить другую исходную точку (или даже несколько!), добавив их в список "Исходная точка". Смотрите по ссылке ниже.

# multimedia.description
source: Insert the multimedia element, eg. a flash movie here.
ru: Вставьте мультимедиа элемент, например ролик flash.

# pages.description
source: Insert page(s)
ru: Вставить страницу(ы)

# pages.details
source: With this field you can generally create a relation to a page (or more) in TYPO3. This field is used by many of the content element types. If you don't specify a page here, the current page will generally be used. Using the "Search" type, the page you insert will be the page to which the search is targeted. You must make sure that this page has a similar "Search" content element (or something similar) to render a search result. Else it makes no sense. The "Login" type content element also uses this field to direct the login to a certain page. However that page does not need to contain a Login content element in order to perform the authentication - you can in fact submit a login request to any TYPO3 page and it will be evaluated! If you specify a second page in this list, the id will be passed to the login system as being the page inside TYPO3 where the database of users to look up is found. You should use this only if your template is not configured to pass this value on. In order for the login procedure to work, you must make sure that 1) you have created at least one Website user and member usergroup and is using the correct username and password, 2) you have configured in your TypoScript template on which page (typically a SysFolder) the users can be found - or alternatively have specified this by the second page in the this page list, 3) cookies must be enabled. The "Menu/Sitemap" element also uses this field. In that case the page(s) will determine from which point the menu is drawn or maybe even represent the actual pages to which the menu links. All this depends on the subtype of Menu/Sitemap you have selected. Finally the "Form" element uses this field as the page to which the form is submitted. You might thus insert a page which is the "Thank you" page of the form mail.
ru: В этом поле можно создать связи со страницей (или несколькими) в TYPO3. Это поле используется многими типами элементов содержимого. Если Вы не определите страницу, будет использоваться текущая страница. В типе "Блок поиска", введенная страница будет целевой для поиска. Удостоверьтесь, что на ней имеется аналогичный элемент типа "Блок поиска" (или похожий) для отображения результатов поиска. Иначе в этом не будет смысла. "Форма входа в систему" также использует это поле для перенаправления регистрации на определенную страницу. Но эта страница не обязательно должна содержать однотипный элемент, в случае успешной регистрации можно перенаправить пользователя на любую страницу TYPO3! Если Вы определите вторую страницу в этом списке, то ее id будет передан в систему регистрации на сайте, как страницей внутри TYPO3, где содержиться база данных для поиска пользователей. Используйте это, только если Ваш шаблон не настроен должным образом. Для работы процедуры входа в систему, нужно удостовериться, что 1) Вы создали по крайней мере одного пользователя и группу пользователей Web-сайта, и что используются правильное имя пользователя и пароль, 2) Вы в своем шаблоне TypoScript настроены страницы (обычно SysFolder), где могут быть найдены пользователи или альтернативно определили это второй страницей в этом списке страниц 3) cookies должны быть включены. Элементы типа "Меню/карта сайта" также используют это поле. В этом случае страница(ы) говорят, с какого места в дереве страниц будет представлено меню или даже целые страницы. Это зависит от подтипа меню/карты сайта. И наконец, элементы типа "Форма" используют это поле, как страницу, на которую перенаправляется пользователь после подтверждения формы. Можно вставить страницу с информацией типа "Спасибо, с вами свяжутся".

# pi_flexform.description
source: FlexForm Configuration of Plugins
ru: Настройка FlexForm расширений.

# pi_flexform.details
source: Some plugins may require configuration of their options. They may use this field for FlexForm based configuration settings (stored as XML).
ru: Некоторые расширения могут потребовать настройки. Они могут использовать это поле для своей настройки в стиле FlexForm (сохраняется как XML).

# records.description
source: Insert relations to records.
ru: Определение ссылки на записи.

# recursive.description
source: Select how many subleves should be additionally selected for each page in the list.
ru: Выберете, сколько подуровней может быть дополнительно выбрано для каждой странице в списке.

# recursive.details
source: Whether this feature makes sense or not depends solely on the template implementation and/or content element type. But basically if this feature is enabled it means that for each page listed in the "Send to page/Starting point" box subpages - to the depth specified here - will <em>also</em> be selected! <strong>Warning:</strong> If there are many subpages, be aware of this option. It may select an incredible amount of pages then!
ru: Имеет ли эта возможность смысл или нет, зависит исключительно от реализации шаблона и/или типа элемента содержимого. Но в основном, если эта возможность включена, то это означает, что для каждой страницы в блоке "Переслать на страницу/Начальная точка" будут выбраны все подстраницы с указанного здесь количества уровней! <strong>Внимание:</strong> если здесь назначено много страниц. То с этим параметром будет выбрано невообразимое их количество!

# rte_enabled.description
source: If checked, the Rich Text Editor will be disabled for the "Text" and "Text & Image" types (<em>in this element only</em>).
ru: Если включено, то редактор текста (Rich Text Editor) будет отключен для "Текста" и "Текста с изображением" (<em>лишь в этих элементах</em>)

# section_frame.description
source: Select a framing option for the content element.
ru: Определите параметры обрамления для этого элемента содержимого.

# sectionIndex.description
source: If set, the content element will appear in section indices.
ru: Если включено, элемент содержимого появится в индексах раздела.

# sectionIndex.details
source: See details for the Menu-type selector (click below).
ru: Подробнее смотрите о выборе типа меню (щелкните ниже)

# selected_categories.description
source: Pages or content elements from the selected categories will be displayed in the menu.
ru: Страницы или элементы содержимого выбранных категорий будут отображены в меню.

# select_key.description
source: Enter a code string.
ru: Введите строку кода.

# select_key.details
source: Whether or not the content of this field is used and how it's intepreted depends on the context. It is considered obsolete today.
ru: Где и как используется содержимое этого поля, зависит от контекста его употребления. На данный момент его не рекомендуется использовать.

# spaceAfter.description
source: Enter the amount of whitespace (in pixels) to insert <em>after</em> this content element.
ru: Введите расстояние (в пикселях) <em>после</em> этим элементом содержимого.

# spaceBefore.description
source: Enter the amount of whitespace (in pixels) to insert <em>before</em> this content element.
ru: Введите расстояние (в пикселях) <em>перед</em> этим элементом содержимого.

# splash_layout.description
source: Select the design for the Text box.
ru: Определите дизайн текстового блока.

# splash_layout.details
source: <strong>Notice:</strong> The Textbox type has a few default renderings but are primarily designed to be used for custom purposes. Therefore the availability of features will depend on the current website template.
ru: <strong>Примечание:</strong>текстовый блок имеет несколько предоставлений по умолчанию, но прежде всего он разработан в пользовательских целях. Поэтому его возможности главным образом зависят от текущего шаблона Web-сайта.

# starttime.description
source: Enter the date from which the content element will be visible.
ru: Введите дату, начиная с которой элемент содержимого будет отображаться.

# subheader.description
source: Enter a subheader. This is displayed below the ordinary headline. If the content element type is "Form" this field is the recipient email.
ru: Введите подзаголовок. Он отображается под обычным заголовком. В случае "Формы", это поле – электронная почта получателя.

# subheader.details
source: A subheader is displayed only with the "Header" content element type. <b>Notice:</b> When using the content element type "Form", this field is named 'Recipient-email:' and contains the email address of the form mail recipient. It's therefore important to allow access to this field for the users.
ru: Подзаголовок отображается только с типом элемента содержимого "Заголовок". <strong>Примечание:</strong> используя элемент содержимого "Форма", это поле называется "E-mail получателя:" и содержит электронный адрес получателя формы. Поэтому важно предоставить доступ к этому полю для пользователей.

# sys_language_uid.description
source: Select the system language of this element. <strong>Notice</strong> this will affect whether the element is visible.
ru: Выберете системный язык для этого элемента. <strong>Примечание</strong> это затрагивает видимост элемента.

# sys_language_uid.details
source: This allows you to assign a specific language to the content element. If you select anything but the default value, the element will <em>not</em> be visible unless the language assigned is also configured by the TypoScript template. The available system languages are created by the administrator.
ru: Позволяет назначить определенный язык для элемента содержимого. Выбрав что-либо, кроме значения по умолчанию, Вы <em>скроете</em> элемент, если только выбранный язык не был настроен в шаблоне TypoScript. Доступные в системе языки создаются администратором.

# table_bgColor.description
source: Select table background color.
ru: Выберете фон таблицы.

# table_border.description
source: Select table border thickness.
ru: Выберете толщину рамки таблицы.

# table_cellpadding.description
source: Select table cellpadding.
ru: Выберете расстояние от рамки до содержимого ячейки.
