Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_fe_users.xlf
Languages: ru

# address.description
source: Enter the street address of the user.
ru: Введите адрес пользователя.

# company.description
source: Enter the name of the company in which the user is employed.
ru: Введите название компании, в которой работает пользователь.

# .description
source: A website login user.
ru: Зарегистрированные на сайте пользователи.

# .details
source: These are users with a username and password who are allowed specific access to otherwise restricted areas on your website.
ru: Это пользователи, которые, под своим пользовательским именем и паролем, могут получить доступ к закрытым областям Вашего web-сайта.

# disable.description
source: This option will temporarily disable the user from logging in.
ru: Этот параметр временно запрещает регистрацию пользователя.

# endtime.description
source: Enter the date from which the account is disabled.
ru: Введите дату, начиная с которой учетная запись будет отключена.

# endtime.syntax
source: See "Start"
ru: Смотрите "Начало"

# .image_descr
source: Part of the form for editing a frontend user. A typical login box (standard) on the website where frontend users can login.
ru: Часть формы для редактирования внешнего пользователя. Обычная форма регистрации (стандартная) на web-сайте, через которую внешний пользователь может зарегистрироваться на сайте.

# image.description
source: Insert a photo of the user.
ru: Вставьте фото пользователя.

# lastlogin.description
source: This field shows the user's last log in date.
ru: Здесь отображается последняя дата посещения сайта пользователем.

# lockToDomain.description
source: Enter the host name from which the user is forced to login.
ru: Введите название хоста, с которого пользователь обязан регистрироваться.

# lockToDomain.details
source: A TYPO3 system may have multiple domains pointing to it. Therefore this option secures that users can login only from a certain host name.
ru: В системе TYPO3 может быть несколько доменов, с которых можно осуществлять к ней доступ. Этот параметр ограничивает возможность регистрации пользователя на сайте определенным именем хоста.

# lockToDomain.syntax
source: Either a domain name, "www.typo3.org" or an IP address, "10.34.222.83"
ru: Это может быть название домена, "www.typo3.com" или IP адрес, "10.34.222.83"

# name.description
source: Enter the regular name of the user, both first- and surname.
ru: Введите настоящее имя пользователя, как имя, так и фамилию.

# password.description
source: Enter the password for the username above. This is needed to login.
ru: Введите пароль для введенного выше имени пользователя. Он необходим для регистрации на сайте.

# password.syntax
source: A password is required and must be in lowercase without spaces in it.
ru: Пароль обязателен и должен быть в нижнем регистре без пробелов.

# starttime.description
source: Enter the date from which the account is active.
ru: Введите дату, с которой будет активна учетная запись.

# starttime.syntax
source: The syntax is dd-mm-yy, but you can just enter a "d" in the field to insert todays date. Or "d+10" to insert the date 10 days from now etc. The field will re-format any input to fit the format it understands so you can just experiment and you will be able to clearly see how dates should be entered.
ru: Синтаксис: дд-мм-гг, но можно ввести просто "d", чтобы вставить сегодняшнюю дату. Или "d+10", чтобы вставить дату, спустя 10 дней от настоящего дня. Поле подстраивается под любое введенное в него значение и для ознакомления со всеми возможностями, нужно экспериментировать.

# title.description
source: Enter the job title, eg. 'Director' or 'Accountant'.
ru: Введите должность, напр. "Директор" или "Бухгалтер".

# TSconfig.description
source: Enter additional TSconfig for the user (advanced).
ru: Введите дополнительную TSconfig для пользователя (расширенные настройки).

# TSconfig.details
source: This field allows you to enter TypoScript style configuration values for the user. Currently there are no system defined keys. If there ever will be, they will be described in detail in the administrative documentation. The primary use of this field (as well as the 'sister'-field in the Website usergroup table) is for custom purposes. In this case, you should use the root-key "user" for your customly defined values. Thus you don't risk any future system keys to interfere with your configuration. You access the values of the configuration from your frontend plugins by calling the function <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em> which will return an array with the valuetree in it. <b>Warning:</b> You should use Website user/group TSconfig in your PHP-scripts ONLY if your resulting content is NOT being cached! So call it from TypoScript USER_INT cObjects or disable caching from your PHP-code by calling <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig from Website usergroups:</b> Notice that the configuration from the field TSconfig in the member groups of the user is accumulated and prepended to the TSconfig of the user before it's parsed. This means for instance that a key defined in the TSconfig of the user (this field) will override the same key defined in the last (bottom) usergroup in the list which will again override the same key defined in the first (top) usergroup in the list. <b>Example:</b> Let's imagine you want to define for a user that his name is printed in the bottom of the webpages when he is logged in. First of all you must write a PHP-function and insert the result from it as a USER_INT cObject in the bottom of the page. But your function needs to know, whether or not this user is configured to have his name printed. So you decide to use a custom TSconfig key, 'user.printUserName': <em>In the TSconfig field of the user or usergroup:</em> user.printUserName = 1 <em>In your PHP-function:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }
ru: Это поле позволяет вводить стилевые настройки TypoScript для пользователя. В настоящее время нет клавиш для стилевых настроек. Как только они появятся, появится и их описание в документации по управлению. В основном это поле (как и родственное поле в таблице групп пользователей) используется для детальных настроек. В этом случае, нужно использовать корневого "пользователя" для дополнительно настроенных значений. Так Вы не рискуете столкнуться в будущем с трудностями при введении системных клавиш. Обращаться к значениям настройки из собственных дополнений ко внешнему интерфейсу можно через вызов функции <em>$GLOBALS["TSFE"]->fe_user->getUserTSconf()</em>, возвращающей массив с деревом значений. <b>Внимание:</b> использовать TSconfig пользователя/группы Web-сайта в Ваших PHP-сценарияха следует, ТОЛЬКО ЕСЛИ в результате содержимое не кэшируется! То есть вызывать его из TypoScript USER_INT cObjects или отключить кэширование в коде PHP, вызвав <em>$GLOBALS["TSFE"]->set_no_cache();</em> <b>TSconfig из групп пользователей web-сайта:</b> Помните, что настройки из поля TSconfig групп суммируется со свойствами в том же поле для пользователя перед их разбором. Что для пользователя значит, что один и те же настройки в поле TSconfig для пользователя (эти настройки) имеют преимущества перед настройками группы пользователей, находящейся внизу списка групп, членом которых является пользователь. А настройки этой группы (нижней в списке), в свою очередь, переопределяют настройки групп выше по списку. <b>Пример:</b> Давайте подумаем, что Вы хотели бы определить для пользователя, чье имя введено вверху вебстраницы при регистрации. В первую очередь, нужно написать PHP функцию и вставить ее результат как USER_INT cObject внизу страницы. Но функция должна знать, нужно ли выводить имя этого пользователя. Для этого нужно использовать TSconfig ключ "user.printUserName": <em>В поле TSconfig пользователя или группы пользователей:</em> user.printUserName = 1 <em>В вашей PHP-функции:</em> $userTSConfig = $GLOBALS["TSFE"]->fe_user->getUserTSconf(); if ($userTSConfig["user."]["printUserName"]) { return $GLOBALS["TSFE"]->fe_user->user["name"]; }

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
ru: Используется синтаксис TypoScript без констант и условий.

# usergroup.description
source: Select a user group for the username.
ru: Выберете группу пользователей для введенного имени пользователя.

# usergroup.details
source: When a user logs in he is able to view all content which is access restricted to the user <em>group(s)</em> the user is a member of. Therefore the user login primarily makes sense with regard to the member groups.
ru: При регистрации, пользователь сможет видеть позволенное ему и <em>его группе(ам)</em>. Поэтому пользовательский пароль обеспечивает доступ и к определенным группам пользователей.

# username.description
source: Enter the username of the website user. This is needed to login.
ru: Введите имя пользователя сайта. Оно используется для регистрации на сайте.

# _username.seeAlso
source: Creating Frontend Users and Groups | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/
ru: Создание внешних пользователей и их групп | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/CreateUsersGroups/

# username.syntax
source: A username is required and must be in lowercase without spaces in it. The username must be unique among other usernames in the page where it's saved. If it is not unique a number will be prepended automatically.
ru: Имя пользователя обязательно и должно быть в нижнем регистре без пробелов. Имя пользователя должно быть уникальным для страницы, содержащей пользователей. Если такое имя уже существует, то к нему автоматически будет добавлен номер.

# www.description
source: Enter the homepage URL
ru: Введите адрес URL домашней страницы
