Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_fe_groups.xlf
Languages: ru

# .description
source: Usergroups for Website users.
ru: Группы пользователей Web-сайта.

# description.description
source: Enter a description of the group.
ru: Введите описание группы.

# description.details
source: This is for internal use and is just a way to put a note on what the group is for, why you created it and who should be members. Use it as you like.
ru: Исключительно для внутренних нужд, примечания о цели создания группы, кто ее члены. Используйте по своему усмотрению.

# .details
source: The access restriction in TYPO3 is assigned to these usergroups. When a page or other element is access restricted to a group, only Website users which are members or that group will be able to view the element on the website.
ru: Для групп пользователей назначаются права доступа в TYPO3. Если ограничить доступ к странице или другому элементу определенной группой, то увидеть этот элемент на web-сайте смогут лишь члены этой группы.

# hidden.description
source: This option disables the user group.
ru: Этот параметр отключает группу пользователей

# hidden.details
source: If you disable a user group all users which are members of the group will in effect not inherit any properties this group may have given them. For instance if a page or content element was assigned access only by this group and you disable the group, no one would gain access to that page or content element.
ru: При отключении группы пользователей, все ее члены больше не будут наследовать ее свойства. Для примера, если страница или ее содержимое был связан лишь с этой группой, то, при ее отключении, никто не сможет получить доступ к этим страницам или их содержимому.

# .image_descr
source: The form for editing frontend users groups. Pages, Content Elements and other records for frontend display often have a selector box where you can define access restriction by selecting access for a certain group only.
ru: Страницы, элементы их содержимого и другие записи для отображения во внешнем интерфейсе обычно имеют блок, в котором можно определить права доступа для групп пользователей.

# lockToDomain.description
source: Enter the host name from which the group will be available only.
ru: Введите название хоста, которым будет ограничена группа.

# lockToDomain.details
source: This options may be important if you have multiple websites in the same TYPO3 database but still only one main storage page for all Website users. Thus the users may log in on any of the website URLs. This may be considered a feature (having a global login as a user) or a problem (in which case you should have multiple user storages anyway). However you may wish to limit the use of a Website usergroup to a specific website and thus you don't want the group to be enabled for the user when he logs in at another URL (still from the same database of course). By entering the host name of the website here, you restrict the group to be used only from within this domain. <b>Notice:</b> The use for this option is not critical if you have multiple Website user storages, namely one for each site.
ru: Эти параметры важны, если у Вас есть несколько Web-сайтов в одной базе данных TYPO3, но используется лишь одна основная страница-хранилище для всех пользователей Web-сайта. Таким образом пользователи могут зарегистрироваться по любому URL Web-сайта . Это можно рассматривать как особенность (общая регистрация пользователей) или проблема (когда нужно разграничить пользователей). Однако можно включить доступ к Web-сайту определенной группе пользователей, и ограничить для пользователя, зарегистрировавшегося по другому URL (в той же базе данных). Введя здесь название хоста Web-сайта, Вы ограничиваете группу этоим доменом. <b>Примечание:</b> этот параметр не важен, если у вас несколько страниц-хранилищ для пользователей сайта, по одному для каждого отдельного сайта.

# _.seeAlso
source: fe_users, About access restricting pages | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/
ru: fe_users, Об ограничении доступа к страницам | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/PasswordProtectedPages/

# subgroup.description
source: Member of other groups.
ru: Членство в других группах.

# subgroup.details
source: List of other groups that this group is a member of.
ru: Список других групп, в которые входит эта группа.

# title.description
source: Name of the group.
ru: Название группы.

# title.details
source: This title will appear as the group name in the 'Access'-list in other records.
ru: Этот заголовок будет присутствовать как ее название в списке доступа к остальным записям.

# TSconfig.description
source: TSconfig for the group (advanced).
ru: TSconfig для группы (расширенные параметры).

# TSconfig.details
source: This is the user TSconfig for the group. The values are inherited by any Website user who is a member of this group. The configuration is subject to being overridden in other groups and by the TSconfig of the user himself.
ru: Это TSconfig для членов группы. Значения наследуются пользователями сайта - членами этой группы. Параметры TSconfig переписывают те же параметры, установленные в других группах и параметрами TSconfig самого пользователя.

# TSconfig.syntax
source: TypoScript syntax, without conditions and constants.
ru: Используется синтаксис TypoScript без условий и констант.
