Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_pages.xlf
Languages: ru

# media.details
source: This fields allows you to attach various files to the page record. If and how these files are used depends on your template. So basically which files you attach here and in which order they must be listed is determined by your specific website template and thus you should seek instructions in the documentation for your specific website. As an example this field could be used from the template to allow you to attach a logo-image to the page. Or the template might be programmed to expect the first file to be an image used as a link in the navigation menu. But remember, this totally depends on how this field is used in the programming of the template.
ru: Это поле позволяет прикрепить различные файлы к записе страницы. Как используются эти файлы, зависит от Вашего шаблона. Так, в основном, что за файлы и в каком порядке они прикреплены, зависит от шаблона web сайта и от Вас. Например, это поле можно использовать для прикрепления логотипа к странице. Или можно запрограммировать шаблон, чтобы использовать первый прикрепленное изображение как ссылку в меню навигации. Но помните, это в основном зависит от того, как это поле запрограммировано в шаблоне.

# module.description
source: Define the page as a frontend 'module'.
ru: Определяет страницу, как "модуль" внешнего интерфейса.

# module.details
source: In the backend there is a module called 'Web>Modules' as well as a header 'Modules' in the 'User>Task Center'. Both functions list the available 'Frontend modules' to which the user has access. Basically, setting this option just marks the page so the backend knows this page contains eg. a forum or is the root page of a shopping section on the website. And based on this knowledge the backend is able to display a shortcut list as well as relevant functionality in the 'Web>Modules' module. The frontend display is - largely - not affected. So in effect, by 'marking' a page to be a 'Shop' module simply means it'll show up in the shortcut list of modules in the backend. There may be a little more to it than this, but for details on the subject, you must refer to the administration documentation. It's recommended that only admin-users are allowed access to this field!
ru: Во внутреннем интерфейсе есть модуль "Веб>Модули", также есть заголовок "Модули" в "Инструменты пользователя>Центр заданий". В обоих перечислены "Внешние модули" к которым имеет доступ пользователь. В основном, установка этого параметра просто отмечает эту страницу, чтобы внутренний интерфейс знал, что эта страница содержит, например форум, или это корневая страница раздела магазина на web сайте. И на основе этого, во внутреннем интерфейсе может отобразить список ссылок на основе сходной функциональности в модуле "Веб>Модули". Отображение во внешнем интерфейсе в значительной степени не затрагивается. Так, эффект от "отметки" страницы, как модуль "Магазин", просто отобразит список ссылок на модули во внутреннем интерфейсе. Немного болше об этом написано в документации по управлению сайтом. Мы рекомендуем, чтобы только у пользователей-администраторов был доступ к этому полю.

# mount_pid.description
source: Mount this page id. If set it means that the subpages of this page comes from the mounted page instead.
ru: Установить id этой страницы. Это значит, что подстраницами этой страницы будут считаться подстраницы страницы с этим id.

# mount_pid.details
source: In the frontend this is done by adding a new variable, &MP, to the parameters which links the mounted branch to the main branch by pairing page ids.
ru: Во внешнем интерфейсе это осуществляется через добавление новой переменной, &MP, связывающей установленную ветвь с основной ветвью, спаривая id страниц.

# mount_pid_ol.description
source: If set, the mount point is "overlaid" by the mounted page. It will look like if the mount point does not exist and the mounted page is inserted in its position instead.
ru: Если установлено, точка крепления "перекрывается" монтированной страницей. Это выглядит, как будто точки монтирования не существует, а вместо нее вставлена монтируемая страница.

# nav_hide.description
source: With this option the page will be hidden in navigation menus in the frontend. The page can still be viewed if linked by its ID directly.
ru: Включение этого параметра, спрячет страницу из меню навигации по web сайту во внешнем интерфейсе. Но страница все еще будет видна по ее непосредственному ID.

# nav_title.description
source: Alternative title for menu items in the frontend. This value takes precedence over the page title if this value is filled in.
ru: Альтернативный заголовок для элемента меню во внешнем интерфейсе. При использовании, это значение имеет преимущество над значением заголовка страницы.

# newUntil.description
source: Enter the 'expiry date' of the page.
ru: Введите "дату окончания срока действия" страницы.

# newUntil.details
source: The 'expiry date' of the page has no effect on the display of the webpage. This value is rather for internal use meant as a reminder of the date when the content of this page should be revised. So if the content of the page will be outdated at a certain point in time, you could set this value to that approximate date. In order to obtain an overview of the expiry dates of pages, use the 'Pagetree overview' in the 'Web>Info' module.
ru: "Дата окончания срока действия" страницы не влияет на отображение страницы. Она нужна скорее для внутреннего применения, как напоминание о пересмотре содержимого страницы. Так, если содержимое страницы планируется измениять в определенный момент времени, Вы можете поставить здесь примерное время этого момента. Чтобы просмотреть даты окончания строка действия страниц, используйте "Обзор дерева страниц" в модуле "Веб>Инфо".

# newUntil.syntax
source: See Page / Start (click below)
ru: Смотрите Страница/Старт (щелкните ниже)

# no_cache.description
source: This option disables server caching of the page.
ru: Этот параметр отключает кеширование страницы на сервере.

# no_cache.details
source: Normally pages in TYPO3 are cached on the server after being constructed for the first time. This means a page is displayed much faster the second time it's requested. For most pages this presents no problems - rather it's boosting the performance of the website. However you may need to disable caching for a page if it contains dynamic content which must not be cached under any circumstances. Normally the PHP-code rendering such content is programmed to disable the caching automatically. But in any case you can force the page not to be cached via this option.
ru: Обычно страницы в TYPO3 кешируются на сервере после начального создания. Что приводит к значительному убыстрению отображения страницы после запроса. Для большинства страниц это не составляет проблему, наоборот, повышает производительность web сайта. Однако может понадобиться отключить кеширование страниц, если она содержит динамическое информационное наполнение, которое не должно кешироваться ни при каких обстоятельствах. Так или иначе, этот параметр отключает кеширование страницы на сервере.

# no_search.description
source: If enabled, this option excludes the page from searching operations on the website.
ru: Если включен, этот параметр исключает эту страницу из операций поиска на web сайте.

# shortcut.description
source: Insert a reference to the page to which this page is supposed to be a shortcut. Requesting this ID in the frontend will redirect people to the page referred to by this value.
ru: Вставьте ссылку на страницу. Запрос страницы с этим ID во внешнем интерфейсе перенаправить на страницу, на котороую установлена ссылка.

# shortcut.details
source: Click the 'Browse for records' icon and a new window will appear in which you can easily select the page to which the shortcut is supposed to link. This option is used only if the page 'Type' is set to 'Shortcut'.
ru: Щелкните по значку "Обзор записей", для выбора в новом окне страницы, на которую будет указывать данная страница. Этот параметр используется, только для "Типа" страницы - "Ссылка".

# shortcut.image_descr
source: Select a page to shortcut to by the Element Browser.
ru: Выберете страницу в Обзоре записей, на которую будет ссылаться данная страница.

# shortcut_mode.description
source: Select a shortcut mode. By default the shortcut page type must have a page id to jump to. Alternative methods are to go to the first subpage of a page or to a random subpage.
ru: Выберете режим ссылки. По умолчанию применяется тип ссылки перехода по id страницы. Альтернативно, можно перейти на первую или случайную подстраницу текущей страницы.

# starttime.description
source: The 'Start' time determines the date from which the page will be visible online. Use this to 'publish' the page on a certain date. If 'Start' time is not set, the page will be online instantly (unless the page is hidden otherwise).
ru: Время "Старт" определяет дату, с которой страница будет видна в сети. Используйте для "публикации" страницы, начиная с определенной даты. Если "Стартовое" время не определено, страница будет в любом случае видна в сети (конечно, если она не скрыта другим способом).

# starttime.syntax
source: Format is DD-MM-YYYY. You may enter the value in other ways - it will be evaluated immediately. If you insert eg. a 'd' the current date is inserted. You can also append any value in the field with eg. '+10' which will add 10 days to the current value. For instance setting the value to 'd+10' would select a date 10 days from now.
ru: Формат ДД-ММ-ГГГГ. Можно и по другому вводить значения - оно моментально будет вычислено. Например, если Вы введете "d", будет вставлена текущая дата. Можно ввести в поле любое значение, например "+10", что добавить 10 дней к текущей дате. То есть, введя "d+10", получите день, отстоящий от сегодня на 10 дней.

# subtitle.description
source: Enter a subtitle if needed.
ru: Если нужно, введите подзаголовок.

# subtitle.details
source: Whether this field is used or not depends on the template. In most cases it's not used. You may use this field as you like in your own templates.
ru: Использование этого поля зависит от шаблона. В большинстве случаев оно не используется. Вы можете использовать это поле для собственных нужд в Вашем шаблоне.

# target.description
source: The HTML target of menu items linking to this page. Also can be used for open page in popup.
ru: HTML цель для элементов меню, связанных с этой страницей. Также может использоваться для открытия страниц во всплывающем окне.

# target.details
source: Set this value only to overrule the default link, which should be configured correctly for most pages in the website TypoScript template. There are more options with the target field Setting an integer value at the start of the field adds it as the default type for the page. For example, if an RSS feed is configured in Typoscript as typeNum=100, setting the target to 100 could be used to add an RSS link in the menu. For open in popup use following syntax: 400x200 - this opens page in a popup of size 400x200 230x450:resizable=0,location=1 - opens page in popup with parameters Combined: 100 600x350 - opens page in popup with type 100 2 _blank - opens page with target "_blank" and type 2
ru: Устанавливайте это значение только для переназначения ссылок по умолчанию, которые в большинстве своем правильно настроены для большинства страниц в шаблоне TypoScript. Больше параметров имеется в поле для цели. Установка целого значения в начале поля, добавляет его в виде типа страницы по умолчанию. Например, если подача RSS настроена в Typoscript как typeNum=100, установка цели равной 100 может использоваться для добавления RSS ссылки в меню. Для открытия во всплывающем окне, используйте следующий синтаксис: 400x200 - страница будет открыта во всплывающем окне, размером 400x200 230x450:resizable=0,location=1 - страница будет открыта во всплывающем окне, с заданными параметрами. Комбинация: 100 600x350 - страница будет открыта во всплывающем окне с типом 100 2 _blank - страница будет открыта с в окне с целью "_blank" и типом 2

# title.description.+
source: This is normally shown in the website navigation.
ru: Обычно отображается в меню навигации сайта.

# TSconfig.details.+
source: <strong>Example:</strong> Normally the 'Web>Page' module lets you create content in four columns, Left, Normal, Right, Border. However most websites use only a single or two columns. So some of these content columns are just taking up space and may even be confusing to users. If you enter this string in the 'TSconfig' field, the 'Web>Page' module will allow you to work only in the 'Normal' and 'Border' column! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Must be entered in a single line!)
ru: <strong>Пример:</strong> Обычно модуль "Веб>Страница" позволяет создавать содержимое в четырех колонках – левой, обычной, правой, крайней. Но обычно на сайтах используются лишь одна или две колонки. И некоторые из этих колонок содержимого лишь занимают место и даже сбивают пользователей с толку. Введя эту строку в поле "TSconfig" модуля "Веб>Страница", можно будет работать лишь с "Обычной" или "Крайней" колонках! <em>mod.web_layout.tt_content.colPos_list = 0,3</em> (Должно вводиться в одну строку!)

# url.description
source: Enter the URL to which this page is supposed to link.
ru: Введите URL, с которым предположительно связана эта страница.

# url.details
source: Example: 'http://www.typo3.org' or just 'www.typo3.org' provided the 'Type' selector is set to 'http://'. Use the 'Type' selector to select a prefix for the URL. This option is used only if the page 'Type' is set to 'External URL'.
ru: Пример: "http://www.typo3.com" или просто "www.typo3.com", при установке "Тип" "http://". Селектор "Тип" используется для префикса URL. Этот параметр используется только если "Тип" страницы установлен на "Внешняя ссылка".

# urltype.description
source: Set the URL prefix.
ru: Настройка префикса URL.
