Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_pages.xlf
Languages: ru

# abstract.description
source: Enter an abstract of the contents. It may be displayed in an overview of articles.
ru: Введите резюме содержимого. Оно может использоваться как краткий обзор статей.

# abstract.details
source: An abstract is a short description of the page content, that might be a little longer than the one in the <i>Description</i> field. Other than the description, the abstract is not meant for display in search engine result lists, but for use in your own project exclusively. By default, TYPO3 lets you create a content element of type <i>Sitemap</i> and then choose <i>Menu of subpages to these pages (with abstract)</i> to create an overview of articles. If an abstract is available it will be used instead of the description. <b>Note:</b> You do not have to enter the text of the description into the <i>Abstract field</i> again. Of course, admins can make custom use of this field via their TypoScript templates.
ru: Резюме – это краткое содержимое страницы, которое может быть немного длиннее поля <i>Описание</i> field. В отличии от описание, резюме не отображается в результатах поиска в поисковых машинах, оно предназначено для использования лишь в Ваших личных целях. По умолчанию, TYPO3 позволяет создавать элемент содержимого типа <i>Карта сайта</i>, выбрав тип <i>Меню подстраниц данных страниц (по резюме)</i> для создания резюме статей. При заполненном резюме, оно используется вместо описания. <b>Примечание:</b> не нужно вводить снова текст текст описания в <i>поле Резюме</i>. Конечно, администраторы могут по своему использовать это поле в свойи шаблонах TypoScript.

# alias.description
source: An 'alias' is a unique identification string for a page. You can use this string instead of the id-number to refer to the page.
ru: "Псевдоним" - уникальная строка идентификации страницы. Можно использовать эту строку вместо идентификационного номера, для ссылки на страницу.

# alias.details
source: Ultimately a page is identified by its id-number. For instance you may refer to a page in TYPO3 by '.../?id=123'. If the page with id '123' has the alias 'one_two_three', then the URL '.../?id=one_two_three' would display exactly the same page, because 'one_two_three' is an alias for the id '123'. Normally you should assign aliases only to a limited number of pages, preferably those you need to link to a lot. In most TYPO3 configurations you would be able to use the syntax '.. &lt;link one_two_three&gt;go to the page&lt;/link&gt; ..' to create a link to the page. This is easier to remember. Another use is if you need to change which page such a link is referring to. In that case you can delete the alias for one page and enter it for another and all links pointing to the alias would now refer to another id-number.
ru: В конечном счете страница идентифицируется по ее идентификационному номеру. Например, в TYPO3 можно сослаться на страницу ".../? id=123". Если у страницы с id "123" есть псевдоним 'one_two_three', то по URL ".../? id=one_two_three" будет отображена та же самая страница, потому что "one_two_three" - псевдоним для id "123". Обычно, псевдонимы назначаются для ограниченного количества страниц, предположительно, связанным с большим числом страниц. В большинстве конфигураций TYPO3 можно использовать синтаксис ".. &lt;link one_two_three&gt;go to the page&lt;/link&gt; .." для создания ссылки на страницу. Это легко запоминается. Другое применение - изменение ссылок, которые должны вести на другую страницу. Можно удалить псевдоним с одной страницы и дать его другой, на которую теперь нужно ссылаться. При этом все ссылки, указывающие на страницу по псевдониму, будут физически указывать на страницу с другим id номером.

# alias.syntax
source: An alias can contain only lowercase alphanumeric characters and must be unique. Please notice: If the entered value was not unique, it will automatically be prepended with a number.
ru: Псевдоним может содержать лишь строчные алфавитно-цифровые символы и должен быть уникальным. Пожалуйста помните: если введенное значение не было уникально, оно будет автоматически дополнено числом.

# author.description
source: Enter the page authors name.
ru: Введите имя автора страницы.

# author.details
source: Whether the author name is used or not depends on the setup of your TypoScript template. - You may use it in a meta-tag. - If you're using TYPO3 pages as 'articles' then you could use this field to display the name of the page (article) author.
ru: Как используется имя автора, зависит от настроек в шаблоне TypoScript. - Вы использовать его в мета-теге. - Если страницы TYPO3 используются как "статьи", можно использовать это поле как имя автора страницы (статьи).

# author_email.description
source: Enter the page authors email address.
ru: Введите e-mail адрес автора страницы.

# backend_layout.description
source: Select a backend layout for this particular page only.
ru: Выбор шаблона внутреннего интерфейса только для этой конкретной страницы.

# backend_layout.details
source: If you have created any additional backend layouts you can select them here to have the page module render the columns of this page with the selected layout. Usually it will reflect the frontend layout in a way so that you will be able to recognize easily to which area of the page the content belongs. You can select nothing or "none" to get the default column view of the page module for this page. If you select a layout or "none", it will override any settings that might have been inherited from pages in the rootline of the current page. The selection is <b>NOT</b> inherited automatically by subpages - use <b>Backend Layout (subpages of this page)</b> if you want to achieve this.
ru: Если созданы дополнительные макеты внутреннего интерфейса, то здесь можно их добавить, чтобы модуль страницы сформировал столбцы на странице в соответствии с выбранным шаблоном. Обычно это отражения шаблона внешнего интерфейса для упрощения распознавания местоположения элементов содержимого на странице. Можно ничего не выбирать или выбрать "Нет", для получения внешнего вида столбцов по умолчанию для этой страницы. Если выбран шаблон или "Нет", то это переназначит любые унаследованные от родительских страниц настройки для текущей страницы. Выбор автоматически <b>НЕ</b> наследуется подстраницами - вместо этого используйте <b>Шаблон внутреннего интерфейса (подстраницы текущй страницы)</b>.

# backend_layout_next_level.description
source: Select a backend layout for all subpages of this page.
ru: Выбор шаблона внутреннего интерфейса для подстраниц текущей страницы.

# backend_layout_next_level.details
source: If you have created any additional backend layouts you can select them here to have the page module render the columns of the subpages of this page with the selected layout. Usually it will reflect the frontend layout in a way so that you will be able to recognize easily to which area of the page the content belongs. You can select nothing or "none" to get the default column view of the page module for the subpages. If you select a layout or "none", it will override any settings that might have been inherited from pages in the rootline of the current page. The selection is inherited automatically by all subpages - so you don't have to set it separately for each of them.
ru: Если созданы дополнительные макеты внутреннего интерфейса, то здесь можно их добавить, чтобы модуль страницы сформировал столбцы на подстраницах текущей страницы в соответствии с выбранным шаблоном. Обычно это отражения шаблона внешнего интерфейса для упрощения распознавания местоположения элементов содержимого на странице. Можно ничего не выбирать или выбрать "Нет", для получения внешнего вида столбцов по умолчанию для этой страницы. Если выбран шаблон или "Нет", то это переназначит любые унаследованные от родительских страниц настройки для текущей страницы. Выбранное автоматически наследуется всеми подстраницами, поэтому настройку не нужно проводить для каждой из них отдельно.

# cache_timeout.description
source: Sets the cache timeout for the page.
ru: Устанавливается время повтороного кеширования для страницы.

# cache_timeout.details
source: By default pages last for 24 hours in the cache. After that period the page is constructed again and rewritten to the cache. Depending on your configuration, the cache may also be cleared at midnight. Anyhow you may here set another timeout time for the page in cache if you need to. This option is used quite rarely.
ru: По умолчанию, страницы хранятся в кеше в течение 24 часов. По истечению этого периода страницы заново формируются и обновляются в кеше. В зависимости от Вашей настройки, кеширование может обновлятся в полночь. В любом случае, здесь Вы можете установить другое время для обновления страниц в кеше. Этот параметр довольно редко используется.

# content_from_pid.description
source: If set, this is an alternative page id from where Content Elements will be selected instead of Content Elements from the current page. Depends on template implementation whether this applies.
ru: Если установлено, это id альтернативной страницы, элементы содержимого которой будут отображены вместо элементов текущей страницы. Применение зависит от реализации шаблона.

# description.description
source: Enter a short description of the page. It will be displayed in the result lists of search engines.
ru: Введите короткое описание страницы, которое будет отображаться в списке результатов поисковых движков.

# description.details
source: Most TYPO3 websites insert this description in a meta-tag on the page, but you have to configure this yourself in your TypoScript template. Search engines will display the description in their result list. Thus, the text should be short (about 160 characters maximum), and it's wording should make sense when it shows up in the result list. Also, the description will be displayed if you create a content element of type 'Sitemap' and then choose the menu type <i>Menu of subpages to these pages (with abstract)</i>. <b>Note:</b> Some search engines only use the description if the text is not found elsewhere in the content. So do not just repeat yourself.
ru: Большинства сайтов на TYPO3 используют описания в мета тегах страницы, но можно изменить шаблон TypoScript под собственные нужды. Поисковые системы отображают описание в списке результатов поиска. Поэтому текст не должен быть длинным (максимально около 160 символов), кроме того, в нем должен быть определенный смысл при его отображении. Также, описание будет отображаться, если Вы создадите элемент содержимого типа "Карта сайта", выбрав тип меню <i>Меню подстраниц данных страниц (по резюме)</i>. <b>Примечание:</b> некоторые поисковые машины используют описание, только если текст не найден в содержимом страницы. Так что не повторяйтесь.

# doktype.description
source: Select a page type affects whether the page represents a visible webpage or is used for other purposes.
ru: Выберете тип страницы, определяющий, будет ли страница видима во внешнем интерфейсе или она предназначена для других целей.

# doktype.details
source: 'Standard' and 'Advanced' types are regular webpages, just differing in the number of options. 'External URL' and 'Shortcut' types allows you to let a page be a shortcut to either an external URL or in the latter case a page in the page tree. 'Not in menu' is also a regular page, but will not be shown in the navigation. <em>This page type is deprecated! Please use the "Hide in menu" option!</em> 'Backend User Section' is an option which requires a backend user to be logged in for the page to be visible. <b>Special types:</b> 'Spacer' is only meaningfull if your frontend navigation is programmed to use it. In this case it does not represent a page with content but is intended to be a non-clickable placeholder in the navigation. 'SysFolder' is a page type which cannot be shown as a webpage but is rather acting as a storage for records of your choice. 'Recycler' is a garbage can. Pages and records in a recycler are not visible in the frontend. <b>Notice:</b> Each type usually has a specific icon attached. Also certain types may not be available for a user (so you may experience that some of the options are not available for you!). And finally each type is configured to allow only certain table records in the page (SysFolder will allow any record if you have any problems).
ru: "Стандартная" и "Секция внутренних пользователей" - видимые страницы, представленные во внешнем интерфейсе или для других целей. "Внешняя ссылка" или "Ссылка" делают страницу ссылкой либо на внешний URL, либо на другую страницу в дереве страниц. "Точка крепления" - также обычная страница, но не представленная в навигации. <em>Этот тип страниц не рекомендуется использовать! Вместо этого используйте параметр "Не отображать в меню"!</em> <b>Специальные типы:</b> "Распорка" имеет значение, если Ваша навигация во внешнем интерфейсе ее будет использовать. При этом, она не представляет обычную страницу с содержимым, но будет просто пунктом в меню, который нельзя будет выбрать. "Системная директория" - тип страницы, не видимый во внешнем интерфейсе как web страница, она используется для хранения выбранных Вами записей. "Корзина", может использоваться для скрытия страниц и записей из внешнего интерфейса. <b>Примечание:</b> За каждым типом закреплен определенный значек. Определенные типы могут быть недоступны для пользователя. И наконец, каждому типу присущи его определенные настройки и каждый из них может содержать лишь определенные записи элементов (Системная директория допускает использование любых записей).

# endtime.description
source: The 'Stop' time is the date from which the page will not be online anymore.
ru: Время "Стоп" - дата, начиная с которой страница не будет показана в сети.

# endtime.syntax
source: See Page / Start (click below)
ru: Смотрите Страница / Старт (щелкните ниже)

# extendToSubpages.description
source: By default the Start, Stop, Access and Hidden options are effective <em>only</em> for the page on which they are set. If the option 'Include subpages' is checked for the page, then their effect is inherited by all subpages to that page.
ru: По умолчанию, Старт, Стоп, Доступ и параметры Скрытия эффективны <em>только</em> для страницы, для которой они установлены. Если установлен флажок "Включая подстраницы", то эти параметры будут наследоваться и на подстраницах этой страницы.

# extendToSubpages.details
source: Consider a scenario where you want to create a whole section of subpages only visible for users which are logged in. Setting the 'Access' option for the top page in the section would affect access to that page only. So the page would not show up in the navigation unless you are logged in. However the subpages would still be visible if one could guess the id-number of the pages and enter it manually in the URL. But setting this option would extend the effect of the top page setting to cover all subpages as well.
ru: Представим, что Вы хотите создать целую секцию подстраниц, видимых для зарегистрированных пользователей. Установка параметров "Доступа" для корневой страницы этой секции, повлияет лишь на нее и страница не была бы видна в меню навигации без регистрации. Однако можно было бы получить доступ к подстраницам, дополнив URL id номером нужной страницы. Но, установив этот параметр, параметры доступа распространятся и на подстраницы корневой страницы.

# extendToSubpages.image_descr
source: This page icon has access restricted to a certain group and "Include subpages" set as well. This is reflected in the way the icon changed look.
ru: Это значек страницы, ограниченной по доступу определенной группой и установленным флажком "Включая подстраницы". Отражает изменение вида значка.

# fe_group.description
source: If 'Access' is set to a usergroup name, only website users which are members of the selected usergroup will be able to view the page when they are logged in. The special option 'Hide at login' means the page will <em>not</em> be visible for website users that are logged in. Likewise "Show at login" will make the page visible for any logged in frontend user.
ru: Если в "Доступе" выбрано название группы пользователей, то лишь ее члены смогут видеть эту страницу при регистрации. Специальный параметр "Скрыть после входа в систему", означает, что страница <em>не</em> будет видна пользователям web сайта после их регистрации на сайте. И наоборот, "Видна при любом входе", сделает страницу доступной для любых зарегистрированных на сайте пользователей.

# hidden.description
source: If this is checked, the page will be hidden on the website.
ru: Включив этот параметр, Вы скроете страницу на web сайте.

# hidden.details
source: The 'Hidden', 'Start', 'Stop' and 'Access' options are all about limiting access to pages and thus they are related in functionality. In any case where a page is not visible due to one of these options, the page will not show up in the site navigation. Notice, these options are related <em>only</em> to the page for which they are set. If you want their effect to cover the subpages as well, you must enable the 'Include subpages' option. When you're logged in as a backend user you can preview hidden pages if you have read access to them.
ru: Параметры "Скрыть", "Старт", "Стоп" и "Доступ" относятся к ограничению доступа к страницам и в этом они схожи по функциональности. В любом случае, страница, скрытая через эти параметры, не будет присутствовать в меню навигации сайта. Помните, что эти параметры относятся <em>только</em> к странице, для которой они установлены. Если Вы хотите, чтобы установка распространялась и на подстраницы, нужно включить параметр "Включая подстраницы" в разделе доступ. Войдя как пользователь внутреннего интерфейса, можно просмотреть скрытые страницы, конечно, если у Вас есть к ним доступ.

# hidden.image_descr
source: The page icon of a hidden page is dimmed and a red X is added. If you view a page that is hidden and you are logged in into the backend you will still be able to see the page. The red "Preview" box will tell you that this page is visible to you because of this special circumstance.
ru: Значек скрытой страницы затемнен и к нему добавляется красный крестик. Вы можете просматривать скрытую страницу при регистрации во внутреннем интерфейсе. Красный квадрат с надписью "Preview", говорит Вам, что страница отображается для Вас ввиду специальных обстоятельств.

# keywords.description
source: Enter keywords for the page separated by commas. You may also use short phrases.
ru: Введите ключевые слова через запятую для данной страницы. Можно исользовать короткие фразы.

# keywords.details
source: Most TYPO3 websites use these keywords in a meta-tag on the page, but you have to setup the appropriate TypoScript template yourself. To optimize your page for search engines like google you should not use more than 3 to 6 keywords. You should make sure that the keywords can be found in the content of the page. Note that also search engine extensions for TYPO3 (e.g. Indexed search) can be configured to make use of the keywords. In TYPO3, the keywords can also be used to create a menu of related pages. Create a content element of type 'Sitemap' and then choose the menu type <i>Related pages (based on keywords)</i>.
ru: Большинства сайтов на TYPO3 используют эти ключевые слова в мета тегах страницы, но можно изменить шаблон TypoScript под собственные нужды. Для оптимизации страницы для поисковых систем, подобных google, не нужно использовать более 3-6 ключевых слов. Нужно удостовериться, что ключевые слова находяться в содержимом страницы. Помните, что использовать ключевые слова можно и в поисковых расширениях для TYPO3 (напр. Индексный поиск) при соответствующей их настройке. Ключевые слова в TYPO3 можно использовать и для создания меню страниц со сходной тематикой. Для этого создайте элемент содержимого типа "Карта сайта", в которой выберете тип меню <i>Связанные страницы (на основе ключевых слов)</i>.

# l18n_cfg.description
source: Affect availability of pages in the various languages.
ru: Воздействует на доступные для страницы языки.

# l18n_cfg.details
source: <b>Hide default translation of page</b> If set the page is only available in one of the translations. So any attempt to access the page in the default language will show an error message. <b>Hide page if no translation for current language exists</b> If set the page access will be blocked with an error message if there is no translation in the current language. By default access to a non-translated page will just show the default language content.
ru: <b>Скрыть перевод страницы по умолчанию</b> При включении, страница становиться доступной лишь на одном из языков. И любые попытки вывода страницы на языке по умолчанию закончатся сообщением об ошибке. <b>Спрятать страницу, если не существует перевода на текущий язык</b> При установке, доступ к текущей странице без перевода на выбранный язык приведет к сообщению об ошибке. По умолчанию, при доступе к не переведенной странице будет показана страница на языке по умолчанию.

# lastUpdated.description
source: Enter the time and date of the most recent update of this page.
ru: Введите время и дату нового обновления этой страницы.

# lastUpdated.details
source: How the value of this field is used is determined by the TypoScript template of the website. First of all a 'Last updated' notice needs to be inserted on the pages and secondly the template must be configured to use this value. The most common use which is found in the standard templates will automatically display the last update time and date <em>unless</em> this field specifies a value in which case this value is inserted.
ru: Как используется значение этого поля, определяет шаблон TypoScript веб сайта. Сначала нужно вставить примечание "Последнее обновление" нужно вставить на страницы, а затем нужно настроить шаблона на его использование. Обычно оно используется для автоматического отображения даты и времени последнего обновления страницы, <em>если</em> значение в это поле не будет принудительно вставлено.

# lastUpdated.syntax
source: Format is HH:MM DD-MM-YYYY. If you insert eg. a 'd' the current time and date is inserted. You can also append any value in the field with eg. '+10' which will add 10 days to the current value.
ru: Формат : ЧЧ:ММ ДД-ММ-ГГГГ. Если Вы вставите, например "d", будет вставлено текущее время и дата. Можно вставить любое значение в это поле, например "+10", что добвить 10 дней к текущему значению.

# layout.description
source: Select a layout for the page. Any effect depends on the website template.
ru: Выберете шаблон для страницы. Любые эффекты зависят от шаблона web сайта.

# layout.details
source: This option may not have any impact on the page design since it depends on how (and if) the front end template uses it. In most default templates it's not used.
ru: Этот параметр не может оказать влияние на дизайн страницы, так как он зависит от того, как (и если) шаблон внешнего интерфейса его использует. В большинстве шаблонов по умолчанию он не используется.

# media.description
source: Attach media files related to the page.
ru: Прикрепить мультимедийные файлы, связанные с этой страницей.
