Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_ttcontent.xlf
Languages: ru

# bodytext.description
source: Enter the body text.
ru: Введите основной текст.

# bodytext.details
source: Here you enter the body text of the content element. Usually you can use some HTML formatting tags, if you're using Internet Explorer you can even format the content visually. The field is reused in most other types and so switching between the content element types will bring the value of this field with it. When you're using this field with the "Text" and "Text & Images" types, the content is used as ordinary body text. Each linebreak normally signifies a new paragraph, you can use the special TYPO3 tag, &lt;LINK&gt;, for making links. You can use many HTML tags but there are limitations as well. This will depend on the implementation. <b>Bulletlists:</b> If the type is "Bulletlist" each line in this field is a bulletlist entry. <b>Tables:</b> If the type is "Table" each line represents a table row. Within each line you divide the columns by inserting a vertical bar, |. So making a table row with 3 columns could look like "This is column 1 | Column 2 here | Third column!". Use the table wizard for creating tables - that is much easier than "coding" them. <b>Parameters:</b> Types like "Script", "Form" and "Multimedia" use this field for parameters you can pass to the element. And the "HTML" type accepts any input as raw HTML which is simply displayed on the website without any preprocessing. <strong>Rich Text Editor:</strong> With the types "Text" and "Text & Images" the Rich Text editor is used for editing if your browser supports it and the editor is generally enabled in the system. Be aware that the content is "cleansed" before it goes into the database when you're using the "Text" and "Text & Images" types. <b>Making a mail form:</b> When you have selected the content element type "Form" you should enter lines of parameters into this field. This is a brief example: Your name: | *name=input,40 | [Enter name!] Your email: | *email=input,40 Your address: | address=textarea,40,10 Your haircolor: |hair=radio|Blue=blue, Red=red |formtype_mail = submit | Send form |subject=hidden| Enter a subject here! |html_enabled=hidden | 1 The first two lines makes input-fields for name and email, both are marked "required" by the * and the name field has a default value of "[Enter name!]". The third line is a text box and the fourth makes radiobuttons to select haircolor. Then there are three important lines in the end. The first makes a submit button with the label "Send form", the second line is the subject of the email the receiver gets and the third line makes the form result render in an HTML-table. It is much easier to use the Form Wizard for creating forms. <b>Notice:</b> Before any form will ever work, you must enter a recipient email address. The "Recipient-email:" field is used for that (this is in fact the Subheader field used!).
ru: Здесь Вы вводите основной текст элемента содержимого. Обычно Вы можете использовать некоторые теги форматирования HTML, если Вы используете Internet Explorer, то даже сможете отформатировать содержимое визуально. Это поле используется почти во всех типах содержимого, и переключаясь между ними, содержимое этого поля также переносится. Используя это поле в типах содержимого "Текст" и "Текст с изображением", это поле соответствует простому тексту. Каждый переход строки соответствует параграфу, можно использовать специальный TYPO3 тег, &lt;LINK&gt;, для обозначения ссылок. Можно использовать многие HTML теги, но с некоторыми ограничениями, зависящими от применения. <b>Списки:</b> В типе "Список", каждая строка в этом поле представляет элемент списка. <b>Таблицы:</b> Если тип – "Таблица", каждая строка представляет строку таблицы. Каждая стрка разделяется на столбцы, вставкой вертикальной черты, |. Так для создания строки таблицы с 3 столбцами выглядит так: "Это - столбец 1 | Столбец 2 здесь | Третий столбец!". Используйте мастера таблицы для ее составления, что намного более просто чем их "кодирования". <b>Параметры:</b> Типы подобные "Скрипт", "Форма" и "Мультимедиа" используют это поле для параметров, передаваемых элементу. А тип "HTML" принимает любое введенное значение, как необработанный HTML, который просто отображается на Web-сайте без какой-либо предварительной обработки. <strong>Редактор сложного текста (Rich Text Editor):</strong> В типах "Текст" и "Текст с изображением" используется редактор текста, елси он поддерживается браузером и включен в системе. Удостоверьтесь, что содержимое "очищено" перед вводом в базу данных. <b>Создание почтовой формы:</b> Выбрав элемент содержимого типа "Форма", нужно ввести строки параметров в это поле. Вот короткий пример: Ваше имя: | *name=input,40 | [Введите имя!] Ваш email: | *email=input,40 Ваш адрес: | address=textarea,40,10 Ваш цвет волос: |hair=radio|Blue=blue, Red=red |formtype_mail = submit | Отослать форму |subject=hidden| Введите тему! |html_enabled=hidden | 1 Первые две строки создают поле вводы для имени и email, оба отмечены как "требуемые", установкой * в конце и у поля имя введено значение по умолчанию "[Введите имя!]". Третяя строка – текстовый блок, а четвертая создает переключатели для выбора цвета волос. В конце идут три важные строки. Первая создает кнопку подтверждения формы, с название "Отослать форму", вторая содержит тему email, отсылаемого получателю, а третяя помещает результат обработки формы в таблицу HTML. Намного проще использовать мастера создания форм. <b>Примечание:</b> перед тем, как заработает любая форма, нужно ввести адрес получателя. Для этого используется поле "Email получателя:" (фактически для этого используется поле подзаголовок!).

# category_field.description
source: Choose which category-relation field to refer to.
ru: Выберите, какому полю категорий следовать.

# category_field.details
source: Depending on your setup there may be more than one field for building relations between categories and pages or content elements. To create a proper selection for the menu, the appropriate field must be chosen.
ru: В зависимости от особенностей вашей сборки может быть более одного поля для построения связей между категориями и страницами или элементами содержимого. Для правильного построения меню следует выбрать нужное поле.

# colPos.description
source: Select the column position this element. <strong>Notice</strong> this will affect whether the element is visible.
ru: Выберете в какую колонку поместить этот элемент. <strong>Примечание</strong> это затрагивает видимост элемента.

# colPos.details
source: Most websites use only one column of content. However some templates lets you put content in multiple columns and this option allows you to select another column for the element. <strong>Notice</strong> that selecting another column than "Normal" will make the content element disappear unless that column is also displayed in the website template. If your content element is 'strangely' not visible please make sure the Column and Language selectors are set correctly.
ru: На большинстве сайтов используется лишь одна колонка для содержимого. Но некоторые шаблоны позоволяют располагать содержимое в нескольких колонках, а этот параметр определяет в какой. <strong>Примечание</strong> выбрав здесь любую колонку, кроме "Обычной" может сделать элемент невидимым, если эта колонка не отображена в шаблоне сайта. Если элемент содержимого "никак" не появляется, проверьте установку параметров Колонка и Язык.

# cols.description
source: Select a fixed number of table columns
ru: Выберете определенное количество колонок таблицы.

# CType.description
source: Select the kind of page content this element represents. New options will appear when you save the record.
ru: Выберете, какой тип содержимого страницы представляет этот элемент. При сохранении элемента появятся дополнительные параметры.

# CType.details
source: The 'Type' of content you select determines which options you have in the editform, so make sure to save the record before you make changes. This is a description of the various types: <strong>Header</strong> This type allows you insert a standard content element header and nothing more. Almost all the other types described below also includes the header with the exact same options. So the Header type just provides a way to insert a header <em>only</em> without anything else. <strong>Text</strong> The Text type allows you to insert regular page content. <strong>Text & Images</strong> This is the same as the Text type (regular page content) but with the option of attaching images. <strong>Images</strong> The same as Text & Images but without the text field - so only images. <strong>Bullet list</strong> Lets you create a bullet list. Each line in the text-field will appear as a single line in the bulletlist. <strong>Table</strong> Lets you create <em>simple</em> tables. Each line represents a tablerow and vertical bars '|' separates each column. <strong>Filelinks</strong> Allows you to present a list of files for download. You can have thumbnails attached to the list including filesize. <strong>Multimedia</strong> Lets you insert multimedia elements such as sound, video, java applets and flash animations. <strong>Form</strong> Lets you create mail forms. There is a special syntax to use when you wish to create form fields. <strong>Search</strong> This inserts a search box and it will also display the search result if a query is performed to the page. <strong>Login</strong> Displays a login box for website users. You must create at least one Website user and user group before this makes any sense to use. <strong>Textbox</strong> This is mainly for customly defined design which includes typically some text and an image. So in other words the function is not generally defined. However the default subtypes will let you choose various ways to display some text with an image. Use only if instructed to. <strong>Menu/Sitemap</strong> Offers a selection of various link menus and a sitemap you can insert on a page. <strong>Insert records</strong> This is a placeholder for other records. In other words, by this element you can attach other content elements from elsewhere and thus insert them this page. <strong>Insert plugin</strong> This will allow you to insert a forum, guestbook, list of addresses, shopping basket etc. The various features are available <em>only</em> if they are configured correctly in the template of your website. So before you use it, make sure this is the case. <strong>HTML</strong> This is plain HTML content. Everything put here will be displayed directly on the page without any preprocessing.
ru: "Тип" элемента влияет на параметры, отображаемые в форме его редактирования, поэтому удостоверьтесь, что сохранили запись перед дальнейшими ее изменениямиs. Вот описание различных типов: <strong>Заголовок</strong> Этот тип позволяте вставить стандартный заголовок элемента содержимого и ничего более. Почти все другие типы, описанные ниже, также включают заголовок в своих параметрах. Но тип Заголовок, просто предоставляет возможность вставки заголовка, и <em>ничего</em> более. <strong>Текст</strong> Позволяет вставить обычное содержимое страницы. <strong>Текст с изображением</strong> То же, что и тип Текст (обычное содержимое страницы), но с возможностью вставки изображения. <strong>Изображение</strong> То же, что и Текст с изображением, но без текста. <strong>Список</strong> Позволяет создать список. Каждая строка текстового поля превращается в отдельный элемент списка. <strong>Таблица</strong> Позволяет создать <em>единственную</em> таблицу. Каждая строка преобразуется в строку таблицы, а вертикальная черта "|" разделяет колонки. <strong>Ссыка на файл</strong> Предоставляет создать список файлов для скачивания. Можно вставить эскизы в список, также как и размер файлов. <strong>Мультимедиа</strong> Позволяет вставить мультимедиа элементы – звук, видео, java приложения и flash анимацию. <strong>Форма</strong> Позволяет создавать почтовые формы. Существует специальный синтаксис для их создания. <strong>Форма поиска</strong> Вставка поисковой формы с отображением результатов поиска, если запрос относится к странице. <strong>Форма регистрации на сайте</strong> Отображает форму регистрации пользователей на сайте. Нужно создать хотя бы одного пользователя и их группу, перед тем как появиться смысл в ее использовании. <strong>Текстовое поле</strong> Нужно для определенным образом разработанного дизайна, обычно включающего некий текст и изображение. Другими словами, что-то неопределенное. Однако определенные подтипы позволяют выбирать различные пути для создания текста и изображения. Используейте только если знаете, что делаете. <strong>Меню/карта сайта</strong> Предлагает на выбор различные меню ссылки и карты сайта, которые Вы можете вставить на страницу. <strong>Вставить записи</strong> Это место для помещения других записей. Другими словами, этот элемент позволяет прикрепить любые другие элементы содержимого откуда то ни было, и, таким образом, поместить их на страницу. <strong>Вставка расширения</strong> Позволяет вставить форум, гостевую книгу, список адресов, корзину покупок и т.п. Различные возможности появляются <em>только</em> если они должным образом настроены в шаблоне сайта. Убедитесь в этом перед их использованием. <strong>Скрипт (сценарий)</strong> Зарезервировано для пользовательских целей, дозволенных разработчиком шаблона, позволяя Вам вставлять определенное этим кодом содержимое страницы или любое специализированное, нужное Вам содержимое. <strong>HTML</strong> Обычный HTML код. Все, помещенное здесь, будет отображено на странице без какой-либо обработки.

# _CType.seeAlso
source: tt_content:colPos, tt_content:sys_language_uid, About Content Elements | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/
ru: tt_content:colPos, tt_content:sys_language_uid, Об элементах содержимого | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/

# date.description
source: Enter a date to be displayed above the header.
ru: Введите данные, отображаемые под заголовком.

# .description
source: All visible content on webpages in TYPO3 is typically made by "Page content" records. They are typically referred to as "Content Elements". Often Content Elements are managed by the "Page" module which is designed to handle Content Elements in multiple columns and languages.
ru: Все видимое наполнение web страниц в TYPO3 обычно формируется записями "Pagecontent", обычно упоминаемые как "Элементы содержимого". Часто Элементы содержимого управляются через модуль "Страница", спроектированный для обработки содержимого в нескольких колонках и на нескольких языках.

# .details
source: "Page content" records is ordered and can thus be rearranged. Also notice that the "Language" and "Column" selector of the "Page content" records determines where and in which situation they appear. If you do not change the value of the "Language" and "Column" selectors you are most sure that the element will appear by default.
ru: Записи "Pagecontent" идут в определенном порядке и могут быть переупорядочены. Также помните, что выбор "Колонки" и "Языка" влияет на место и ситуацию появления содержимого. Если Вы не изменяли значения "Язык" и "Колонка", то можете быть уверенны, что содержимое сформируется по умолчанию.

# endtime.description
source: Enter the date from which the content element will disappear from the website.
ru: Введите дату, начиная с которой элемент содержимого будет скрыт с сайта.

# fe_group.description
source: Select a Website usergroup which is exclusively allowed to view the element.
ru: Выберете группу пользователей сайта, которая сможет видеть этот элемент содержимого.

# fe_group.details
source: The options in this box depends on which Website usergroups are created and available for you. When you select a user group here, the content element will no longer be visible to users which are not logged in. Only Website users which are logged in and members of the group you selected will be allowed to see the element. If you select "Hide at login" the effect is kind of reversed in that the element <em>disappears</em> if <em>any</em> Website user is logged in. This is useful if you want to present information like "How to login" and such which is irrelevant if a user is finally logged in.
ru: Параметры в этом блоке зависят от того, какие группы пользователей созданы на сайта и доступны для Вас. Выбрав здесь группы пользователей, Вы скрываете элемент содержимого для незарегистрированных на сайте пользователей. Этот элемент будет виден лишь при регистрации на сайте пользователей из выбранных групп. Эффект от "Скрыть после входа в систему", отчасти противоположен – элемент содержимого будет <em>скрыт</em> после входа в систему <em>любого</em> пользователя сайта. Это полезно для предоставления информации, например, как зарегистрироваться на сайте, которая уже не нужна после регистрации пользователя.

# filelink_size.description
source: Check this, if you wish the filesizes to be displayed.
ru: Включите, если хотите отобразить размер файла.

# header.description
source: Enter a headline for the content element.
ru: Введите заголовок элемента содержимого.

# header.details
source: Almost all content elements (except the HTML type for instance) will display this header above the content. If you don't want a header displayed, select the header Layout to "Hidden". Alternatively you can choose not to enter any content in this field. Some content element types do not display the header by default. In those cases the Header field is typically labeled "Name" instead. One of these are the HTML type content element.
ru: Почти все элементы содержимого (за исключением пожалуй лишь типа HTML), отображают заголовок над содержимым. Если Вы не желаете отображать заголовок, установите тип заголовка как "Скрытый". Или Вы можете ничего не вводить в это поле. Некоторые типы элементов содержимого не отображают по умолчанию заголовок. В этом случае поле заголовка называется "Название". Один из таких типов – элемент содержимого HTML.

# header_layout.description
source: Select a visual design for the header.
ru: Выберете визуальный дизайн заголовка.

# header_layout.details
source: If you select "Default" the standard design (which is one of the layouts 1-5) will be used. Alternatively you can select from Layout 1 through 5 which are configured in the website template with individual visual designs. If you select "Hidden" the header will simply not appear. This is useful if you wish a header for the content element (in order to identify it in the backend) but do not wish the header to be displayed on the website.
ru: Если Вы выберете "Обычный", будет использован стандартный дизайн (одна из компоновок 1-5). Либо Вы можете выбрать компоновку с 1 по 5, которые настраиваются в шаблоне сайта, как индивидуальный визуальный дизайн. Выбрав "Скрытый", Вы скроете заголовок. Это нужно, если Вы хотите назвать свой элемент содержимого (для идентификации его во внутреннем интерфейсе), но не хотите отображать заголовок на web сайте.

# header_link.description
source: Creates a link from the header. Insert a page id, email address or URL.
ru: Создается ссылка от заголовка. Можно вставить id страницы, адрес email или URL/

# header_link.syntax
source: If you insert an id-number, eg. "51", the link will refer to page with id=51 <em>inside</em> TYPO3. If you insert an email address, eg. "name@my-domain.test", the link will point to that email address. If you insert an URL or domain, eg. "www.typo3.org" or "http://www.my-domain.org", the link will point to that website.
ru: Если Вы вставите id-номер, например "51", будет создана ссылка на страницу с id=51 <em>внутри</em> TYPO3. Если Вы вставите email адрес, например "name@my-domain.test", ссылка будет указывать на этот адрес электронной почты. Если Вы вставите URL или домен, например "www.typo3.com" или "http://www.my-domain.org", ссылка будет указывать на этот web сайт.

# header_position.description
source: Places the header to the left, centered or to the right.
ru: Выравнивание заголовка по левому, правому краю или по центру.

# hidden.description
source: Check this box if you wish to hide the content element from being displayed.
ru: Установите этот флажок, если хотите скрыть элемент содержимого.

# imageborder.description
source: Check this, if you wish a colored border around the images.
ru: Включите, если хотите сделать цветную рамку вокруг изображения.

# imagecaption.description
source: Enter a caption for the image block
ru: Введите заголовок для блока изображений

# imagecaption.details
source: By default the caption is positioned below the whole image block. However your website template may be configured to allow individual image captions by setting "styles.content.imgtext.captionSplit=1" in your template constants. In that case each line in this field will be the image caption of the corresponding image in the list. The caption text field is also used by the content element type "Filelinks" where each line represents a description of a file in the list.
ru: По умолчанию заголовок позиционируется под всем блоком изображений. Но шаблон Вашего сайта может быть настроен для включения заголовка для каждого изображения, установкой "styles.content.imgtext.captionSplit=1" в константах Вашего шаблона. При этом каждая строка этого поля становиться заголовком соответствующего изображения в списке. Поле текста заголовка также используется элементов содержимого типа "Ссылки на файлы", где каждая строка представляет собой описание соответствующего файла в списке.

# imagecaption_position.description
source: Places the image caption to the left, centered or to the right.
ru: Выравнивание заголовка изображения по правому, левому краю или по центру.

# imagecols.description
source: Select the number of columns in the image block.
ru: Определите количество колонок в блоке изображений.

# image_compression.description
source: Select compression/quality options.
ru: Определить параметры сжатия/качества.

# .image_descr
source: The Page module is used to manage Content Elements effectively as they appear arranged in columns and languages. A Content Element has a large editing form with many options. The "Type" determines which options are visible. In the frontend - on the webpage - a Content Element like the above could look like this.
ru: Модуль Страница используется для удобства управления элементами содержимого, упорядочивания их по колонкам и языкам. Элементы содержимого имеют большие формы редактирования со множиством параметров. "Тип" определяет отображение параметров. Во внешнем интерфейсе – на web странице, элемент содержимого может выглядеть примерно так.

# image.description
source: Insert one or more images.
ru: Вставьте одно или несколько изображений.
