Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_ttcontent.xlf
Languages: ru

# table_cellpadding.details
source: Cell padding is the 'internal' margin of a table cell. The distance is equally applied in all directions, top, bottom, left and right.
ru: Это расстояние "внутрь" ячейки. Одинаковое расстояние по всем направлениям, сверху, снизу, справа и слева.

# table_cellspacing.description
source: Select table cell spacing.
ru: Выберете расстояние между ячейками таблицы.

# table_cellspacing.details
source: Cell spacing is the distance between table cells in rows an columns. The distance is equally applied in all directions, top, bottom, left and right.
ru: Это расстояние между ячейками в колонках и строках. Одинаковое расстояние по всем направлениям, сверху, снизу, справа и слева.
