Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/context_help/*.locallang_csh_systmpl.xlf
Languages: ru

# basedOn.description
source: Other Template Records that are included like "static templates".
ru: Другие записи шаблонов, включаемые как и "статические шаблоны"

# clear.description
source: Flags that will clear the inheritance of TypoScript code from former templates in the root line. There is a flag for Constants and one for Setup code.
ru: Флаги, очищающие наследование кода TypoScript от прежних корневых шаблонов. Существует флаг для Констант и для кода Настройки.

# clear.details
source: In the Web > Template / Template Analyser module you can see how far back in the template tree that constants and setup code is inherited.
ru: В модуле Веб> Шаблон / Анализатор Шаблона, можно проследить, где в дереве шаблона находятся наследуемые константы и код настроек.

# config.description
source: TypoScript Setup code
ru: Код настройки TypoScript

# config.details
source: Read more about TypoScript Templates in TSref, TypoScript by Example and Getting Started.
ru: Дополнително читайте о Шаблонах TypoScript в "TSref", "TypoScript на примерах" и "Как начать".

# constants.description
source: TypoScript Constants.
ru: Константы TypoScript

# .description
source: TypoScript template record.
ru: Запись шаблона TypoScript

# description.description
source: Enter a description of the template if you like.
ru: Если хотите, введите описание своего шаблона.

# .details
source: The 'Template' records are the vital components used to set the design of the webpages. No matter how (almost) you would like to build your website, it must be initiated by a 'Template' record placed in the root of the page tree of the site. Basically, create a 'Template' record, enter a title and make sure to check of Clear constants, setup and Rootline. Then enter some TypoScript configuration in the Setup field and you're set. It's very important to read how to do all this in the documents listed below! Also make sure you use the Web>Template module to do all the working with templates. It's a specialized tool to help you with this.
ru: Записи "Шаблона" - жизненно необходимые компоненты, использующиеся для определения дизайна web страниц. Почти не важно как Вы хотите строить сайт, но он должен начинаться с записи "Шаблона" на корневой странице в дереве сайта. Сначала создайте запись "Шаблона", введя ее название и убедитесь, что выбрали "Очистить константы" и "Настройки", а также установите флажок "Корень сайта". После чего нужно ввести некую настройку TypoScript в поле Настройка. Очень важно прочитать, как это все сделать в упомянутых ниже документах! Убедитесь, что используйте модуль Веб>Шаблон для работы с шаблоном. Это инструмент, специально разработанный для этого.

# editorcfg.description
source: Editor Configuration for the stylesheet editor extension.
ru: Редактор настроек для расширения редактирования таблицы стилей.

# endtime.description
source: End time. Use this to disable a template on a certain date.
ru: Время окончания. Используйте для выключения шаблона в определенную дату.

# hidden.description
source: Hiding the template will deactivate the template record.
ru: Скрыв шаблон, вы отключите запись шаблона.

# hidden.details
source: If the Template Record was the first record on a page hiding it will expose the second record on the page instead.
ru: Есил запись шаблона была первой записью, ее сокрытие приведет к использованию второй записи вместо нее.

# .image_descr
source: A Template Record with constants and setup code. The Web>Template module contains tools which will help you to edit and validate TypoScript structures.
ru: Запись шаблона с константами и кодом настройки. Модуль Веб>Шаблон содержит инструменты для редактирования и настройки структуры TypoScript.

# includeStaticAfterBasedOn.description
source: If set, static templates will be included after "based-on" templates. It basically swaps the order of inclusion of these external TypoScript sources.
ru: Если включено, то статические шаблоны включаются после "базовых" шаблонов. Что в основном меняет порядок включения внешних источников TypoScript.

# includeStaticAfterBasedOn.details
source: The Web > Template / Template Analyser module allows you to view the order of inclusion of all TypoScript sources your template uses.
ru: Модуль Веб> Шаблон / Анализатор Шаблона позволяет проследить порядок включения всех используемых источников TypoScript в шаблон.

# include_static.description
source: Static Template records to include.
ru: Включаемые записи из статических шаблонов

# include_static_file.description
source: Static Template files to include.
ru: Включаемые файлы статических шаблонов

# include_static_file.details
source: Static template files are registered by extensions contrary to Static Template records which come from the static database table, "static_template".
ru: Статические файлы шаблонов вносятся из расширений, вопреки Статическим записям Шаблонов, которые заносятся из статической таблицы базы данных, "static_template".

# nextLevel.description
source: Defines a template record to make active one level out in the page tree of this branch. This can be used to define another template record for the general website while having a special template for the frontpage.
ru: Определяется запись шаблона, для выделения уровня этой ветви в дереве страниц. Можно использовать для определения одной записи шаблона для всего web сайта, а для определенных страниц использовать другую запись.

# resources.description
source: Resource files for the template. For example a logo, a TTF-font etc.
ru: Файлы ресурсов для шаблона. Например - логотип, TTF шрифт и т.п.

# resources.details
source: Resource files can be referenced in TypoScript Template code by [filename]*.[ext] and has the advantage that the reference from TypoScript is not broken if you copy or export a Template Record where the resources ends up with new names.
ru: На файлы ресурсов в коде шаблона TypoScript можно сослаться через [filename]*.[ext] и имеет преимущество, если ссылка из TypoScript не разорвалась при копировании или экспорте записи шаблона, без включения ресурсов или при изменении их имен.

# root.description
source: Defines that the template represents a root of a website.
ru: Говорит о том, что шаблон представляет корень web сайта.

# sitetitle.description
source: Website title. Typically this will automatically be prefixed all page titles in the <title> tag of the frontend pages.
ru: Заголовок web-сайта. Обычно он автоматически предшествует заголовку всех страниц в теге <title> во внешнем интерфейсе.

# starttime.description
source: Start time. Use this to enable a template on a certain date.
ru: Начальное время. Используйте для включения шаблона в определенную дату.

# static_file_mode.description
source: Define the mode of inclusion of static template files.
ru: Определяет способ включения статических файлов шаблонов.

# static_file_mode.details
source: If you are in doubt about the inclusion order, make sure to use the Web > Template / Template Analyser to view the order.
ru: Если порядке включения вызывает подозрение, разберитесь, используя Веб> Шаблон / Анализатор Шаблона, для просмотра порядка включения.

# title.description
source: The title of the template record is only an internal label and does not have any effect on the output in the frontend.
ru: Заголовок записи шаблона - лишь внутренняя метка, не влияющая на отображение во внешнем интерфейсе.
