Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/TableOperations/*.locallang.xlf
Languages: it, ru

source: Abbreviation
ru: Аббревиатура

source: Alignment
it: Allineamento
ru: Выравнивание

# Align on this character
source: Align text relative to this character
it: Allinea il testo in relazione a questo carattere
ru: Выравнивать текст относительно этого символа

source: All four sides
it: Tutti e quattro i lati
ru: Все четыре стороны

source: Background:
ru: Фон:

source: Background and colors
it: Background e colori
ru: Фон и цвет

source: Baseline
ru: Базовая линия

source: Border color
it: Colore bordo
ru: Цвет рамки

source: Borders
it: Bordi
ru: Рамки

source: Border style
it: Stile bordo
ru: Стиль рамки

source: Border style:
it: Stile bordo:
ru: Стиль рамки:

# Border width
source: Border width in pixels
it: Dimensione bordo
ru: Ширина рамки

source: Border width:
it: Dimensione bordo:
ru: Ширина рамки:

source: Bottom
ru: Низ

source: Caption:
it: Didascalia:
ru: Заголовок:

# captionOrSummary-required
source: Please enter at least one of caption or summary
ru: Пожалуйста, введите заголовок или итоги

# caption-required
source: Please enter a caption
ru: Пожалуйста, введите заголовок

source: Cell height
it: Altezza cella
ru: Высота ячейки

source: Cell padding:
ru: Внутренние отступы ячейки:

source: Cell Properties
it: Proprietà cella
ru: Свойства ячейки

source: Cell spacing:
ru: Расстояние между ячейками:

source: Cell Type and Scope
it: Tipo di cella e Scope
ru: Тип и диапазон ячейки

source: Cell width
it: Larghezza cella
ru: Ширина колонки

source: Center
it: Centro
ru: Центр

source: Character
it: Carattere
ru: Символ

# Class:
source: Classes:
it: Classe
ru: Классы:

# Class selector
source: Classes
it: Selettore Classe CSS
ru: Классы

source: Collapsed borders
it: Bordi sgonfi
ru: Общие рамки ячеек

source: Color:
it: Colore:
ru: Цвет:

# Column Properties
source: Column Cells Properties
ru: Свойства ячеек столбца

# CSS Style
source: Style
it: Stile CSS
ru: Стиль CSS

source: Dashed
it: Tratteggiato
ru: Пунктирная

source: Data cells
ru: Ячейки данных

source: Default
ru: По умолчанию

source: Description
it: Descrizione
ru: Описание

source: Description of the nature of the table
it: Descrizione della natura della tabella
ru: Описание таблицы

source: Detached borders
ru: Раздельные рамки ячеек

source: Dotted
it: Punteggiato
ru: Точечная

source: Double
ru: Двойная

# FG Color:
source: Text:
it: Colore Foreground:
ru: Цвет фона:

source: Float:
ru: Плавающая:

source: Frame and borders
it: Cornici e bordi
ru: Рамки и границы

source: Frames:
it: Cornici:
ru: Фреймы:

source: Groove
ru: Трехмерная "желобок"

# Header
source: Header cell
it: Intestazione della cella
ru: Ячейка заголовка

source: Header abbreviation
ru: Сокращенные заголовки

source: Header cells on left
ru: Ячейки заголовков слева

source: Header cells on top
ru: Ячейки заголовков сверху

source: Header cells on top and left
ru: Ячейки заголовков слева и сверху

# Header for column
source: Header cell for column
ru: Ячейка заголовка для столбца

# Header for row
source: Header cell for row
ru: Ячейка заголовка для строки

# Header for row group
source: Header cell for row group
ru: Ячейка заголовка для группы строк

source: Headers
ru: Заголовки

# Headers:
source: Header cells
ru: Заголовки:

source: Headers for row groups
ru: Заголовок для групп строк

source: Headers for rows
ru: Заголовок для строк

source: Height:
it: Altezza:
ru: Высота:

source: Height unit
it: Unità di misura altezza
ru: Единицы высоты

source: Horizontal alignment of text within cell
it: Allineamento orizzontale del testo nella cella
ru: Горизонтальное выравнивание текста внутри ячейки

source: How many columns would you like to merge?
it: Quante colonne vuoi fondere?
ru: Сколько колонок Вы хотите объединить?

source: How many rows would you like to merge?
it: Quante righe vuoi fondere?
ru: Сколько строк Вы хотите объединить?

source: Image URL:
it: URL immagine:
ru: Адрес картинки:

source: Inset
ru: Трехмерная "вставка"

source: Justify
it: Giustificato
ru: Выключка

source: Layout
ru: Шаблон

source: Left
it: Sinistra
ru: Влево

# Make cells data cells
source: Make all row cells data cells
ru: Сделать все ячейки строки ячейками данных

# Make cells header cells
source: Make all row cells header cells
ru: Сделать все ячейки строки ячейками заголовка

source: Margin
it: Margine
ru: Отступ

source: Middle
it: In mezzo
ru: Посередине

# No border
source: None
it: Nessuno
ru: Нет

source: No header cells
ru: Нет ячеек заголовков

source: None
it: Nessuno
ru: Без

source: Non-floating
ru: Нет

# Normal
source: Data cell
it: Cella normale
ru: Ячейка данных

source: No rules
it: Senza linee
ru: Без правил

source: No sides
it: Senza lati
ru: Без сторон

# not-del-last-cell
source: HTMLArea cowardly refuses to delete the last cell in row.
it: HTMLArea codardamente si rifiuta di cancellare l'ultima cella della riga
ru: Последнюю ячейку в строке удалить нельзя.

# not-del-last-col
source: HTMLArea cowardly refuses to delete the last column in table.
it: HTMLArea codardamente si rifiuta di cancellare l'ultima colonna della tabella
ru: Последнюю колонку в таблице удалить нельзя.

# not-del-last-row
source: HTMLArea cowardly refuses to delete the last row in table.
it: HTMLArea codardamente si rifiuta di cancellare l'ultima riga della tabella
ru: Последнюю строку в таблице удалить нельзя.

source: Not set
it: Non impostato
ru: Не установлено

source: Outset
ru: Трехмерная "выступ"

source: percent
it: percentuale
ru: проценты

source: pixels
it: pixel
ru: точки

source: Please click into some cell
it: Clicca in una cella
ru: Пожалуйста, щелкните мышкой по какой-нибудь ячейке

source: Ridge
ru: Трехмерная "ребро"

source: Right
it: Destra
ru: Вправо

source: Row group
it: Gruppo di righe
ru: Группа строк

source: Row group:
it: Gruppo di righe:
ru: Группа строк:

source: Row height
it: Altezza riga
ru: Высота строки

source: Row Properties
it: Proprietà righe
ru: Свойства строки

source: Row width
it: Larghezza riga
ru: Ширина строки

source: Rules:
it: Linee:
ru: Разделительные линии:

source: Rules will appear between all rows and columns
it: Le linee appariranno fra tutte le righe e le colonne
ru: Разделительные линии между всеми рядами и столбцами

source: Rules will appear between columns only
it: Le linee appariranno solo tra le colonne
ru: Разделительные линии только между столбцами

source: Rules will appear between rows only
it: Le linee appariranno solo tra le righe
ru: Разделительные линии только между рядами

source: Scope:
ru: Диапазон:

# scope_column
source: Column
it: Colonna
ru: Столбец

# Scope of header cell
source: Scope of the header
it: Scope dell'intestazione
ru: Диапазон заголовка

# scope_row
source: Row
it: Riga
ru: Строка

# scope_rowgroup
source: Group of rows
it: Gruppo di righe
ru: Группа строк

source: Size and Headers
it: Dimensioni e intestazioni
ru: Размер и заголовки

source: Solid
ru: Сплошная

source: Space between adjacent cells
it: Spazio tra celle adiacenti
ru: Расстояние между смежными ячейками

source: Space between content and border in cell
it: Spazio tra il contenuto ed il bordo della cella
ru: Расстояние между содержимым и рамкой ячейки

source: Spacing and padding
it: Spaziatura e padding
ru: Отступы (внешние и внутренние)

source: Specifies the type of cell
it: Specifica il tipo della cella
ru: Определяет тип ячейки

# Specifies the type of cells
source: Specifies the type of cells of the column
ru: Определяет тип ячеек столбца

source: Specifies where rules should be displayed
it: Specifica dove visualizzare le linee
ru: Определяет вид разделительных линий

source: Specifies where the table should float
it: Specifica dove posizionare la tabella
ru: Указывает должна ли таблица плавать

source: Specifies which sides should have a border
it: Specifica quali lati dovrebbero avere un bordo
ru: Указывает какие стороны должны иметь рамку

source: Summary:
it: Riassunto:
ru: Итог:

# Summary of the table purpose and structure
source: Summary of the table's purpose and structure
it: Riassunto dello scopo della tabella e della struttura
ru: Сводка по назначению и структуре таблицы

# summary-required
source: Please enter a summary
ru: Пожалуйста, введите итоги

source: Table body
it: Corpo della tabella
ru: Содержимое таблицы

# Table body class:
source: Body:
ru: Содержимое:

# Table body class selector
source: Classes of the table body
it: Classe del corpo della tabella
ru: Класс тела таблицы

# Table class:
source: Table:
it: Tabella:
ru: Классы таблиц:

# Table class selector
source: Classes of the table
it: Classe della tabella
ru: Классы таблицы

source: Table footer
it: Fondo della tabella
ru: Итоги таблицы

# Table footer class:
source: Footer:
it: Fondo:
ru: Итоги:

# Table footer class selector
source: Classes of the table footer
it: Classe del fondo della tabella
ru: Класс нижнего колонтитула таблицы

source: Table header
it: Intestazione della tabella
ru: Заголовок таблицы

# Table header class:
source: Header:
it: Intestazione:
ru: Заголовок:

# Table header class selector
source: Classes of the table header
it: Classe dell'intestazione della tabella
ru: Класс заголовка таблицы

source: Table headers
ru: Заголовки таблицы

source: Table height
it: Altezza tabella
ru: Высота таблицы

source: Table Properties
it: Proprietà Tabella
ru: Свойства таблицы

# Table section
source: Table section to which the row belongs
it: Sezione della tabella alla quale la fila appartiene
ru: Секция таблицы, к которой принадлежит строка

source: Table width
it: Larghezza tabella
ru: Ширина таблицы

# Technische Universitat Ilmenau
source: Technische Universität Ilmenau
ru: Технический университет Ильменау

source: Text alignment:
it: Allineamento testo
ru: Выключка текста:

source: The bottom side only
it: Solo il lato inferiore
ru: Только снизу

source: The left-hand side only
it: Solo il lato sinistro
ru: Только слева

source: The right and left sides only
it: Solo i lati destro e sinistro
ru: Справа и слева

source: The right-hand side only
it: Solo il lato destro
ru: Только справа

source: The top and bottom sides only
it: Solo i lati superiore ed inferiore
ru: Сверху и снизу

source: The top side only
it: Solo il lato superiore
ru: Только сверху

# TO-cell-delete
source: Delete cell
it: Elimina cella
ru: Удалить ячейку

# TO-cell-insert-after
source: Insert cell after
it: Inserisci cella dopo
ru: Вставить ячейку после

# TO-cell-insert-before
source: Insert cell before
it: Inserisci cella prima
ru: Вставить ячейку перед

# TO-cell-merge
source: Merge cells
it: Fondi celle
ru: Объединить ячейки

# TO-cell-prop
source: Cell properties
it: Proprietà celle
ru: Свойства ячейки

# TO-cell-split
source: Split cell
it: Dividi cella
ru: Разделить ячейки

# TO-col-delete
source: Delete column
it: Elimina colonna
ru: Удалить колонку

# TO-col-insert-after
source: Insert column after
it: Inserisci colonna dopo
ru: Вставить колонку после

# TO-col-insert-before
source: Insert column before
it: Inserisci colonna prima
ru: Вставить колонку перед

# TO-col-prop
source: Column properties
ru: Свойства колонки

# TO-col-split
source: Split column
it: Dividi colonna
ru: Разделить колонку

source: Top
ru: Сверху

# TO-row-delete
source: Delete row
it: Elimina riga
ru: Удалить строку

# TO-row-insert-above
source: Insert row before
it: Inserisci riga prima
ru: Вставить строку перед

# TO-row-insert-under
source: Insert row after
it: Inserisci riga dopo
ru: Вставить строку после

# TO-row-prop
source: Row properties
it: Proprietà riga
ru: Свойства строки

# TO-row-split
source: Split row
it: Dividi riga
ru: Разделить строку

# TO-table-prop
source: Table properties
it: Proprietà tabella
ru: Свойства таблицы

# TO-table-restyle
source: Re-apply table styles
ru: Снова применить стили таблицы

# TO-toggle-borders
source: Toggle borders
it: Inverti bordi
ru: Включить границы

source: Type of cell:
it: Tipo di cella:
ru: Тип ячейки:

source: Type of cells
ru: Тип ячеек

source: Type of cells of the column:
ru: Тип ячеек столбца:

source: Undefined
it: Indefinito
ru: Не определено

source: Unset color
it: Resetta colore
ru: Убрать цвет

source: URL of the background image
it: URL dell'immagine di background
ru: Адрес фонового изображения

source: Vertical alignment:
it: Allineamento verticale:
ru: Вертикальное выравнивание:

source: Vertical alignment of content within cell
it: Allineamento verticale del contenuto nella cella
ru: Вертикальное выравнивание содержимого ячейки

source: Width:
it: Larghezza:
ru: Ширина:

source: Width unit
it: Unità di misura
ru: Единицы ширины
