Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/extensions/Acronym/*.locallang_csh.xlf
Languages: fr, ru

# abridgedTerm.alttitle
source: Abbreviation
fr: Abréviation
ru: Аббревиатура

# abridgedTerm.description
source: Select the short form of the term.
fr: Sélectionner la forme courte du terme.
ru: Выберете краткую форму термина.

# .alttitle
source: htmlArea RTE > Abbreviation
fr: htmlArea RTE > Abréviation
ru: htmlArea RTE > Сокращения

# .description
source: The "Abbreviation" dialogue allows to associate an abbreviation to a term.
fr: La boîte de dialogue "Abréviation" permet d'associer une abréviation à un terme.
ru: Диалог "Сокращения" позволяет назначит сокращения для терминов.

# .details
source: Clicking the "Insert abbreviation" icon in the RTE tool bar opens a dialogue that allows to insert an abbreviation or to edit one that already exists in the content. Any existing abbreviation is underlined with a broken line and the cursor changes to a question mark when the mouse goes over it. The dialogue allows to associate an abbreviation to a term. The abbreviation may be selected among abbreviations that have been pre-defined in the database or may be entered directly in the dialogue.
fr: Cliquer sur l'icône "insérer abréviation" dans la barre d'outil du RTE ouvre une boîte de dialogue permettant d'insérer une abréviation ou d'éditer une abréviation déjà existante dans le contenu. Toute abréviation déjà existante est sous-lignée avec un trait interrompu et le curseur se transforme en point d'interrogation lorsque la souris la survole. La boîte de dialogue permet d'associer une abréviation à un terme. L'abréviation peut être sélectionnée parmi les abréviations qui ont été pré-définies dans la base de données ou peut-être entrée directement dans la boîte de dialogue.
ru: Щелчок по значку "Вставить сокращения" на панели инструментов RTE откроет диалог, позволяющий вставить сокращение или отредактировать существующие в содержимом. Все существующие сокращения подчеркнуты пунктиром, а при наведении на них, курсор мыши превращается в знак вопроса. Диалог позволяет назначить сокращение для термина. Можно выбрать уже существующее в базе данных сокращение, или ввести новое прямо в диалоге.

# .image_descr
source: "Insert abbreviation" icon in the editor tool bar.
fr: Icône "Insérer une abréviation" dans la barre d'outils de l'éditeur.
ru: Значок "Вставить сокращение" в панели инструментов.

# language.alttitle
source: Language
fr: Langue
ru: Язык

# language.description
source: Select the language for which the abbreviation is defined.
fr: Sélectionner la langue pour laquelle l’abréviation est définie.
ru: Выберете язык, для которого определяется сокращение.

# language.details
source: The selected language will be set as the language attribute of the abbreviation (or acronym) element. If a pre-defined abbreviation (or acronym) is selected, the language for which it is defined, if any, is initially selected.
fr: La langue sélectionnée sera utilisée en attribut "langue" de l'élément abréviation (ou acronyme). Si une abréviation pré-définie (ou un acronyme) est sélectionnée, la langue qui lui est associée, s'il y en a une, sera pré-sélectionnée.
ru: Выбранный язык будет установлен в качестве значения атрибута language элемента abbr (или acronym). Если выбрана установленная аббревиатура (или акроним), язык, для которого она определена уже будет выбран.

# preDefinedAbbreviation.alttitle
source: Pre-defined abbreviations
fr: Abréviations pré-définies
ru: Установленные аббревиатуры

# preDefinedAbbreviation.description
source: This section lets you select abbreviations already defined in the database.
fr: Cette section vous permet de sélectionner des abréviations pré-définies dans la base de données.
ru: В данном разделе можно выбрать из уже существующих в базе данных аббревиатур.

# preDefinedAcronym.alttitle
source: Pre-defined acronyms
fr: Acronymes prédéfinis
ru: Установленные акронимы

# preDefinedAcronym.description
source: This section lets you select acronyms already defined in the database.
fr: Cette section vous permet de sélectionner des acronymes pré-définis dans la base de données.
ru: В данном разделе можно выбрать из уже существующих в базе данных акронимов.

# termToAbridge.alttitle
source: Term to abbreviate
fr: Terme à abréger
ru: Сокращаемый термин

# termToAbridge.description
source: This section lets you enter a term for which the current selection will be the short form.
fr: Cette section vous permet de saisir le terme pour lequel la sélection courante sera la forme courte.
ru: Этот раздел позволяет ввести термин, для которого текущее выделение служит сокращением.

# unabridgedTerm.alttitle
source: Unabbreviated term
fr: Terme non-abrégé
ru: Не сокращенный термин

# unabridgedTerm.description
source: Select the unabbreviated form of the term.
fr: Sélectionner la forme non-abrégée du terme.
ru: Выберете не сокращенную форму термина.

# unabridgedTerm.details
source: The selected term will be set as the title attribute of the abbreviation (or acronym) element.
fr: Le terme sélectionné sera utilisé en attribut "title" de l'élément abréviation (ou acronyme).
ru: Выбранный термин будет установлен в качестве значения атрибута title элемента abbr (или acronym).

# useThisTerm.alttitle
source: Use this term
fr: Utiliser ce terme
ru: Использовать этот термин

# useThisTerm.description
source: Enter the term that you want to associate as the unabbreviated form of the current selection.
fr: Saisir le terme que vous souhaitez associer en tant que forme non-abrégée de la sélection courante.
ru: Введите термин, который нужно назначить в качестве развернутой формы для выбранного.

# useThisTerm.details
source: The entered term will be set as the title attribute of the abbreviation (or acronym) element.
fr: Le terme saisi sera utilisé en attribut "title" de l’élément abréviation (ou acronyme).
ru: Выбранный термин будет установлен в качестве значения атрибута title элемента abbr (или acronym).
