Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/ContextMenu/*.locallang.xlf
Languages: it, ru

source: Chec_k Link
it: Controlla Link
ru: Проверить ссы_лку

source: Copy
it: Copia
ru: Копировать

source: Create a link
it: Crea un link
ru: Создать ссылку

source: Current URL is
it: L'URL attuale è
ru: Текущий адрес

source: Cut
it: Taglia
ru: Вырезать

source: Element
it: Elemento
ru: Элемент

source: How did you get here? (Please report!)
it: Come sei giunto fin qui? (Per piacere scrivi un report!)
ru: Как это Вы сюда попали? Пожалуйста, сообщите разработчикам об этом!

source: _Image Properties
it: Proprietà Immagine...
ru: Свойства изображения

source: Insert a paragraph after the current node
it: Inserisci un paragrafo dopo il nodo corrente
ru: Вставить параграф после текущего элемента

source: Insert a paragraph before the current node
it: Inserisci un paragrafo prima del nodo corrente
ru: Вставить параграф перед текущим элементом

source: Insert paragraph after
it: Inserisci paragrafo dopo
ru: Вставить параграф ниже

source: Insert paragraph before
it: Inserisci paragrafo prima
ru: Вставить параграф выше

# JustifyCenter-title
source: Justify Center
it: Giustificato al Centro
ru: Выключка по центру

# JustifyCenter-tooltip
source: Centers the text
it: Centra il testo
ru: Центрировать текст

# JustifyFull-title
source: Justify Full
it: Completamente Giustificato
ru: Выключка по ширине

# JustifyFull-tooltip
source: Aligns text both to the left and the right
it: Allinea testo sia a destra che a sinistra
ru: Выровнять текст по ширине

# JustifyLeft-title
source: Justify Left
it: Giustificato a Sinistra
ru: Выключка влево

# JustifyLeft-tooltip
source: Aligns text to the left
it: Allinea testo a sinistra
ru: Выровнять текст по левому краю

# JustifyRight-title
source: Justify Right
it: Giustificato a Sinistra
ru: Выключка вправо

# JustifyRight-tooltip
source: Aligns text to the right
it: Allinea testo a destra
ru: Выровнять текст по правому краю

source: Link points to:
it: Il link punta a:
ru: Ссылка указывает на:

source: Make lin_k
it: Crea link
ru: Создать ссылку

source: _Modify Link
it: Modifica Link
ru: Изменить ссылку

source: Modify URL
it: Modifica URL
ru: Изменить адрес

source: Opens this link in a new window
it: Apre il link in una nuova finestra
ru: Открывает ссылку в новом окне

source: Paste
it: Incolla
ru: Вставить

# Please confirm remove
source: Please confirm that you want to remove this element:
it: E' necesario confermare di voler rimuovere questo elemento:
ru: Пожалуйста подтвердите, что Вы хотите удалить этот элемент:

# Please confirm unlink
source: Please confirm that you want to unlink this element.
it: E' necessario confermare di voler togliere il link da questo elemento
ru: Пожалуйста подтвердите, что Вы хотите убрать ссылку с этого элемента.

source: _Remove Link
it: Rimuovi Link
ru: Удалить ссыл_ку

source: Remove the
it: Rimuovi
ru: Удалить

# Remove this node from the document
source: Removes this node from the document
it: Rimuovi questo nodo dal documento
ru: Удаление этого элемента с подэлементами из документа

source: Show the image properties dialog
it: Mostra la finestra proprietà immagini
ru: Показать диалог свойств изображения

# TO-cell-delete-title
source: Delete Cell
it: Elimina cella
ru: Удалить ячейку

# TO-cell-delete-tooltip
source: Deletes the current cell
it: Elimina la cella corrente
ru: Удалить текущую ячейку

# TO-cell-insert-after-title
source: Insert cell after
it: Inserisci cella dopo
ru: Вставить ячейку после

# TO-cell-insert-after-tooltip
source: Inserts a new cell after the current one
it: Inserisci una nuova cella DOPO la corrente
ru: Вставить новую ячейку после текущей

# TO-cell-insert-before-title
source: Insert cell before
it: Inserisci cella prima
ru: Вставить ячейку перед

# TO-cell-insert-before-tooltip
source: Inserts a new cell before the current one
it: Inserisci una nuova cella PRIMA della corrente
ru: Вставить новую ячейку перед текущей

# TO-cell-merge-title
source: Merge Cells
it: Unisci celle
ru: Соединить ячейки

# TO-cell-merge-tooltip
source: Merges the selected cells
it: Unisci le celle selezionate
ru: Соединить выбранные ячейки

# TO-cell-prop-title
source: C_ell Properties
it: Proprietà Celle
ru: Свойства ячейки

# TO-cell-prop-tooltip
source: Shows the Table Cell Properties dialogue
it: Mostra la finestra di proprietà della Cella
ru: Показать диалог свойств ячеек таблицы

# TO-cell-split-title
source: Split Cell
it: Dividi cella
ru: Разделить ячейку

# TO-cell-split-tooltip
source: Splits the current cell
it: Dividi la cella corrente
ru: Разделить текущую ячейку

# TO-col-delete-title
source: De_lete Column
it: Cancella Colonna
ru: Удалить колонку

# TO-col-delete-tooltip
source: Deletes the current column
it: Elimina la colonna corrente
ru: Удалить текущую колонку

# TO-col-insert-after-title
source: Insert C_olumn After
it: Inserisci Colonna Dopo
ru: Вставить колонку справа

# TO-col-insert-after-tooltip
source: Inserts a new column after the current one
it: Inserisci una nuova colonna dopo la colonna corrente
ru: Вставить колонку после текущей

# TO-col-insert-before-title
source: Insert _Column Before
it: Inserisci Colonna Prima
ru: Вставить колонку слева

# TO-col-insert-before-tooltip
source: Inserts a new column before the current one
it: Inserisci una nuova colonna prima della colonna corrente
ru: Вставить колонку перед текущей

# TO-col-prop-title
source: Column Cells Properties
ru: Свойства ячеек столбца

# TO-col-prop-tooltip
source: Shows the Column Cells Properties dialogue
ru: Показать диалог свойств ячеек столбца

# TO-col-split-title
source: Split Column
it: Dividi Colonna
ru: Разделить колонку

# TO-col-split-tooltip
source: Splits the current column
it: Dividi la colonna corrente
ru: Разделить текущую колонку

# TO-row-delete-title
source: _Delete Row
it: Elimina Riga
ru: Удалить строку

# TO-row-delete-tooltip
source: Deletes the current row
it: Elimina la riga corrente
ru: Удалить текущую строку

# TO-row-insert-above-title
source: I_nsert Row Before
it: Inserisci Riga Prima
ru: Вставить строку выше

# TO-row-insert-above-tooltip
source: Inserts a new row before the current one
it: Inserisci una nuova riga prima della riga corrente
ru: Вставить новую строку перед текущей

# TO-row-insert-under-title
source: In_sert Row After
it: Inserisci Riga Dopo
ru: Вставить строку ниже

# TO-row-insert-under-tooltip
source: Inserts a new row after the current one
it: Inserisci una nuova riga dopo la riga corrente
ru: Вставить новую строку после текущей

# TO-row-prop-title
source: Ro_w Properties
it: Proprietà Righe
ru: Свойства строки

# TO-row-prop-tooltip
source: Shows the Table Row Properties dialogue
it: Mostra la finestra di proprietà della Riga
ru: Показать диалог свойств строк таблицы

# TO-row-split-title
source: Split Row
it: Dividi Riga
ru: Разделить строку

# TO-row-split-tooltip
source: Splits the current row
it: Dividi la riga corrente
ru: Разделить текущую строку

# TO-table-prop-title
source: _Table Properties
it: Proprietà Tabella
ru: _Свойства таблицы

# TO-table-prop-tooltip
source: Shows the Table Properties dialogue
it: Mostra la finestra di proprietà della Tabella
ru: Показать диалог свойств таблицы

# TO-table-restyle-title
source: Re-apply table styles
ru: Пере-применить стили таблицы

# TO-table-restyle-tooltip
source: Re-applies the odd-even styles on the table
ru: Пере-применить стили "зебры" к таблице

# TO-toggle-borders-title
source: Toggle borders
it: Inverti bordi
ru: Включить границы

# TO-toggle-borders-tooltip
source: Toggle borders
it: Inverti bordi
ru: Включить границы

source: Unlink the current element
it: Togli il link dall'elemento corrente
ru: Убрать ссылку с этого элемента
