Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/tstemplate/ts/*.locallang.xlf
Languages: ru

# areYouSure
source: Are you sure you want to do this?
ru: Вы уверены, что хотите это сделать?

source: Constant Editor
ru: Редактор констант

# createTemplate
source: Create a template record first in order to edit constants!
ru: Перед редактированием констант, сначала нужно создать запись шаблона!

# createTemplateToEditConfiguration
source: You need to create a template record below in order to edit your configuration.
ru: Для редактирования своих настроек, необходимо создать запись шаблона ниже.

# extTemplate
source: Create extension template
ru: Создать шаблон расширение

# extTemplateAction
source: Click here to create an extension template.
ru: Щелкните здесь для создания шаблона расширения.

# extTemplateDescription
source: An extension template allows you to enter TypoScript values that will affect only this page and subpages.
ru: Шаблон расширение позволяет ввести значения TypoScript, которые затронут только текущую страницу с подстраницами.

# goToClosest
source: Go to closest page with template
ru: Перейти к ближайшей странице с шаблоном

# goToClosestAction
source: Click here to go.
ru: Щелкните здесь для перехода

# goToClosestDescription
source: Closest template is on page '%s' (uid %s).
ru: Ближайший шаблон имеется на странице '%s' (uid %s).

source: Info/Modify
ru: Информация/изменение

source: Is Ext?
ru: Расширение

source: Is Root?
ru: Корень

# moduleTitle
source: Template tools
ru: Инструменты шаблонирования

# newWebsite
source: Create new website
ru: Создать новый сайт

# newWebsiteAction
source: Create template for a new site
ru: Создать шаблон для нового сайта

# newWebsiteDescription
source: If you want this page to be the root of a new website, optionally based on one of the standard templates, then press the button below:
ru: Если нужно, чтобы эта страница стала корнем нового сайта, созданного на основе одного из стандартных шаблонов, нажмите кнопку ниже:

source: No template
ru: Нет шаблона

# noTemplateDescription
source: There was no template on this page!
ru: На этой странице нет шаблона!

# objectBrowser
source: TypoScript Object Browser
ru: Проводник по объектам TypoScript

# overview
source: This is an overview of the pages in the database containing one or more template records. Click a page title to go to the page.
ru: Это - краткий обзор страниц в базе данных, содержащих одну или несколько записей шаблонов. Щелкните по заголовку страницы для перехода к ней.

source: Page name
ru: Название страницы

source: Template Analyzer
ru: Анализ шаблона

source: Templates
ru: # Шаблонов

# titleNewSite
source: NEW SITE
ru: НОВЫЙ САЙТ

# titleNewSiteStandard
source: NEW SITE, based on standard
ru: НОВЫЙ САЙТ, на стандартной основе

# viewTemplates
source: Viewing templates of
ru: Просмотр шаблонов
