Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/info_pagetsconfig/*.locallang.xlf
Languages: ru

# editThisColumn
source: Edit the field '%s' for all listed pages
ru: Редактировать поле '%s' для всех указанных страниц

# editTSconfig
source: Edit TSconfig for this page
ru: Редактировать TSconfig для текущей страницы

# editTSconfig_all
source: Edit TSconfig for all shown pages
ru: Редактировать TSconfig для всех показанных страниц

# editTSconfig_default
source: Default Configuration from TYPO3_CONF_VARS
ru: Конфигурация по умолчанию из TYPO3_CONF_VARS

# mod_pagetsconfig
source: Page TSconfig
ru: TSconfig страницы

# tsconf_configFields
source: View TSconfig fields content
ru: Просмотреть значения полей TSconfig

# tsconf_parts_0
source: All
ru: Всё

# tsconf_parts_1
source: Module key ('mod') with overruling user settings
ru: Ключ модуля ('mod') с переназначением настроек пользователя

# tsconf_parts_1a
source: Module: Web>Page
ru: Модуль: Веб>Страница

# tsconf_parts_1b
source: Module: Web>View
ru: Модуль: Веб>Просмотр

# tsconf_parts_1c
source: Module: Web>Modules
ru: Модуль: Веб>Модули

# tsconf_parts_1d
source: Module: Web>List
ru: Модуль: Веб>Список

# tsconf_parts_1e
source: Module: Web>Info
ru: Модуль: Веб>Инфо

# tsconf_parts_1f
source: Module: Web>Func
ru: Модуль: Веб>Функции

# tsconf_parts_1g
source: Module: Web>Template
ru: Модуль: Веб>Шаблон

# tsconf_title
source: Page TSconfig
ru: TSconfig страницы
