Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_ttc.xlf
Languages: fr, it

# palette.mailform
source: Target and Recipient
fr: Cible et destinataire
it: Target e Destinatario

# palette.menu
source: Menu and Sitemap
fr: Menu et plan du site
it: Menu e mappe del sito

# palette.menu_accessibility
source: Accessibility
fr: Accessibilité
it: Testo per l'accessibilità

# palette.multimediafiles
source: Media Files and Parameters
fr: Fichiers média et paramètres
it: Files multimediali e parametri

# palette.searchform
source: Search Results
fr: Résultats de recherche
it: Risultati della Ricerca

# palette.table_layout
source: Table Layout
fr: Mise en page du tableau
it: Layout Tabella

# palette.textbox
source: Render Text into Images
fr: Rendre le texte en images
it: Testo da inserire nelle immagini

# palette.textlayout
source: Text Layout
fr: Mise en page du texte
it: Layout testo

# palette.uploads_layout
source: Filelinks Layout
fr: Mise en page des liens vers des fichiers
it: Layout Filelinks

# palette.visibility
source: Visibility
fr: Visibilité
it: Visibilità

# pi_flexform
source: Plugin Options
fr: Options du plugin
it: Opzioni plugin:

# records
source: Items:
fr: Eléments:

# records_formlabel
source: Records
fr: Enregistrements

# recursive.I.0
source: 0 levels (only selected page)
fr: 0 niveau (page courante uniquement)
it: 0 livelli (solo pagina selezionata)

# recursive.I.1
source: 1 level
fr: 1 niveau
it: 1 livello

# recursive.I.2
source: 2 levels
fr: 2 niveaux
it: 2 livelli

# recursive.I.3
source: 3 levels
fr: 3 niveaux
it: 3 livelli

# recursive.I.4
source: 4 levels
fr: 4 niveaux
it: 4 livelli

# recursive.I.5
source: Infinite
fr: Illimité
it: Infiniti

# rte_enabled
source: Disable Rich Text Editor:
fr: Désactiver l'éditeur de texte avec mise en forme:
it: Disabilita Rich Text Editor:

# rte_enabled_formlabel
source: Rich Text Editor
fr: Editeur de texte avec mise en forme
it: Rich Text Editor per questo testo

# rte_enabled.I.0
source: Disable
fr: Désactiver
it: Disabilita

# section_frame
source: Frame:
fr: Cadre:

# section_frame_formlabel
source: Indentation and Frames
fr: Indentation et cadres
it: Indentazioni e Frames

# section_frame.I.2
source: Ruler Before
fr: Règle avant
it: Separatore prima

# section_frame.I.3
source: Ruler After
fr: Règle après
it: Separatore dopo

# section_frame.I.4
source: Indent
fr: Indenter
it: Indenta

# section_frame.I.5
source: Indent, 33/66%
fr: Indenter, 33/66%
it: Indenta, 33/66%

# section_frame.I.6
source: Indent, 66/33%
fr: Indenter, 66/33%
it: Indenta, 66/33%

# section_frame.I.7
source: Frame 1
fr: Cadre 1

# section_frame.I.8
source: Frame 2
fr: Cadre 2

# sectionIndex_formlabel
source: Show in Section Menus
fr: Afficher dans les menus de section.
it: Nei menù di sezione

source: Selected categories
fr: Catégories sélectionnées
it: Categorie selezionate

# select_key.ALT.script_formlabel
source: PHP Code
fr: Code PHP
it: Codice PHP

# select_key.ALT.uploads
source: Read from Path:
fr: Lire depuis le chemin:
it: Leggi dal Path:

# select_key.ALT.uploads_formlabel
source: Path
fr: Chemin
it: Leggi da questo percorso (path)

# select_key_formlabel
source: Plugin Mode
fr: Mode du plugin
it: Codice per questo plugin

# spaceAfter
source: After:
fr: Après:
it: Dopo:

# spaceAfter_formlabel
source: Bottom Margin
fr: Marge inférieure
it: Margine Bottom

# spaceBefore
source: Before:
fr: Avant:
it: Prima:

# spaceBefore_formlabel
source: Top Margin
fr: Marge supérieure
it: Margine Top

# splash_layout
source: Textbox Type:
fr: Type de Textbox:
it: Tipo Textbox:

# splash_layout.I.1
source: Image Shadow
fr: Image ombrée
it: Immagine con ombreggiatura

# splash_layout.I.2
source: Image Frame 1
fr: Image Cadre 1
it: Immagine frame 1

# splash_layout.I.3
source: Image Frame 2
fr: Image Cadre 2
it: Immagine frame 2

# splash_layout.I.4
source: __Graphical:__
fr: ___Graphique:___
it: __Grafica:__

# starttime_formlabel
source: Publish Date
fr: Date de début de publication
it: Data di pubblicazione

# subheader.ALT.mailform
source: Recipient Email:
fr: E-mail du destinataire:
it: E-mail destinatario:

# subheader.ALT.mailform_formlabel
source: Recipient Email
fr: E-mail du destinataire
it: E-mail destinatario

# subheader_formlabel
source: Subheader
fr: Sous-titre
it: Titolo secondario

# sys_language_uid_formlabel
source: Language
fr: Langue
it: Lingua

# table_bgColor
source: Backgr. Color:
fr: Couleur de fond:
it: Colore di sfondo:

# table_bgColor_formlabel
source: Background color
fr: Couleur de fond
it: Colore di sfondo

# table_bgColor.I.1
source: Color 1
fr: Couleur 1
it: Colore 1

# table_bgColor.I.2
source: Color 2
fr: Couleur 2
it: Colore 2

# table_bgColor.I.3
source: None
fr: Aucune
it: Nessuno

# table_bgColor.I.5
source: Black
fr: Noir
it: Nero

# table_bgColor.I.6
source: White
fr: Blanc
it: Bianco

# table_bgColor.I.7
source: Dark Gray
fr: Gris foncé
it: Grigio scuro

# table_bgColor.I.8
source: Gray
fr: Gris clair
it: Grigio

# table_bgColor.I.9
source: Silver
fr: Argent
it: Argento

# table_border
source: Border:
fr: Bordure:
it: Bordo:

# table_border_formlabel
source: Border Size (px)
fr: Taille de la bordure (px)
it: Dimensioni Bordo (px)

# table_cellpadding
source: Cellpadding:
fr: Espacement inter cellules:
it: Spazio fra bordo delle celle e contenuto:

# table_cellpadding_formlabel
source: Cellpadding (px)
fr: Espacement à l'intérieur des cellules (px)
it: Padding tra celle (px)

# table_cellspacing
source: Cellspacing:
fr: Espacement entre cellules:
it: Spazio fra celle:

# table_cellspacing_formlabel
source: Cellspacing (px)
fr: Espacement entre les cellules (px)
it: Spazio tra celle (px)

# tabs.access
source: Access
fr: Accès
it: Accesso

# tabs.appearance
source: Appearance
fr: Apparence
it: Aspetto

# tabs.behaviour
source: Behaviour
fr: Comportement
it: Comportamento

# tabs.extended
source: Extended
fr: Etendu
it: Esteso

# tabs.media
source: Media
fr: Média

# tabs.text
source: Text
fr: Texte
it: Testo

source: Target:
fr: Cible:
it: Destinazione:

# target.I.1
source: New window
fr: Nouvelle fenêtre
it: Nuova finestra

# titleText_formlabel
source: Titles (one per line)
fr: Titres au survol (un par ligne)
it: Titoli (uno per linea)

# bodytext.ALT.mailform
source: Configuration:
it: Configurazione:

# colPos.I.1
source: Normal
it: Normale

# CType_formlabel
source: Type
it: Tipo

# CType.I.11
source: Textbox
it: Box di testo

# CType.I.3
source: Images
it: Immagini

source: Date
it: Data

# date_formlabel
source: Date
it: Data

# header_layout_formlabel
source: Type
it: Tipo

# imagecaption.ALT.uploads
source: Descriptions:
it: Descrizione:

# image_formlabel
source: Images
it: File immagine

# imageorient
source: Position:
it: Posizione:

# media.params.option
source: Option
it: Opzione

# section_frame.I.1
source: Invisible
it: Invisibile

# sectionIndex
source: Index:
it: Indice:

# splash_layout_formlabel
source: Type
it: Tipo

# tabs.images
source: Images
it: Immagini
