Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_csh_webinfo.xlf
Languages: fr, ru

# stat.details
source: <b>Notice:</b> This function requires the extension "Simple hit statistics" (sys_stat) to be installed. Also you must configure TypoScript to register page hits in the statistics database table.
fr: <b>Note :</b> Cette fonction requiert l'installation de l'extension "Simple hit statistics" (sys_stat). Vous devez également configurer en TypoScript l'enregistrement des hits dans la table des statistiques de la base de données.
ru: <b>Примечание:</b> Для работы этой функции требуется установить расширение "Simple hit statistics" (sys_stat) . Также необходимо сконфигурировать TypoScript для записи посещений в таблицу БД.
