Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_ttc.xlf
Languages: fr, it

# accessibility_bypass
source: Add link to bypass block
fr: Ajouter un lien afin de contourner le bloc
it: Aggiungi link per bypassare il blocco

# accessibility_bypass_text
source: Link text to bypass block
fr: Lien texte pour contourner le bloc
it: Testo del link per bypassare il blocco

# accessibility_title
source: Block title
fr: Titre du bloc
it: Titolo del blocco

# ALT.imgDimensions
source: Image Dimensions
fr: Dimensions de l'image
it: Dimensioni immagine

# ALT.imgLinks
source: Image Links
fr: Liens d'image
it: Link immagine

# ALT.imgOptions
source: Image Options
fr: Options d'image
it: Opzioni immagine

# altText_formlabel
source: Alternative Labels (one per line)
fr: Textes alternatifs (un par ligne)
it: Testo alternativo (uno per linea)

# bodytext.ALT.bulletlist_formlabel
source: Bullet List
fr: Liste à puce
it: Elenco Puntato

# bodytext.ALT.html_formlabel
source: HTML Code
fr: Code HTML
it: Codice HTML

# bodytext.ALT.mailform_formlabel
source: Form Structure
fr: Structure du formulaire
it: Struttura form

# bodytext.ALT.media_formlabel
source: Alternative Content
fr: Contenu alternatif
it: Contenuto alternativo

# bodytext.ALT.multimedia_formlabel
source: Parameters
fr: Paramètres
it: Parametri

# bodytext.ALT.script_formlabel
source: Parameters to pass to the script
fr: Paramètres à passer au script
it: Parametri da passare allo script

# bodytext.ALT.table_formlabel
source: Table Structure
fr: Structure du tableau
it: Tabella

# bodytext.ALT.textbox_formlabel
source: Text
fr: Texte
it: Testo

# bodytext_formlabel
source: Text
fr: Texte
it: Testo

# bodytext.W.forms
source: Forms wizard
fr: Assistant de formulaire
it: Wizard per i moduli (forms)

# bodytext.W.RTE
source: Fullscreen Rich Text Editing
fr: Edition texte riche plein écran
it: Rich Text Editor a pieno schermo

# bodytext.W.table
source: Table Wizard
fr: Assistant de tableau
it: Wizard per la tabella

source: Category field
fr: Champ catégorie
it: Categoria

# colPos
source: Columns:
fr: Colonnes:
it: Colonne:

# colPos_formlabel
source: Column
fr: Colonne
it: Colonna

# colPos.I.0
source: Left
fr: Gauche
it: Sinistra

# colPos.I.2
source: Right
fr: Droite
it: Destra

# colPos.I.3
source: Border
fr: Bordure
it: Bordo

# cols
source: Columns
fr: Colonnes
it: Colonne Tabella:

# CType.div.forms
source: Forms
fr: Formulaire

# CType.div.lists
source: Lists
fr: Listes
it: Liste

# CType.div.special
source: Special
fr: Spécial
it: Speciale

# CType.I.0
source: Header
fr: Titre
it: Intestazione

# CType.I.1
source: Text
fr: Texte
it: Testo

# CType.I.10
source: Login
fr: Identifiant

# CType.I.12
source: Special Menus
fr: Menu / Plan du site
it: Menù / mappa sito

# CType.I.13
source: Insert Records
fr: Insérer des enregistrements
it: Inserisci Record

# CType.I.14
source: Insert Plugin
fr: Insérer un plugin
it: Inserisci Plugin

# CType.I.16
source: Divider
fr: Séparation
it: Separatore

# CType.I.18
source: Media
fr: Média

# CType.I.2
source: Text & Images
fr: Texte & images
it: Testo & Immagini

# CType.I.4
source: Bullet List
fr: Liste à puces
it: Elenco puntato

# CType.I.5
source: Table
fr: Tableau
it: Tabella

# CType.I.6
source: File Links
fr: Liens vers des fichiers

# CType.I.7
source: Multimedia
fr: Multimédia

# CType.I.8
source: Form
fr: Formulaire

# CType.I.9
source: Search
fr: Recherche
it: Ricerca

# endtime_formlabel
source: Expiration Date
fr: Date de fin de publication
it: Data di depubblicazione

# fe_group_formlabel
source: Usergroup Access Rights
fr: Droits d'accès par groupe d'utilisateurs
it: Gruppi utente e reazione al login

source: File collections
fr: Collections de fichiers
it: Collezioni file

# file_collections.ALT.uploads_formlabel
source: Select file collections
fr: Sélectionner les collections de fichiers
it: Seleziona collezioni di file

# filelink_size
source: Show File Size:
fr: Afficher la taille du fichier:
it: Mostra dimensione files:

# filelink_size_formlabel
source: Display File Size Information
fr: Afficher la taille du fichier
it: Mostra dimensioni del file

# filelink_sorting
source: Sort Filelist:
fr: Tri pour la liste de fichiers:
it: Ordinamento dell'elenco file:

# filelink_sorting.extension
source: by Fileextension
fr: selon l'extension de fichier
it: per estensione di file

# filelink_sorting.name
source: by Filename
fr: selon le nom de fichier
it: per nome del file

# filelink_sorting.none
source: none
fr: aucun
it: nessuno

# filelink_sorting.size
source: by Filesize
fr: selon la taille de fichier
it: per dimensione di file

# filelink_sorting.type
source: by Filetype
fr: Selon le type de fichier
it: per tipo di file

source: Header:
fr: Titre:
it: Intestazione

# header.ALT.div_formlabel
source: Name (not visible in frontend)
fr: Nom (non visible sur le site)
it: Nome (invisibile nel frontend)

# header.ALT.html_formlabel
source: Name (not visible in frontend)
fr: Nom (non visible sur le site)
it: Nome (invisibile nel frontend)

# header.ALT.script_formlabel
source: Name (not visible in frontend)
fr: Nom (non visible sur le site)
it: Nome (invisibile nel frontend)

# header.ALT.shortcut_formlabel
source: Name (not visible in frontend)
fr: Nom (non visible sur le site)
it: Nome (invisibile nel frontend)

# header_formlabel
source: Header
fr: Titre
it: Titolo principale

# header_layout.I.1
source: Layout 1
fr: Disposition 1

# header_layout.I.2
source: Layout 2
fr: Disposition 2

# header_layout.I.3
source: Layout 3
fr: Disposition 3

# header_layout.I.4
source: Layout 4
fr: Disposition 4

# header_layout.I.5
source: Layout 5
fr: Disposition 5

# header_layout.I.6
source: Hidden
fr: Caché
it: Nascosto

# header_link
source: Link:
fr: Lien:

# header_link_formlabel
source: Link
fr: Lien

# header_position
source: Align:
fr: Alignement:
it: Allineamento:

# header_position_formlabel
source: Alignment
fr: Alignement
it: Allineamento

# header_position.I.1
source: Center
fr: Centré
it: Centrato

# header_position.I.2
source: Right
fr: Aligné à droite
it: Destra

# header_position.I.3
source: Left
fr: Aligné à gauche
it: Sinistra

# hidden_formlabel
source: Content Element
fr: Elément de contenu
it: Elementi di contenuto

# hidden.I.0
source: Disable
fr: Désactiver
it: Disabilita

# image_altText
source: Alternative Text:
fr: Texte alternatif:
it: Testo alternativo

# image.ALT.textbox_formlabel
source: Image Files
fr: Fichiers d'images
it: File immagine

# imageborder
source: Border:
fr: Bordure:
it: Bordo:

# imageborder_formlabel
source: Border
fr: Bordure
it: Bordo

# imagecaption.ALT.script
source: Comments:
fr: Commentaires:
it: Commenti:

# imagecaption.ALT.script_formlabel
source: Comments
fr: Commentaires
it: Commenti

# imagecaption.ALT.uploads_formlabel
source: File Descriptions (one per line)
fr: Descriptions des fichiers (une par ligne)
it: Descrizioni dei files (uno per riga)

# imagecaption_formlabel
source: Captions (one per line)
fr: Légendes (une par ligne)
it: Didascalie (una per riga)

# imagecaption_position
source: Align:
fr: Alignement:
it: Allineamento

# imagecaption_position_formlabel
source: Caption Alignment
fr: Alignement de la légende
it: Allineamento della didascalia

# imagecaption_position.I.1
source: Center
fr: Centré
it: Centrato

# imagecaption_position.I.2
source: Right
fr: Droite
it: Destra

# imagecaption_position.I.3
source: Left
fr: Gauche
it: Sinistra

# imagecols
source: Columns:
fr: Colonnes:
it: Colonne:

# imagecols_formlabel
source: Number of Columns
fr: Nombre de colonnes
it: Numero di colonne

# image_compression
source: Image Quality/Processing:
fr: Qualité d'image:
it: Qualità/elaborazione immagine

# image_compression_formlabel
source: Quality and Type
fr: Qualité et type
it: Qualità e Tipo

# image_compression.I.1
source: None (ignores all other options)
fr: Aucune (ignore toutes les autres options)
it: Nessuna (ignora tutte le altre opzioni)

# image_compression.I.15
source: JPG/Very High
fr: JPG/Très haut
it: JPG/Altissima risoluzione

# image_compression.I.16
source: JPG/High
fr: JPG/Haut
it: JPG/Alta risoluzione

# image_compression.I.17
source: JPG/Medium
fr: JPG/Moyen
it: JPG/Media risoluzione

# image_compression.I.18
source: JPG/Low
fr: JPG/Bas
it: JPG/Bassa risoluzione

# image_compression.I.19
source: JPG/Very Low
fr: JPG/Très bas
it: JPG/Bassissima risoluzione

# image_effects
source: Effects:
fr: Effets:
it: Effetti:

# image_effects_formlabel
source: Effect
fr: Effet
it: Effetto

# image_effects.I.0
source: None
fr: (Aucun)
it: Nessuno

# image_effects.I.1
source: Rotate 90 CW
fr: Rotation 90°
it: Rotazione 90 gr. (senso orario)

# image_effects.I.2
source: Rotate -90 CCW
fr: Rotation -90°
it: Rotazione -90 gr. (senso antiorario)

# image_effects.I.3
source: Rotate 180
fr: Rotation 180°
it: Rotazione 180 gr.

# image_effects.I.4
source: Grayscale
fr: Nuances de gris
it: Scala di grigi

# image_effects.I.5
source: Sharpen
fr: Aiguiser
it: Evidenzia contorni

# image_effects.I.6
source: Normalize
fr: Normaliser
it: Diminuisci contrasto

# image_effects.I.7
source: Contrast
fr: Contraster
it: Aumenta contrasto

# image_effects.I.8
source: Brighter
fr: Eclaircir
it: Aumenta luminosità

# image_effects.I.9
source: Darker
fr: Obscurcir
it: Diminuisci luminosità

# image_frames
source: Frames:
fr: Cadres:

# image_frames_formlabel
source: Graphical Frames
fr: Cadres visuels
it: Frame grafici

# image_frames.I.0
source: (None)
fr: (Aucun)
it: (Nessuno)

# image_frames.I.1
source: Frame 1
fr: Cadre 1

# image_frames.I.2
source: Frame 2
fr: Cadre 2

# image_frames.I.3
source: Frame 3
fr: Cadre 3

# image_frames.I.4
source: Frame 4
fr: Cadre 4

# image_frames.I.5
source: Frame 5
fr: Cadre 5

# image_frames.I.6
source: Frame 6
fr: Cadre 6

# image_frames.I.7
source: Frame 7
fr: Cadre 7

# image_frames.I.8
source: Frame 8
fr: Cadre 8

# imageheight
source: Height (pixels):
fr: Hauteur (pixels):
it: Altezza(pixel):

# imageheight_formlabel
source: Height (px)
fr: Hauteur (px)
it: Altezza (px)

# image_link
source: Link:
fr: Lien:

# image_link_formlabel
source: Links (one per line, one link per image)
fr: Liens (un par ligne, un lien par image)
it: Links (uno per riga, un link per immagine)

# image_longdescURL
source: Long Description URL:
fr: URL de la description longue :
it: URL descrizione estesa:

# image_noRows
source: No Rows:
fr: Pas de ligne:
it: Usa tabella senza righe:

# image_noRows_formlabel
source: Display as Rows
fr: Lignes horizontales
it: Mostra come righe

# image_noRows.I.0
source: Deactivate
fr: Désactiver
it: Disattiva

# imageorient_formlabel
source: Position and Alignment
fr: Position et alignement
it: Posizione e Allineamento

# imageorient.I.0
source: Above, center
fr: Dessus, centre
it: Sopra, centrato

# imageorient.I.1
source: Above, right
fr: Dessus, droite
it: Sopra, a destra

# imageorient.I.10
source: Beside Text, Left
fr: A côté du texte, gauche
it: A lato del testo, a sinistra

# imageorient.I.2
source: Above, left
fr: Dessus, gauche
it: Sopra, a sinistra

# imageorient.I.3
source: Below, center
fr: Dessous, centre
it: Sotto, centrato

# imageorient.I.4
source: Below, right
fr: Dessous, droite
it: Sotto, a destra

# imageorient.I.5
source: Below, left
fr: Dessous, gauche
it: Sotto, a sinistra

# imageorient.I.6
source: In text, right
fr: Habillé, droite
it: Nel testo, a destra

# imageorient.I.7
source: In text, left
fr: Habillé, gauche
it: Nel testo, a sinistra

# imageorient.I.8
source: __No wrap:__
fr: __Pas de retour à la ligne:__
it: __Senza cornice:__

# imageorient.I.9
source: Beside Text, Right
fr: A côté du texte, droite
it: A lato del testo, a destra

# images.addFileReference
source: Add image
fr: Ajouter une image
it: Aggiungi immagine

# image_titleText
source: Title Text:
fr: Titre (survol):

# imagewidth
source: Width (pixels):
fr: Largeur (pixels):
it: Larghezza (pixel):

# imagewidth_formlabel
source: Width (px)
fr: Largeur (px)
it: Larghezza (px)

# image_zoom
source: Click-enlarge:
fr: Cliquer pour agrandir:
it: Clicca per allargare:

# image_zoom_formlabel
source: Enlarge on Click
fr: Agrandissement lors du clic
it: Ingrandisci al click

# layout_formlabel
source: Layout
fr: Mise en page

# layout.I.1
source: Layout 1
fr: Disposition 1

# layout.I.2
source: Layout 2
fr: Disposition 2

# layout.I.3
source: Layout 3
fr: Disposition 3

# linkToTop
source: To top:
fr: Lien vers le haut:
it: Vai su:

# linkToTop_formlabel
source: Append with Link to Top of Page
fr: Ajouter un lien vers le haut de la page
it: Link a inizio pagina

# list_type_formlabel
source: Selected Plugin
fr: Plugin sélectionné
it: Plugin selezionato

# longdescURL_formlabel
source: Long Description URLs (one per line)
fr: URLs des descriptions longues (une par ligne)
it: URLs per una descrizione estesa (uno per linea)

# media
source: Files
fr: Fichiers

# media.addFileReference
source: Add file
fr: Ajouter un fichier
it: Aggiungi file

# media.additionalOptions
source: Additional Parameters
fr: Options complémentaires
it: Parametri addizionali

# media.alternativeContent
source: Alternative Content
fr: Contenu alternatif
it: Contenuto alternativo

# media.ALT.uploads_formlabel
source: Select single files
fr: Sélectionnez les fichiers
it: Files selezionati

# media.audioDescription
source: audio description for videos
fr: description audio pour les vidéos
it: descrizione audio per i video

# media.audioFallbackUrl
source: Path or URL to fallback audio source (Flash or QuickTime)
fr: Chemin ou URL vers le fichier source de l'audio (Flash ou QuickTime)
it: Path o URL per la sorgente audio di fallback (Flash or QuickTime)

# media.audioSources
source: Audio sources for HTML5 <audio> element
fr: Sources audio pour l'élément HTML5 <audio>
it: Sorgenti audio per l'elemento HTML5 <audio>

# media.browseUrlTitle
source: Select File or URL
fr: Sélectionnez un fichier ou une URL
it: Seleziona File o URL

# media.captionUrl
source: Path or URL to captions file
fr: Chemin ou URL du fichier de légendes
it: Path o URL per il file di didascalia

# media.dataAttributes
source: Additional data-* Attributes for HTML5 video tag
fr: Attributs data-* supplémentaires pour la balise HTML5 video
it: Dati addizionali-* attributi per i tag video HTML5

# media.dataAttributes.attributeName
source: Name of attribute (without data-)
fr: Nom de l'attribut (sans data-)
it: Nome dell'attributo (escluso data-)

# media.dataAttributes.content
source: Content
fr: Contenu
it: Contenuto

# media.downloadFlash
source: Click here to download the latest version.
fr: Cliquez ici pour télécharger la dernière version.
it: Clicca qui per scaricare l'ultima versione.

# media.fallbackUrl
source: Path or URL to fallback video source (Flash or QuickTime)
fr: Chemin ou URL vers le fichier source de la vidéo (Flash ou QuickTime)
it: Path o URL di fallback per la sorgente video (Flash o QuickTime)

# media.forcePlayer
source: Use Player (Flash only)
fr: Utiliser un lecteur (Flash uniquement)
it: Usa Player (solo per Flash)

source: Media Height
fr: Hauteur du média
it: Altezza Media

# media.needFlashPlugin
source: You need a Flash plugin to view this content.
fr: Vous avez besoin d'un module complémentaire Flash pour voir ce contenu.
it: Un Plugin di Flash è necessario per visualizzare questo contenuto.

# media.noFile
source: ERROR: Missing URL or File!
fr: ERREUR : URL manquante ou fichier manquant
it: ERRORE: manca URL o File!

source: Media Options
fr: Options du média
it: Opzioni Media

# media.params
source: Media Parameter
fr: Paramètres du média
it: Parametri Media

# media.params.allowFullScreen
source: Allow Fullscreen
fr: Autoriser le plein écran
it: Permetti tutto schermo

# media.params.allowScriptAccess
source: Allow ScriptAccess
fr: Autoriser l'accès aux scripts
it: Permetti ScriptAccess

# media.params.autoPlay
source: AutoPlay
fr: Démarrage automatique

# media.params.bgColor
source: Background Color
fr: Couleur de fond
it: Colore Background

# media.params.controlsAtStart
source: Make controls visible when page loads
fr: Rendre les commandes visibles au chargement de la page
it: Rendi controlli visibili al caricamento della pagina

# media.params.controlsBelow
source: Display controls below video
fr: Afficher les commandes sous la vidéo
it: Mostra controlli sotto il video

# media.params.controlsHiding
source: Hide controls when not over the video
fr: Masquer la barre de contrôle lorsqu'ils ne sont pas sur la vidéo
it: Nascondi controlli se non il puntatore non è posizionato sul video

# media.params.customEntry
source: Custom Parameters
fr: Paramètres personalisés
it: Parametri custom

# media.params.customEntryLabel
source: Enter flashvars, params or attributes
fr: Libellés des paramètres personalisés (attributs, paramètres, variables...)
it: Inserisci flashvars, params o attributes

# media.params.defaultVolume
source: Default volume
fr: Volume par défaut
it: Volume di default

# media.params.loop
source: Loop
fr: Boucle

# media.params.preload
source: Preload media
fr: Pré-charger le média
it: Precaricamento media

# media.params.preview
source: Preview Video
fr: Prévisualisation de la vidéo

# media.params.quality
source: Quality
fr: Qualité
it: Qualità

# media.params.setTo
source: Set to
fr: Paramétré à
it: Setta a

# media.params.value
source: Value
fr: Valeur
it: Valore

# media.params.valueEntry
source: Value Entry
fr: Valeur de l'entrée
it: Valore

# media.previewImage
source: Preview-Image for the Video (HTML5 only)
fr: Image de prévisualisation pour la vidéo (HTML5 uniquement)
it: Immagine di anteprima per il video (solo HTML5)

# media.renderType
source: Render Type
fr: Type de rendu
it: Tipo di render

# media.renderType.auto
source: Auto
fr: Automatique

# media.renderType.embed
source: Native HTML Embed Element
fr: Elément HTML
it: Embed HTML

# media.renderType.preferFlashOverHtml5
source: Flash with fallback to HTML5 video/audio tag
fr: Flash avec repli aux balises video/audio HTML5
it: Flash con fallback in HTML5 video/audio tag

# media.renderType.preferHtml5OverFlash
source: HTML5 video/audio tag with fallback to Flash
fr: Balise HTML5 video / audio de repli à Flash
it: HTML5 video/audio tag con fallback a Flash

# media.renderType.qt
source: QuickTime Browser Plugin
fr: Plugin QuickTime
it: Plugin QuickTime

# media.renderType.swf
source: Flash Browser Plugin
fr: Plugin Flash
it: Plugin Flash

# media.sources
source: Video sources for HTML5 <video> element
fr: Sources vidéo pour l'élément HTML5 <video>
it: Sorgenti video per l'elemento HTML5 <video>

# media.tabAudio
source: Audio Element
fr: Élément sonore
it: Elemento Audio

# media.tabVideo
source: Video Element
fr: Élément vidéo
it: Elemento Video

# media.tabVideoAccessible
source: HTML5 Additions
fr: Ajouts en HTML5
it: Aggiunte per HTML5

source: Media Type
fr: Type du média
it: Tipo Media

# media.type.video
source: Video
fr: Vidéo

# media.url
source: Path or URL
fr: Chemin relatif ou URL
it: path relativo del file Media o URL

# media.useHTML5
source: HTML5 / accessible rendering
fr: rendu HTML5 / accessible
it: HTML5 / rendering accessibile

source: Media Width
fr: Largeur du média
it: Larghezza Media

# menu.ALT.accessibility_bypass_formlabel
source: Add link to bypass navigation block
fr: Ajouter un lien pour contourner le bloc de navigation
it: Aggiungi link per bypassare il blocco di navigazione

# menu.ALT.accessibility_bypass_text_formlabel
source: Link text to bypass navigation block
fr: Texte du lien pour contourner le bloc de navigation
it: Testo del link per bypassare il blocco di navigazione

# menu.ALT.accessibility_title_formlabel
source: Menu block title
fr: Titre du bloc du menu
it: Titolo del blocco Menù

source: Menu Type
fr: Type de menu
it: Tipo di Menu

# menu_type_formlabel
source: Menu Type
fr: Type de menu
it: Tipo di Menu

# menu_type.I.0
source: Menu of selected pages
fr: Menu des pages sélectionnées
it: Menu delle pagine selezionate

# menu_type.I.1
source: Menu of subpages of selected pages
fr: Menu des sous-pages des pages sélectionnées
it: Menu delle sottopagine delle pagine selezionate

# menu_type.I.2
source: Menu of subpages of selected pages including abstracts
fr: Menu des sous-pages des pages sélectionnées, avec les résumés
it: Menu delle sottopagine delle pagine selezionate (con abstract)

# menu_type.I.3
source: Menu of subpages of selected pages including sections
fr: Menu des sous-pages des pages sélectionnées, avec les sections
it: Menu delle sottopagine delle pagine selezionate + sezioni

# menu_type.I.4
source: Sitemap
fr: Plan du site
it: Mappa del sito

# menu_type.I.5
source: Section index (page content marked for section menus)
fr: Menu de section (Contenu de page marqué pour être inclus dans les menus de sections)
it: Indice sezione (per i contenuti con "Indice" selezionato)

# menu_type.I.6
source: Recently updated pages
fr: Pages récemment mises à jour
it: Pagine aggiornate di recente

# menu_type.I.7
source: Related pages (based on keywords)
fr: Pages en relation (basé sur les mots-clés)
it: Pagine correlate (in base alle keywords)

# menu_type.I.8
source: Sitemaps of selected pages
fr: Plan du site des pages sélectionnées
it: Sitemap delle pagine selezionate

# menu_type.I.categorized_content
source: Content elements for selected categories
fr: Éléments de contenu des catégories sélectionnées
it: Elementi di contenuto per le categorie selezionate

# menu_type.I.categorized_pages
source: Pages for selected categories
fr: Pages des catégories sélectionnées
it: Pagine per le categorie selezionate

# multimedia
source: File:
fr: Fichier:

# multimedia_formlabel
source: Selected Media File
fr: Fichier média sélectionné
it: File multimediale selezionato

# pages.ALT.list_formlabel
source: Record Storage Page
fr: Page de stockage des enregistrements
it: Punto di partenza per questo plugin

# pages.ALT.login
source: Send to Page:
fr: Envoyer à la page:
it: Reindirizza alla Pagina:

# pages.ALT.loginform
source: Selected pages: Target (1st), Frontend user container (2nd)
fr: Pages sélectionnées : Page de destination (1ère), Page contenant les utilisateurs frontend (2e)
it: Pagine selezionate: destinazione (prima), contenitore per utente FE (seconda)

# pages.ALT.mailform
source: Target Page
fr: Page de destination
it: Salta alla pagina:

# pages.ALT.menu_formlabel
source: Selected Pages
fr: Pages sélectionnées
it: Pagine selezionate

# pages.ALT.script_formlabel
source: Starting Point for This Script
fr: Point de départ du script
it: Punto di partenza per questo script

# pages.ALT.search
source: Send to Page:
fr: Envoyer à la page:
it: Reindirizza alla Pagina:

# pages.ALT.searchform
source: Target page
fr: Page de destination
it: Pagina di destinazione

# palette.access
source: Publish Dates and Access Rights
fr: Dates de publication et droits d'accès
it: Accesso temporale e permessi

# palette.frames
source: Content Element Layout
fr: Mise en page du contenu
it: Layout generale

# palette.general
source: Content Element
fr: Element de contenu
it: Elemento di Contenuto

# palette.header
source: Header
fr: Titre
it: Titolo

# palette.headers
source: Headlines
fr: Titres
it: Titoli

# palette.image_accessibility
source: Accessibility
fr: Accessibilité
it: Testo per l'accessibilità

# palette.imageblock
source: Image Alignment
fr: Alignement des images
it: Parametri per il blocco contenente le immagini

# palette.imagefiles
source: Images and Captions
fr: Images et légendes
it: Files di immagini e didascalie

# palette.imagelinks
source: Behavior
fr: Comportement
it: Testo cliccando l'immagine

# palette.image_settings
source: Image Adjustments
fr: Ajustements aux images
it: Parametri di configurazione per le immagini

# palette.loginform
source: Redirect Target and Frontend User Container
fr: Destination de la redirection et page contenant les utilisateurs frontend
it: Redirect target e FE user container
