Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_csh_weblayout.xlf
Languages: fr, it, ru

# quickEdit.details
source: The Quick Editor is designed to cut down the number of clicks involved in getting to edit the page content. Simply by clicking the page title in the page tree you've got the first content element in the normal column loaded in the list frame. In the toolbar in the top you can select the other content elements on the page in the selector box.
fr: L'éditeur rapide a pour but de réduire le nombre de clic nécessaire pour éditer le contenu d'une page. Simplement en cliquant sur le titre d'une page, vous aurez le premier élément de la colonne normal chargé. Dans la barre d'outil en haut, vous pouvez séléctionner les autres éléments dans le menu déroulant.
it: Il Quick Editor è stato concepito per poter accedere con pochi click al contenuto della pagina. Cliccando il titolo della pagina nell'albero delle pagine viene aperto il primo blocco di contenuto della pagina. Attraverso la toolbar puoi accedere agli altri blocchi di contenuto presenti nella pagina.
ru: Быстрый Редактор разработан, чтобы сократить число щелчков для редактирования содержимого страницы. Простым щелчком по названию страницы в дереве страниц открывается первая запись из ее содержимого. В верхней панели инструментов возможно выбрать другие записи из списка.

# quickEdit.image_descr
source: The QuickEdit view cuts of one extra click by bringing the user directly to the editing form after clicking a page title in the page tree. The record shown is always the first content element from the Normal column.
fr: La vue d'édition rapide évite un clic supplémentaire en amenant directement l'utilisateur au formulaire d'édition après avoir cliqué sur un titre de page dans l'arborescence. L'enregistrement affiché correspond toujours au premier élément de contenu de la colonne Normal.
it: La vista con Quick Edit risparmia un click in più e porta l'utente direttamente al modulo di editing dopo aver cliccato il titolo di pagina nell'albero delle pagine. Il record visualizzato è semkpre il primo elemento di contenuto della colonna Normale.
ru: При быстром редактировании, щелчек по заголовку страницы отобразит форму редактирования первого элемента содержимого страницы в Обычной колонке.

# quickEdit_selElement.alttitle
source: Content Elements
fr: Eléments de contenu
it: Elementi Contenuto
ru: Элементы содержимого

# quickEdit_selElement.description
source: This is an overview of the content elements on this page in QuickEdit mode. Select another element to edit or click a "New" icon to create a new content element.
fr: C'est un aperçu des éléments de cette page dans le mode d'édition rapide. Sélectionnez un autre élément pour l'éditer ou cliquez sur l'icône "Nouveau" pour créer un nouvel élément.
it: Visione d'insieme del contenuto della pagina. Seleziona un altro blocco da modificare o clicca sull'icona "Nuovo"per crearne uno di nuovo.
ru: Это - краткий обзор записей на этой странице. Выберите другой элемент для редактирования или щелкните на кнопку "Нов.", чтобы создать новую запись.

# quickEdit_selElement.image_descr
source: Overview of page content elements in the QuickEdit view. In the bottom there are links to two wizards: The "Move Content Element Wizard" and the "Create new Content Element Wizard". See the links below.
fr: Vue d'ensemble des éléments de contenu dans la vue d'édition rapide. Vous trouverez ci-dessous des liens menant à : l'assistant "Déplacer l'élément de contenu" et l'assistant "Créer un nouvel élément de contenu". Voir les liens ci-dessous.
it: Nella modalità di Editing veloce (QuickEdit) visualizza gli elementi di pagina sottoforma di panoramica. Nella parte inferiore ci sono dei link a due wizard: "Wizard per spostare l'elemento di contenuto" e "Wizard per creare un nuovo elemento di contenuto". Guarda i link sottostanti.
ru: Резюме элементов содержимого страницы в отображении Быстрого редактирования. Внизу имеются ссылки на два мастера: "Мастера перемещения элементов содрежимого" и "Мастера создания нового элемента содержимого".

# _.seeAlso
source: Configuring the Page module [Technical] | https://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, About the page module | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Editing a page | https://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ The Page Module (Animation) | Using the page tree (Animation) | FILE:EXT:welcome/modsub/ani_05.gif
fr: Configuration du module Page [Technique] | http://docs.typo3.org/typo3cms/TSconfigReference/PageTsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, A propos du module Page | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Modifier une page |http://docs.typo3.org/typo3cms/GettingStartedTutorial/EditAndCreatePagesAndContent/EditPageContent/ Le module Page (Animation) | Utiliser l'arborescence de pages (Animation) | FILE:EXT:welcome/modsub/ani_05.gif
ru: Настройка модуля Страница [технически] | http://typo3.org/documentation/document-library/doc_core_tsconfig/TSFE/, xMOD_csh_corebe:history_log, xMOD_csh_corebe:new_ce, xMOD_csh_corebe:move_el_pages, xMOD_csh_corebe:new_pages, xMOD_csh_corebe:TCEforms, О модуле страница | http://typo3.org/documentation/tips-tricks/the-new-page-editing-concept/ Редактирование страницы | http://typo3.org/documentation/document-library/doc_tut_quickstart/Edit_page/ Модуль Страница (анимация) | Работа с деревом страниц (анимация) | FILE:EXT:welcome/modsub/ani_05.gif
