Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_csh_weblayout.xlf
Languages: fr, it, ru

# .alttitle
source: Web > Page Module
fr: Module Web > Page
it: Web > Pagina
ru: Веб > Модуль страницы

# button_panel.alttitle
source: The "Big Buttons"
fr: Les "gros boutons"
it: I "grandi pulsanti"
ru: "Большие кнопки"

# button_panel.description
source: These buttons will bring you to four most used functions in relation to building pages. From here you can edit the page properties (eg. the page title), you can move the current page to another position in the page tree, create a new page somewhere in the page tree or create new content elements on this page.
fr: Ces boutons vous permettent d'accéder aux fonctions les plus utilisées lors de l'édition des pages. Vous pouvez modifier les propriétés de la page (son titre par exemple), déplacer la page courante dans l'arborescence, créer une nouvelle page ou créer de nouveaux blocs de contenu dans cette page.
it: Questi pulsanti permettono di usare una delle funzioni più comuni per la formazione delle pagine. Da qui puoi editare le proprietà di pagina (es. il titolo di pagina), spostare la pagina corrente in un'altra posizione nell'albero delle pagine, creare una nuova pagina nell'albero delle pagine, nella posizione desiderata, o creare un nuovo elemento di contenuto in questa pagina.
ru: При этом будут отображены четыре наиболее используемые при создании страниц функции. Доступно редактирование свойств страницы (напр. заголовок страницы), можно передвинуть страницу, создать новую страницу или элемент ее содержимого.

# columns_1.alttitle
source: Listing by Column
fr: Tri par colonne
it: Lista per Colonne
ru: Содержимое по колонкам

# columns_1.description
source: In the "Columns" view you can control the content of the web page as it is positioned in columns.
fr: Avec la vue "Colonnes", le contenu de la page est séparé en fonction de la colonne dans laquelle il se trouve.
it: Attraverso la vista a colonne puoi visualizzare il contenuto della pagina secondo la sua reale disposizione su più colonne.
ru: В режиме "Колонки" Вы можете управлять содержанием веб-страницы, размещенным в колонках.

# columns_2.alttitle
source: Listing by Language
fr: Tri par langue
it: Lista per Lingua
ru: Содержимое по языкам

# columns_2.description
source: In the "Languages" view you can control the content of the web page as it is divided into languages and columns.
fr: Avec la vue "Langues", le contenu de la page est séparé en fonction de sa langue et de sa colonne.
it: In "vista traduzioni" puoi controllare il contenuto della pagina web che viene suddivisa in lingue e colonne.
ru: В режиме "Языки" Вы можете управлять содержанием веб-страницы, размещенным в колонках и разделенным по языкам.

# _columns_2.seeAlso
source: Article about localization | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/
fr: Article sur la localisation | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/
it: Articolo relativo alla localizzazione | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/
ru: Статья о локализации | http://typo3.org/documentation/tips-tricks/multi-language-sites-in-typo3/

# columns_3.alttitle
source: Page Information
fr: Information sur la page
it: Informazioni sulla pagina
ru: Инфромация о странице

# columns_3.description
source: In the "Page Information" view you can see various statistics about a page.
fr: Avec la vue "Information sur la page", vous pouvez visualiser différentes statistiques concernant la page.
it: In "Informazioni sulla Pagina" puoi visualizzare varie statistiche sulla pagina.
ru: В режиме "Информация о странице" Вы можете просматривать различную статистику по странице.

# columns_3.details
source: The page information reveals information such as the date of creation and last modification of the page and its content. You can also see the subtitle, keywords and descriptions. This information is often used on websites for meta data or searching.
fr: Les informations de la page regroupent des informations comme la date de création ou de dernière modification de la page et son contenu. Vous y trouverez également les sous-titres, les mots-clés et la description de la page. Ces informations sont souvent utilisées sur des sites Web comme méta-données ou par les moteurs de recherche.
it: Le informazioni di pagina illustrano alcune informazioni come la data di creazione e dell'ultima modifica alla pagina e ai suoi contenuti. Puoi anche vedere il sottotitolo, le parole chiave e i campi descrizione. Le informazioni sono spesso usante sui siti web come meta-data o per le ricerche.
ru: Информация о странице – дата создания, последнего изменения страницы и ее содержимого. Можно также просмотреть подзаголовки, ключевые слова и описания. Эта информация зачастую используется на вебсайтах для мета данных или поиска.

# columns_multi.alttitle
source: Page content elements in a multiple columns
fr: Les blocs de contenu dans plusieurs colonnes
it: Elementi di contenuto di pagina disposti in più colonne
ru: Содержимое страницы по колонкам

# columns_multi.description
source: The multiple column view will show the content of your website arranged in multiple columns. This is the case if your website supports more than one content zone and the content elements from each zone is arranged in "columns".
fr: La vue dans plusieurs colonne affiche les blocs de contenus tels qu'ils sont organisés dans les colonnes de la page. Cette vue est utilisée si votre site web contient plus d'une zone de contenu et que le contenu de ces zones est organisé en "colonne".
it: La visualizzazione in più colonne visualizzera i contenuti del sito disposti in più colonne. Questo è il caso nel quale il tuo sito web supporta una o più zone che ospitano elementi di contenuto; ogni zona è organizzata in "colonne".
ru: Отображение содержимого страницы по колонкам. Выберете этот режим, если на Вашем сайте несколько зон для содержимого и каждая разбита на "колонки"

# columns_multi.image_descr
source: When your website supports multiple content element zones in the template you will be able to use another column than the "Normal" column. Here the "Left" column is enabled. TYPO3 offers four columns by default, "Normal", "Right", "Left" and "Border". Their significance depends on individual implementations in the frontend templates.
fr: Quand votre site Internet intègre plusieurs zones d'éléments de contenu dans le gabarit vous pourrez utiliser une autre colonne que la colonne 'Normale'. Ici la colonne 'Gauche' est autorisée. TYPO3 offre quatre colonnes par défaut, 'Normale', 'Droite', 'Gauche' et 'Bordure'. Leur signification dépend des implémentations faites dans les gabarits frontend.
it: Quando il tuo sito web supporta più zone di elementi di contenuto nel template, tu potrai usare un'altra colonna diversa dalla "Normale" che è quella visualizzata per default. Qui la colonna "Sinistra" è abilitata. TYPO3 offre la possibilità di usare quattro colonne per default, "Normale", "Destra", "Sinistra" e "Bordo". Il loro significato e uso dipendono dal tipo di modello (template) usato nel frontend.
ru: Если шаблон Вашего сайт поддерживает несколько зон с содержимым, вы можете использовать другие, отличные от "Обычной", колонки. Здесь включена "Левая" колонка. В TYPO3 по умолчанию доступно четыре колонки, "Обычная", "Правая", "Левая" и "Граничная". Их использование зависит от индивидуальных предпочтений и внешнего шаблона.

# columns_single.alttitle
source: Page content elements in a single column
fr: Les blocs de contenus dans une colonne unique
it: Elementi di contenuto in una singola colonna
ru: Содержимое страницы в одной колонке

# columns_single.description
source: The single column view will show the page content elements that define the content on this page of your website. Click an edit icon or element text to edit an element.
fr: La vue dans une colonne unique affiche les blocs de contenus de la page courante. Cliquez sur un icône d'édition ou sur le texte du bloc pour éditer le bloc.
it: La vista per singola colonna mostra gli elementi di contenuto visualizzati nel sito web. Clicca l'icona di modifica o il testo visualizzato per modificare un elemento.
ru: Элементы содержимого страницы отображаются в одной колонке. Для их редактирования щелкните по значку редактирования или текстовому элементу.

# columns_single.details
source: You can also hide, delete and move elements by using the control panels. Clicking the "New content element" icon you will be able to create new content elements in between the existing elements on the page. Click the icon of a content element if you wish to access the context menu of the element.
fr: Vous pouvez aussi cacher, effacer et déplacer des éléments en utilisant les panneaux de contrôle. En cliquant sur l'icône 'Nouvel élément de contenu', vous serez en mesure de créer de nouveaux éléments de contenus entre les éléments existants sur la page. Cliquez sur l'icône d'un élément de contenu si vous voulez accéder au menu contextuel de l'élément.
it: Puoi anche nascondere, cancellare o spostare gli elementi usando i pannelli di controllo. Cliccando l'icona "Nuovo elemento di contenuto" potrai creare nuovi elementi di contenuto tra gli elementi già esistenti nella pagina. Clicca l'icone di un elemento di contenuto se desideri accedere al menu contestuale relativo all'elemento scelto.
ru: Также можно скрыть, удалить или передвинуть элементы при помощи панели упрвления. Нажав на значек "Создать новый элемент", можно вставить новый элемент содержимого между существующими на странице. Щелкнете по значку элементу содержимого для доступа к его контекстному меню.

# columns_single.image_descr
source: Content Elements on a page are arranged in a specific order - the order they appear on the website. This order is also shown in the page module. The control panel allows you to move elements up and down as well as edit, hide and delete them. You can also just click the preview text shown here to access the editing form of the element.
fr: Les éléments de contenu sur une page sont disposées dans un ordre précis - l'ordre où ils apparaissent sur le site. Cet ordre est également indiqué dans le module page. Le panneau de contrôle vous permet de déplacer des éléments haut et bas ainsi que de les modifier, les cacher et de les supprimer. Vous pouvez également simplement cliquer ici sur le texte de l'aperçu pour accéder au formulaire d'édition de l'élément.
it: Gli elementi di contenuto in una pagina sono disposti in un ordine specifico - l'ordine con il quale appariranno nel sito web. Questo ordine è mostrato anche nel modulo pagina. I pannelli di controllo (pulsantiere) ti permetteranno di spostare gli elementi in alto e in basso e ancor di più di modificare, cancellare o nascondere l'elemento sul quale stai lavorando. Puoi anche premere il testo visualizzato in anteprima per accedere al modulo di modifica dell'elemento.
ru: Элементы содержимого расположены в порядке их отображения на вебсайте. Такой же порядок отображается в модуле Страница. Контрольная панель позволяет как передвигать элементы, так и редактировать, скрывать и удалять их. Можно просто щелкнуть на отображаемый здесь текст просмотра, для доступа к форме редактирования элемента.

# .description
source: The page module is activated from the backend menu and is the primary module for all basic CMS operations you need to perform when maintaining website content.
fr: Le module Page est le module principal qui vous permettra d'éditer le contenu de votre site web. Ce module regroupe toutes les fonctionnalités de base d'un outil de gestion de contenu.
it: Il modulo Pagina viene selezionato dal menu del backend, ed è il modulo principale per tutte le operazioni di base per la gestione dei contenuti del sito.
ru: Модуль страницы включается из меню и является основным модулем для всех основных операций создания и обновления контента сайта.

# .details
source: Selecting the module will display the page tree. Click the title of the page you wish to edit content on, and in the right frame you will see the content of the page displayed by the Page module. The page module has various modes of display of content; <b>Columns</b> The columns view will show Content Elements listed in the columns and in the order that they will appear on the website. A panel of buttons will allow you to hide/unhide, move and edit the elements easily. <b>QuickEdit</b> In QuickEdit the first element on the page will be loaded into a form right away. It will depend on the implementation of your website as well as your general preferences if you like this mode more than the columns view. <b>Languages</b> If your site supports multiple languages and uses the "one-tree-fits-all" concept for localization you will need this mode to control the translations of the content elements on a page. <b>Page information</b> The page information view shows some statistical data about a page. This includes hit statistics if available. <b>General options</b> In the top of the Page module you will find a row of icons that will bring you right to various features such as History/Undo (1), Create new content element (2), Move page (3), Create new page (4) and Edit page properties (5). See image below. <b>Defining number of displayed columns [Admin]</b> Administrators can configure the Page module to display only the content columns that the website uses. This is done by Page TSconfig (so it can be configured per branch in the page tree!) and this particular option has the object path "mod.web_layout.tt_content.colPos_list". For instance "mod.web_layout.tt_content.colPos_list = 0,3" will set the display of the "Normal" and "Border" columns only. There are many other options for customization of the Page module in the object path "mod.web_layout" and Administrators should refer to the "TSconfig" reference linked to below.
fr: Le module affichera l'arborescence des pages. Cliquez alors sur le titre de la page dont vous voulez modifier le contenu et dans la colonne de droite apparaîtra le contenu de cette page. Le module Page dispose de différents modes d'affichage de contenu; <b>Colonnes </b> La vue en colonnes montrera les Éléments de Contenus affichés dans l'ordre où ils apparaîtront sur le site Internet. Une série de boutons vous permettra de cacher/afficher, déplacer et réviser les éléments facilement. <b>Édition rapide</b> Dans l'Édition rapide le premier élément de la page sera chargé immédiatement dans un formulaire. Il dépendra de l'implémentation de votre site Internet ainsi que de vos préférences générales si vous préférez ce mode à la vue Colonnes. <b>Langues</b> Si votre site utilise plusieurs langues et s'appuie sur une arborescence unique, vous aurez besoin de ce mode pour contrôler les traductions des éléments de contenus pour une même page. <b>Informations</b> La vue informations de page reporte quelques données statistiques. Cela inclut la statistique de consultation si cette information est disponible. <b>Options générales</b> Dans le haut du module de Page vous trouverez une rangée d'icônes qui vous donneront droit à des caractéristiques différentes comme Historique/Défaire (1), Création d'un nouvel élément de contenu (2), Déplacer la page (3), Créer une nouvelle page (4) et Modifier les propriétés de la page (5). Voir l'image ci-dessous. <b>Définir le nombre de colonnes affichées [Admin]</b> Les Administrateurs peut configurer le module Page pour afficher seulement les colonnes de contenus que le site Internet utilise. On utilise le Page TSconfig (donc il peut être configuré par branche d'arborescence !) et cette option particulière utilise le paramètre "mod.web_layout.tt_content.colPos_list". Par exemple "mod.web_layout.tt_content.colPos_list = 0,3" affichera les colonnes "Normale" et "Bordure" uniquement. Il y a beaucoup d'autres options pour la personnalisation du module Page à l'aide de "mod.web_layout".A cet effet, les administrateurs devront se référer à la documentation "TSconfig" (lien plus bas).
it: Selezionando il modulo sarà visualizzato l'albero delle pagine. Clicca il titolo della pagina che desideri modifica e nel riquadro più a destra vedrai il contenuto della pagina visualizzato dal modulo 'Pagina'. Il modulo 'Pagina' ha diversi modi per visualizzare il contenuto: <b>Colonne</b> La vista per colonne visualizzerà elementi di contenuto elencati nelle varie colonne e nello stesso ordine di apparizione nel sito web. Un pannello di pulsanti ti permett di nascondere/visualizzare, spostare e editare gli elementi con facilità. <b>QuickEdit (editing veloce)</b> Nella modalità Quickedit il primo elemento della pagina sarà caricato in un modulo. La visualizzazione delle colonne dipende o meno dalle impostazioni generali del sito web; una o più colonne potranno o meno essere visualizzate. <b>Lingue</b> Se il tuo sito supporta la modalità multilingue e usa tecniche di localizzazione basate sul concetto d'uso di un unico albero ("one-tree-fits-all") avrai bisogno di questa modalità per controllare le traduzioni degli elementi di contenuto relativi alla pagina editata. <b>Informazioni di pagina</b> Mostra alcuni dati statistici sulla pagina selezionata. Include le statistiche d'accesso (hit) se disponibili. <b>Opzioni generali</b> In cima al modulo 'Pagina' troverai una riga con alcune icone che ti permettono di svolgere alcune azioni come Storia dei cambiamenti/Annulla (1), Crea un nuovo elemento di contenuto (2), Sposta la pagina (3), Crea una nuova pagina (4) e Edita le proprietà di pagina (5). Vedi l'immagine seguente. <b>Definire il numero delle colonne visualizzate [Amministratore]</b> L'amministratore può configurare il modulo Pagina per visualizzare solo il contenuto di alcune colonne necessarie al sito web gestito dai redattori. Questo viene fatto attraverso il codice TSconfig (la configurazione afferisce l'intero ramo delle pagine sottostanti!) e questa opzione particolare usa l'oggetto di path "mod.web_layout.tt_content.colPos_list". Per esempio "mod.web_layout.tt_content.colPos_list= 0,3" visualizzerà nel riquadro a destra solo la colonna 'Normale' e la colonna 'Bordo' nascondendo le altre. Ci sono numerose altre opzioni per personalizzare il modulo Pagina nell'oggetto di path "mod.web_layout" e l'amministratore deve far riferimento alle istruzioni di "TSconfig" cliccando il link sottostante.
ru: При выборе этого модуля будет отображено

# .image_descr
source: Click the Page module, then the title of a page in the page tree. The page module is now activated in the right frame, showing the content of the page you clicked in the page tree. These buttons are direct links to the History/Undo function (1), Create new content element wizard (2), Move page wizard (3), Create new page wizard (4) and Edit page properties form (5). See the links for more details.
fr: Cliquez sur le module Page, puis le titre d'une page dans l'arborescence. Le module Page est maintenant activé dans le cadre de droite, montrant le contenu de la page sur laquelle vous avez cliqué dans l'arborescence. Ces boutons sont des liens directs vers : l'historique / fonction Annuler (1), l'assistant de création d'un nouvel élément de contenu (2), l'assistant de déplacement des pages (3), l'assistant de création d'une nouvelle page (4) et vers le formulaire d'édition des propriétés de la page (5). Voir les liens pour plus de détails.
it: Clicca il modulo Pagina e il titolo della pagina dall'albero delle pagine. Il modulo Pagina è ora attivo nel frame a destra che mostra il contenuto della pagina selezionata dall'albero delle pagine. Questi pulsanti sono dei link diretti alle funzioni di Cronologia/Annulla (1), Crea un nuovo elemento di contenuto con il wizard (2), Muovi la pagina con il wizard (3), Crea una nuova pagina con il wizard (4) ed il modulo Edita le proprietà di pagina (5). Vedi i links per maggiori dettagli.
ru: Перейдите в модуль "Страница", затем кликните по названию страницы в дереве страниц. Модуль "Страница" будет активизирован в правой части окна и будет отображать содержимое выбранной вами страницы. Эти кнопки &mdash; прямые ссылки на: модуль история/отмены (1), мастера создания новых элементов содержимого (2), мастера перемещения страниц (3), мастера создания новых страниц (4) и форму свойств страницы (5). Смотрите ссылки для получения дополнительной информации.

# language_list.alttitle
source: Language view
fr: Vue par langue
it: Vista traduzioni
ru: Локализация

# language_list.description
source: This view will display the available translations of the page content side-by-side. It enables users to create a new translation of a page.
fr: Cette vue affiche les traductions existantes des blocs de contenu côte à côte. Elle permet également de créer une nouvelle version de la page.
it: Visualizza affiancate le traduzioni disponibili dei contenuti di pagina. Abilita l'utente a creare una nuova traduzione della pagina.
ru: В этом режиме отображаются доступные переводы содержимого страницы рядом друг с другом. Он используется пользователями для создания нового перевода страницы.

# language_list.image_descr
source: In the Language view you can select to create a new translation of the page if one does not exist already. The available languages must be defined first by language records created in the root of the page tree. This example shows how page content for three languages is shown side-by-side in the Page module. In the top of the Page module you can also select between the available translations... ... and if you select any of the additional languages (here "Danish" and "German") you will see the default language displayed side-by-side with the selected language
fr: Dans la vue de Langue, vous pouvez créer une nouvelle traduction de la page si elle n'existe pas encore. Les langues disponibles doivent être définies d'abord via les enregistrements de langue créés à la racine de l'arborescence des pages. Cet exemple montre comment le contenu d'une page en trois langues est affiché côte à côte dans le module Page. Dans le haut du module Page vous pouvez aussi choisir parmi les traductions disponibles ... ... et si vous choisissez n'importe laquelle des langues supplémentaires (ici "le danois" et "l'allemand") vous verrez la langue par défaut affichée à côté de la langue choisie
it: Nella "vista traduzioni" puoi selezionare la creazione di nuove traduzioni della pagina se non già esistenti. Le lingue disponibili possono essere definite tramite i record di localizzazione configurati alla radice del sito. Questo esempio mostra come i contenuti di pagina per tre lingue sono visualizzati affiancati nel modulo Pagina. In alto al modulo Pagina puoi anche selezionare tra "traduzioni disponibili..." e se tu selezioni una delle lingue aggiuntive (qui "Danese" e "Tedesco") vedrai che la lingua principale di default viene visualizzata affiancata alla lingua selezionata per la traduzione.
ru: При отображении локализации, можно создать новый перевод страницы, если он еще не существует. Но сначала нужно создать запись для языка на корневой странице сайта. В этом примере показано, как отображается содержимое для трех языков в модуле Страница. Свеху модуля Страница можно выбрать из доступных переводов.... ... и, при выборе дополнительного языка (здесь "Danish" и "German"), Вы увидите язык по умолчанию, рядом с выбранным языком.

# quickEdit.alttitle
source: Quick Edit
fr: Edition rapide
ru: Быстрый Редактор

# quickEdit.description
source: The Quick Editor gives you direct access to the form fields of the page content.
fr: L'éditeur rapide vous donne un accès rapide aux champs de formulaire du contenu de la page.
it: Attraverso il Quick Edit puoi accesso diretto al contenuto della pagina.
ru: Быстрый Редактор предоставляет непосредственный доступ к содержанию страницы.
