Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_csh_webinfo.xlf
Languages: fr, ru

# func_0.alttitle
source: Basic Settings
fr: Configuration de base
ru: Основные настройки

# func_0.description
source: Displays a selection of fields from page records which are regarded as foundational settings for pages. That includes aliases, start- and stop times, access restriction information etc.
fr: Affiche une sélection de champs à partir des enregistrements page qui sont considérés comme les paramètres de base pour les pages. Cela inclut les alias, les début et fin, les informations de restriction d'accès, etc
ru: Отображает основной раздел полей страницы. Включает в себя aliases, start- and stop times, ограничение доступа и т.д.

# func_0.details
source: The Basic Settings view resembles the Cache and Age view quite a lot. They are different only by the selection of fields they show. <b>Batch editing page fields</b> You will find multiple edit-icons around the interface. All edit icons in head lines will bring you to an editing dialog where you can change exactly that field for all listed tables! Very useful for batch-editing of say all "Start" times. If you click the edit icon at the ID numbers of pages you will get straight to the regular editing of a whole page record.
fr: La vue Réglages de base ressemble beaucoup à la vue Cache et âge. Elles ne diffèrent que par le choix des champs proposés. <b> Traitement par lot des champs de page</ b> Vous trouverez de multiples icônes d'édition autour de l'interface. Toutes les icônes d'édition en tête de lignes vous amèneront à une boîte de dialogue d'édition où vous pouvez changer exactement le champ pour toutes les tables répertoriées! C'est très utile, par exemple, pour paramétrer en traitement par lot "Démarrer" de multiples fois. Si vous cliquez sur l'icône d'édition des IDs de pages, vous irez directement sur l'édition régulière d'un enregistrement de page complet.
ru: Основные настройки напоминает представление Кеш и Возраст. Они отличаются лишь набором отображаемых полей. <b>Пакетное редактирование полей страницы</b> Вы найдете множество значков правки в интерфейсе. Все иконки редактирования на уровне заголовка вызывают диалог редактирования, в котором Вы сможете изменить нужные поля всех перечисленных таблиц! Полезно для пакетного редактирования, например времени во всех полях "Старт". Щелкнув значек редактирования у ID номеров страниц, Вы перейдете к прямому редактированию всей записи страницы.

# func_0.image_descr
source: The Basic Settings view offers a very convenient overview of page aliases, start times and access restriction settings in the tree branch. If you click an edit-icon in the header you will be able to edit that field for all listed pages.
fr: La vue des paramètres de base offre un aperçu très pratique des alias de pages, des dates de début et des paramètres de restriction d'accès dans l'arborescence. Si vous cliquez sur une icône d'édition dans l'en-tête vous pourrez éditer ce champ pour toutes les pages listées.
ru: Обзор Основные настройки предлагает очень удобный краткий обзор псевдонимов страницы, времена начала и параметров настройки ограничения доступа в ветви дерева. Щелкнув по значку редактирования в заголовке, Вы сможете отредактировать выбранное поле для всех перечисленных страниц.

# func_1.alttitle
source: Record Overview
fr: Enregistrement (vue d'ensemble)
ru: Обзор элементов записей

# func_1.description
source: Record overview gives you an indispensable overview of the distribution of records in the page tree. Each database table in the system is represented with a column and for each page you can see the number of records from that table located on the page.
fr: La vue d'ensemble des enregistrements vous donne un aperçu indispensable de la distribution des enregistrements dans l'arborescence. Chaque table de base de données dans le système est représentée par une colonne et pour chaque page vous pouvez voir le nombre d'enregistrements de cette table présents sur la page.
ru: Обзор элементов записей позволяет увидеть как распределены записи в дереве страниц. Каждая таблица БД в системе представлена колонкой и для каждой страницы можно увидеть кол-во записей из этой таблицы БД

# func_1.details
source: <b>Notice:</b> Be careful with the level-setting. A high level-setting may cause the module to respond very slowly if there are many pages and many records in the database as well! <b>Tree stop?</b> Notice the red "+" next to a page in the page tree? This is due to a setting for that page record which means that the page tree will not expand for this page. Typically this is set for protection when there are a large amount of subpages underneath (hundreds of pages typically). If you click the icon/title the overview will jump to make this page the new root of the overview.
fr: <b>Note :</b> Faites attention au paramètre de niveau. Plus le nombre de niveaux est élevé plus il y a de risques que le module réponde lentement notamment s'il y a beaucoup de pages et d'enregistrements dans la base de données ! <b>Arrêter l'arborescence ?</b> Avez-vous remarqué le "+" rouge à côté d'une page dans l'arborescence ? Ceci signifie qu'un réglage sur cette page empêche le développement / l'ouverture de l'arborescence. Ce réglage sert de protection lorsqu'il y a un nombre très important de sous-pages en-dessous (des centaines de pages en général). Si vous cliquez sur l'icône/titre, l'aperçu de l'arborescence se modifiera afin d'afficher cette page en tant que nouvelle page racine.
ru: <b>Примечание:</b> Будьбе внимательны при установке глубины отображения записей. Большая глубина отображения может вызвать большую задержку отклика, особенно если много не только страниц но и записей! <b>Остановить дерево?</b> Заметили красный "+" рядом со страницей? Он появляется в том случае, если в настройках было указано не идти вглубь этой страницы. Обычно это ставиться в тех случаях когда имеется большое количество вложенных страниц (сотни). При нажатии на эту кнопку (красный "+") выбранная страница становиться новой исходной точкой обзора.

# func_1.image_descr
source: You can easily see the distribution of Content Elements on a page. You can also see where Template Records - and basically any record! - are located in the page tree!
fr: Vous pouvez facilement voir la répartition des éléments de contenu sur une page. Vous pouvez également voir où sont situés les Templates Records - ainsi que n'importe quel enregistrement ! - dans l’arborescence !
ru: Вы можете легко увидеть как распределены Контент-элементы на странице. Также можно увидеть где в дереве страниц расположены Шаблоны (как и любая другая запись)!

# func_2.alttitle
source: Cache and Age
fr: Cache et Age
ru: Кеш и Возраст

# func_2.description
source: Displays a selection of fields from page records related to page caching and time settings.
fr: Affiche une sélection de champs des enregistrements de page relatifs au cache de page et aux paramètres de temps.
ru: Показывает раздел полей относящихся к кешированию страниц и их возрасту.

# func_2.image_descr
source: The "Cache and Age" view. Here you see the "TSconfig" column. The overview exposes that these two pages include some Page TSconfig code!
fr: La vue "Cache et Age". Ici vous pouvez voir la colonne "TSconfig". L'aperçu indique que du code Page TSconfig est inclus dans ces deux pages !
ru: Обзор "Кеш и Возраст". Здесь Вы видите колонку "TSconfig". В кратком обзоре это предоставлено как две страницы включающие некоторый код TSconfig страницы!

# func_hits.alttitle
source: Statistic Views
fr: Vues de statistiques
ru: Обзор статистики

# func_hits.description
source: You can select between three views of the statistics in the selector box; "Page hits", "Total hits", "Hits in main sections". Use the right selector box to select the depth of the overview in the pagetree.
fr: Vous pouvez choisir entre trois vues de statistiques dans la boite de sélection; 'Touches de pages', 'Nombre total de touches', 'Touches dans les sections principales'. Utilisez la boite de sélection de droite pour sélectionnez la profondeur de l'aperçu dans l'arborescence.
ru: Можно выбрать между тремя представлениями статистики через блок выбора; "Посещаемость страниц", "Общая посещаемость", "Посещаемость основных разделов". Используйте правый блок выбора для определения глубины просмотра дерева страниц.

# func_hits.details
source: You can view the page hit statistics 30 days back. Each day is shown in its own column. For each page in the page tree you can see the page hits each day as a number formatted like [page hits]/[user sessions]. So if the number is "286/34" it means that the page had 286 page hits that day and that there were at least 34 unique visitors (measured by at least two hits by a user accepting a cookie from the site). This is an overview of the meaning of each view mode: <b>Page hits</b> This shows page hits/sessions for each page. <b>Total hits</b> This will show statistics for only pages that have a Template Record (with Root-flag set) on it. This means that page hits are shown as totals for a whole website. <b>Hits in main sections</b> Will show the total number of page hits/sessions within main sections of a website. A "main section" is all subpages to a page on the first level of a website (defined by a Template Record with the Root flag set)
fr: Vous pouvez consulter la page des statistiques jusqu’à 30 jours en arrière. Chaque jour est représenté dans sa propre colonne. Pour chaque page dans l'arborescence des pages, vous pouvez voir le nombre de visites chaque jour avec un nombre formaté comme [visites sur la page] / [sessions utilisateur]. Donc si le nombre est «286/34», cela signifie que la page avait 286 visites ce jour-là et qu'il y avait au moins 34 visiteurs uniques (équivalent à au moins deux visites par un utilisateur qui accepte les cookies sur le site). Ceci est un aperçu de la signification de chaque mode: <b>Visites sur la page</b> Cette page montre le nombre de visites/sessions pour chaque page. <b>Total des visites</b> Cela montrera seulement les statistiques des pages qui ont un gabarit (avec la case "Racine du site" cochée). Cela signifie que ce nombre de visites est présenté comme le total pour tout le site. <b>Visites dans les sections principales</b> Affiche le nombre total de pages consultées/sessions au sein des principales sections d'un site web. Une "section principale" est l'ensemble des sous-pages d'une page de niveau 1 d'un site web (définis par un gabarit Typoscript avec la case "Racine du site" cochée)
ru: Можно просмотреть статистику посещения страницы за 30 последних дней. Каждый день показан в своей колонке. Для каждой страницы в дереве страниц можно видеть посещаемость узла за каждый день как число в формате [посещаемость узла] / [пользовательские сессии]. Так, число "286/34" означает, что страница была посещена 286 раз за этот день, по крайней мере 34 уникальными посетителями (измеряется, по крайней мере, двумя нажатиями пользователя, принимающего cookie от сайта). Можно сделать обзор в трех представлениях: <b>Посещаемость страниц</b> Показаны посещения/пользователи для каждой страницы. <b>Общая посещаемость</b> Будет показана статистика лишь страниц с Записью шаблона (и установленным флагом "Является корнем сайта"). Что означает суммарную посещаемость веб-сайта. <b>Посещаемость основных разделов</b> Будет показана общая посещаемость/пользователи странц в пределах основных разделов веб-сайта. "Основной раздел" – это все подстраницы страницы первого уровня веб-сайта (определяется по Записи шаблона с установленным флагом "Является корнем сайта")

# lang.alttitle
source: Localization overview
fr: Localisation (vue d'ensemble)
ru: Обзор локализаций

# lang.description
source: Gives an overview of which pages in the page tree are translated to the system languages installed.
fr: Donne un aperçu montrant quelles pages de l'arborescence sont traduites pour les langues système installées.
ru: Дает общее представление о том какие страницы переведены на установленные в системе языки

# lang.details
source: The overview uses colors to signal the availability and fall back situation for a given page. Here is a description for each color code: <b>Green background:</b> Page is translated and viewable in this language. For translations it means that an active page overlay record is present. <b>Red background:</b> Page <em>cannot</em> be viewed in this language and you will see an error message if you try. Menus should automatically filter out links to pages with this translation. <b>Gray background (not available for default language):</b> Page will fall back to the specified fallback mode for content. Depends on configuration. (sys_language_mode = content_fallback is recommended for most flexible fallback, sys_language_mode = strict will prevent this and issue an error instead!) <b>The pages "Localization settings:"</b> It is the "Localization settings" of the page record that determines the modes above. In the column of the default translation each of these settings are represented by a "N" (Hide page if no translation for current language exists) or a "D" (Hide default translation of page). As you can see the page "Startpage" has the N flag set and therefore any access to the german version of that page will be blocked with an error message because there is no translation in german. By default "german access" to a non-translated page will just show the english content. There is also a page with the D flag ("[Dummy]"). The D flag means that the page is only available in one of the translations, in this case Danish. So any attempt to access the page in the default language or german will show an error message. So, when the "Localization settings" checkboxes for a page are used, you will get an error message when you try to request a page which has been blocked. This is a feature. The trick is not to create links to those pages. Menus generated from HMENU objects will always take "sys_language" into account and display only pages which can be accessed for that language. But combined with the "localization settings" of pages which may block page access this becomes a problem with pages which are <em>not</em> translated (has gray background); You might get menu items which links to non-accessible pages. The problem basically is that "&L=xx" is different from internal "sys_language". You would like to avoid that and to do so you should configure "sys_language_mode" to "content_fallback". If you do that sys_language will <em>always</em> follow what "&L=" instructs it to and your menus will be right. At the same time you will get the default content displayed if no translation exists (because content selection falls back). Finally, the number found in each column tells you how many content elements are found in the specified language.
fr: La vue d'ensemble utilise des couleurs afin de signaler la disponibilité et l'héritage d'une page donnée.Voici une description des codes de couleur: <b>Fond "Vert":</b>La page est traduite et visible dans cette langue. Pour la traduction cela signifie qu'un enregistrement de langue alternative de la page est présent et activé. <b>Fond "Rouge":</b> La page <em>ne peut pas</em> être visualisée dans cette langue et vous verrez un message d'erreur si vous essayez. Les menus devraient filtrer automatiquement les liens vers les pages avec cette traduction. <b>Gris (non disponible pour la langue par défaut):</b> La page va hériter du mode d'héritage de contenu spécifié. Cela dépend de la configuration. (sys_language_mode = content_fallback est recommandé pour les héritage les plus flexibles, sys_language_mode = strict va empêcher cela et afficher une erreur à la place !). <b>Les "paramètres de localisation" des pages:</b> Il s'agit des paramètres de localisation de la page déterminant les modes décrits plus haut. Dans la colonne de la traduction par défaut, chacun de ces paramètres est représenté par un "N" (Masquer la page si aucune traduction pour la langue actuelle existe) ou un «D» (Masquer la traduction par défaut de la page). Comme vous pouvez le voir la page "Démarrage" a la lettre N et par conséquent, tout accès à la version allemande de cette page sera bloqué avec un message d'erreur car il n'y a pas de traduction en allemand. Par défaut «l'accès allemand" à une page non traduite va juste vous montrer le contenu en anglais. Il y a aussi une page avec la lettre D (la page "[Dummy]»). Le drapeau D signifie que la page est uniquement disponible dans l'une des traductions, dans ce cas danois. Ainsi, toute tentative d'accès à la page dans la langue par défaut ou de l'allemand affichera un message d'erreur. Ainsi, lorsque les cases à cocher de «paramètres de localisation" d'une page sont utilisées, vous obtiendrez un message d'erreur lorsque vous essaierez de demander une page qui a été bloquée. C'est une caractéristique. L'astuce est de ne pas créer des liens vers ces pages. Les menus générés à partir d'objets HMENU prendront toujours en compte le paramètre "sys_language" et afficheront uniquement les pages qui peuvent être consultées pour une langue. Mais combiné avec le "paramètres de localisation» des pages qui peut bloquer l'accès aux pages cela devient un problème avec les pages qui <em>ne sont pas </ em> traduites (a fond gris); Vous pouvez alors obtenir des menus avec des liens vers des pages non accessibles. Le problème est essentiellement dû au fait que «&L=xx" est différent de "sys_language". Afin d'éviter cela, vous devez configurer "sys_language_mode" à "content_fallback". Si vous faites cela, sys_language va <em>toujours</em> suivre ce que "& L =" lui indique et vos menus seront corrects. Dans le même temps, vous obtiendrez le contenu affiché par défaut si aucune traduction n'existe (car la sélection du contenu s'hérite). Enfin, le nombre trouvé dans chaque colonne vous indique combien d'éléments de contenu sont trouvés dans la langue spécifiée.
ru: В кратком обзоре используются цвета как сигнал, о пригодности или непригодности данной страницы. Вот расшифровка по каждому цвету: <b>Зеленый фон:</b> Страница переведена и просматриваема на этом языке. Для переводов это означает, что присутствует перекрывающая запись активной страницы. <b>Красный фон:</b> Страницу <em>нельзя</em> просмотреть на данном языке, и Вы увидите сообщение об ошибке, если попытаетесь это сделать. Меню должны автоматически отфильтровать ссылки на страницы с таким переводом. <b>Серый фон (не доступно для языка по умолчанию):</b> Страница перейдет на содержимое, указанное в режиме восстановления для содержимого. Зависит от конфигурации. (sys_language_mode = content_fallback рекомендуется для самой гибкой системы восстановления, sys_language_mode = strict предотвратит вывод и выдаст вместо этого ошибку!) <b>Страницы "Настройки локализации:"</b> Это "Настройки локализации" записи страницы, определяющие следующие режимы. В колонке перевода по умолчанию, каждая из настроек представлена как "N" (Спрятать страницу, если не существует перевода на данный язык) или "D" (Спрятать перевод по умолчанию для страницы). Как видите, страница "Startpage" имеет флаг N, ввиду чего любое обращение к немецкой версии этой страницы запрещено и приведет к сообщению об ошибке, потому что у нее нет перевода на немецкий. По умолчанию, "доступ на немецком" к непереведенной странице приведет всего лишь к выводу английского содержимого. Имеется также страница с флагом D ("[Dummy]" Фиктивный). Флаг D означает, что страница доступна лишь в одном переводе, в этом случае – датском. Так любая попытка обращения к странице на языке по умолчанию или немецком, приведет к сообщению об ошибке. Так, используя переключатели "Настройки локализации", Вы получите сообщение об ошибке при запросе заблокированной страницы. Это опция. Уловка для невозможности создания ссылок на эти страницы. Меню, сформированные объектами HMENU, всегда будут принимать во внимание "sys_language" и отображать только те страницы, которые могут быть вызваны для данного языка. Но совместно с "Настройкой локализации" страниц, которая может блокировать доступ к странице, это становится проблемой для <em>не</em> переведенных страниц (имеют серый фон); могут появиться пункты меню, связанные с недоступными страницами. Проблема в основном состоит в том, что "&L=xx" отличается от внутреннего "sys_language". Нужно избегать этого и попытаться настроить "sys_language_mode" в "content_fallback". Если sys_language <em>всегда</em> будет таким же, как и в инструкции "&L=", то ошибок в меню не будет. Одновременно Вы получите содержимое по умолчанию, отображаемое при отсутствии перевода (потому что выбор содержимого снижает скорость передачи данных). Наконец, число, в каждом столбце, говорит Вам, сколько элементов содержимого найдено на указанном языке.

# lang.image_descr
source: Localization overview in the Web>Info module. Use the buttons to edit, view and create new page translation headers. Use the regular page module to put localized content on the pages. The "Localization settings" that affect availability of pages in the various languages.
fr: Aperçu de la localisation dans le module Web>Info. Utilisez les boutons pour éditer, voir et créer de nouvelles en-têtes de traduction. Utilisez le module standard "Page" pour ajouter du contenu localisés sur vos pages. Les paramètres de localisation affectent la disponibilité des pages dans les différentes langues.
ru: Обзор локализации в модуле Веб>Инфо. Пользуйтесь кнопками для редактирования, просмотра и создания новых переводов заголовков страниц. Используйте обычные модули страниц, для добавления перевода содержимого на страницы. "Параметры локализации" сообщат о пригодности страниц на различных языках.

# pagetree_overview.alttitle
source: Pagetree Overview
fr: Arborescence (vue d'ensemble)
ru: Обзор дерева страниц

# pagetree_overview.description
source: The Pagetree Overview shows information related to pages for a branch of the page tree. This includes start- and stop-times, cache settings etc.
fr: La vue de l'arborescence montre des informations en relation avec les pages pour une branche de l'arbre. Ceci inclut le nombre d'enregistrement, des paramètres de page comme l'alias, période de visibilité, paramètre du cache etc.
ru: Обзор дерева страниц отображает информацию о страницах данной части дерева. Эта информация включает время начала и конца показа, настройка кеша ит.д.

# pagetree_overview.image_descr
source: One of the features of the Pagetree Overview module is that you can see what types of records are found on pages in a branch. Here record counts are shown for a page tree branch 2 levels down.
fr: L'une des caractéristiques du module arborescence est que vous pouvez voir quels types d'enregistrements sont présents sur les pages d'une branche. Voyez ici le nombre d'enregistrements pour une branche d'arborescence de 2 niveaux inférieurs.
ru: Одна из функций обзора дерева страниц &mdash; это отображение типов записей, находящихся на страницах. Дерево включает два подуровня пронумерованных записей.

# stat.alttitle
source: Page Hit statistics
fr: Statistiques de fréquentation
ru: Статистика посещений страницы

# stat.description
source: Displays website hit statistics for a branch of the page tree. Based on the simple, internal MySQL statistics table which records page impressions and sessions only.
fr: Affiche les statistiques de touches (hits) pour chaque branche de l'arborescence. Basée uniquement sur les simples statistiques MySQL internes des enregistrements de page et de session.
ru: Отображает статистику посещений сайта выбранной ветки дерева страниц. Основано на простой, внутренней таблице БД MySQL. Записываются только форма обращения к странице и длительность пребывания на ней.
