Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/cms/*.locallang_tca.xlf
Languages: fr, it

source: Backend Layout
fr: Mise en page backend
it: Layout Backend

# backend_layout.config
source: Config
fr: Configuration
it: Configurazione

# backend_layout.icon
source: Icon
fr: Icône
it: Icona

# backend_layout.title
source: Title
fr: Titre
it: Titolo

# backend_layout.wizard
source: Wizard
fr: Assistant

# fe_groups
source: Website Usergroup
fr: Groupe de membre
it: Gruppo Utenti web

# fe_groups.lockToDomain
source: Lock to Domain:
fr: Bloqué au domaine:
it: Blocca al dominio:

# fe_groups.subgroup
source: Subgroups:
fr: Sous-groupes:
it: Sottogruppi:

# fe_groups.tabs.extended
source: Extended
fr: Etendu
it: Extra

# fe_groups.title
source: Group Title:
fr: Nom de groupe:
it: Nome del Gruppo:

# fe_users
source: Website User
fr: Membre
it: Utente Web

# fe_users.lockToDomain
source: Lock to Domain:
fr: Bloqué au domaine:
it: Blocca al dominio:

# fe_users.password
source: Password:
fr: Mot de passe:

# fe_users.tabs.access
source: Access
fr: Accès
it: Accesso

# fe_users.tabs.extended
source: Extended
fr: Etendu

# fe_users.tabs.personelData
source: Personal Data
fr: Données personnelles
it: Dati personali

# fe_users.usergroup
source: Groups:
fr: Groupes:
it: Gruppi:

# fe_users.username
source: Username:
fr: Nom d'utilisateur:
it: Nome Utente:

# mod_tx_cms_webinfo_lang
source: Localization Overview
fr: Localisation (vue d'ensemble)
it: Traduzioni

# mod_tx_cms_webinfo_page
source: Pagetree Overview
fr: Arborescence (vue d'ensemble)
it: Albero delle pagine

# pages.abstract
source: Abstract:
fr: Résumé :

# pages.abstract_formlabel
source: Abstract
fr: Résumé
it: Utilizzato internamente per teaser e menu

# pages.alias_formlabel
source: URL Alias
fr: Alias d'URL

# pages.author_email_formlabel
source: Author Email
fr: Email de l'auteur
it: Email autore

# pages.author_formlabel
source: Author Name
fr: Nom de l'auteur
it: Nome autore

# pages.backend_layout.default
source: Default
fr: Par défaut
it: Predefinito

# pages.backend_layout_formlabel
source: Backend Layout (this page only)
fr: Mise en page backend (cette page uniquement)
it: Layout Backend (solo questa pagina)

# pages.backend_layout_next_level_formlabel
source: Backend Layout (subpages of this page)
fr: Mise en page backend (sous-pages de cette page)
it: Layout Backend (sottopagine di questa)

# pages.backend_layout.none
source: None
fr: Aucune
it: Nessuno

# pages.cache_tags
source: Cache Tags:
fr: Tags pour le cache :
it: Tag cache:

# pages.cache_timeout
source: Cache Expires:
fr: Expiration du cache :
it: Scadenza Cache:

# pages.cache_timeout_formlabel
source: Cache Lifetime
fr: Durée de vie du cache
it: Durata Cache

# pages.cache_timeout.I.10
source: 1 month
fr: 1 mois
it: 1 mese

# pages.cache_timeout.I.5
source: 1 hour
fr: 1 heure
it: 1 ora

# pages.cache_timeout.I.6
source: 4 hours
fr: 4 heures
it: 4 ore

# pages.cache_timeout.I.7
source: 1 day
fr: 1 jour
it: 1 giorno

# pages.cache_timeout.I.8
source: 2 days
fr: 2 jours
it: 2 giorni

# pages.cache_timeout.I.9
source: 7 days
fr: 7 jours
it: 7 giorni

# pages.content_from_pid
source: Show content from this page instead:
fr: Afficher le contenu de cette page à la place :
it: Mostra il contenuto di questa pagina:

# pages.content_from_pid_formlabel
source: Show Content from Page
fr: Afficher le contenu de la page
it: Con il contenuto della pagina selezionata

# pages.doktype.div.link
source: Link
fr: Lien

# pages.doktype.div.special
source: Special
fr: Spécial
it: Speciale

# pages.doktype.I.0
source: Advanced
fr: Avancé
it: Avanzato

# pages.doktype.I.2
source: Shortcut
fr: Raccourci

# pages.doktype.I.3
source: Not in Menu
fr: Hors menu
it: Non presente nei Menu

# pages.doktype.I.4
source: Backend User Section
fr: Section utilisateur backend

# pages.doktype.I.5
source: Mount Point
fr: Point de montage

# pages.doktype.I.7
source: Menu Separator
fr: Séparateur de menu
it: Separatore nel menu

# pages.doktype.I.8
source: Link to External URL
fr: Lien vers une URL externe
it: Link a URL esterna

# pages.editlock_formlabel
source: Editable for Admins Only
fr: Editable par les administrateurs uniquement
it: Editabile solo da Admin

# pages.endtime_formlabel
source: Expiration Date
fr: Date de fin de publication
it: Data di depubblicazione

# pages.extendToSubpages
source: Include Subpages:
fr: Inclure les sous-pages:
it: Includi Sottopagine:

# pages.extendToSubpages_formlabel
source: Extend to Subpages
fr: Étendre les droits aux sous-pages
it: Estendi alle Sottopagine

# pages.fe_group_formlabel
source: Usergroup Access Rights
fr: Droits d'accès par groupe d'utilisateurs
it: Permessi Gruppi Utente

# pages.fe_login_mode
source: Login Mode:
fr: Mode de connexion:
it: Modalità Login:

# pages.fe_login_mode.disable
source: Disable
fr: Désactiver
it: Disabilita

# pages.fe_login_mode.disableAll
source: Disable login
fr: Désactiver les connexions
it: Disabilita Login

# pages.fe_login_mode.disableGroups
source: Enable user login, Disable usergroup login
fr: Activer les connexions par utilisateur, désactiver les connexions par groupe d'utilisateurs
it: Abilita login utente, Disabilita Gruppi utenti

# pages.fe_login_mode.enable
source: Enable login
fr: Activer les connexions
it: Abilita Login

# pages.fe_login_mode.enableAgain
source: Re-Enable login
fr: Activer les connexions à nouveau
it: Riabilita i logins

# pages.fe_login_mode_formlabel
source: Login Behaviour
fr: Comportement des connexions d'utilisateur
it: Comportamento Login

# pages.hidden
source: Hide page:
fr: Cacher la page:
it: Nascondi pagina:

# pages.hidden_checkbox_1_formlabel
source: Disable
fr: Désactiver
it: Disabilita

# pages.is_siteroot
source: Is Root of Website:
fr: Est la racine du site:
it: E' radice del sito web:

# pages.is_siteroot_formlabel
source: Use as Root Page
fr: Utiliser comme page racine
it: Usa come Pagina Radice del sito

# pages.keywords_formlabel
source: Keywords
fr: Mots-clés
it: Keywords (SEO)

# pages.l18n_cfg
source: Localization Settings:
fr: Paramètres de localisation:
it: Configurazione traduzioni:

# pages.l18n_cfg_formlabel
source: Localization
fr: Localisation
it: Traduzione

# pages.l18n_cfg.I.1
source: Hide default translation of page
fr: Cacher la traduction par défaut
it: Nascondi la traduzione di default della pagina

# pages.l18n_cfg.I.2
source: Hide page if no translation for current language exists
fr: Cacher la page si elle n'est pas traduite
it: Nascondi la pagina se non esiste traduzione nella lingua corrente

# pages.l18n_cfg.I.2a
source: Show page even if no translation exists
fr: Afficher les pages même non traduites
it: Mostra la pagina anche se non ne esiste la traduzione nella lingua corrente

# pages_language_overlay
source: Alternative Page Language
fr: Langue alternative de la page
it: Lingua alternativa

# pages.lastUpdated
source: Last Updated:
fr: Dernière mise à jour :
it: Ultimo aggiornamento:

# pages.lastUpdated_formlabel
source: Last Update
fr: Dernière mise à jour
it: Ultimo aggiornamento

# pages.layout_formlabel
source: Frontend Layout
fr: Mise en page frontend
it: Layout Frontend

# pages.layout.I.1
source: Layout 1
fr: Disposition 1

# pages.layout.I.2
source: Layout 2
fr: Disposition 2

# pages.layout.I.3
source: Layout 3
fr: Disposition 3

# pages.media
source: Files:
fr: Fichiers:

# pages.media_formlabel
source: Media
fr: Média
it: Allegati a questa pagina

# pages.module
source: Contains Plugin:
fr: Contient le plugin:
it: Contiene il plugin:

# pages.module_formlabel
source: Contains Plugin
fr: Contient le plugin
it: Plugin selezionato

# pages.module.I.1
source: Shop
fr: Magasin

# pages.module.I.2
source: Board
fr: Forum
it: Forum

# pages.module.I.4
source: Website Users
fr: Membres
it: Utenti Web

# pages.module.I.6
source: Approvals
fr: Approbations

# pages.mount_pid
source: Mount Point (advanced):
fr: Point de montage (avancé) :
it: Mount Point (avanzato):

# pages.mount_pid_formlabel
source: Mounted page
fr: Page montée

# pages.mount_pid_ol
source: Substitute Mount Point (this page) with Mounted page:
fr: Substituer le point de montage (cette page) avec une page montée :
it: Sostituisci Mount Point (questa pagina) con la pagina:

# pages.mount_pid_ol_formlabel
source: Show Content from
fr: Afficher le contenu de
it: Mostra contenuto di

# pages.mount_pid_ol.I.0
source: This Page
fr: Cette page
it: Questa pagina

# pages.mount_pid_ol.I.1
source: Mounted Page
fr: La page montée
it: Pagina montata

# pages.nav_hide
source: Hide in Menu:
fr: Hors menu :
it: Nascondi nei menù

# pages.nav_hide_checkbox_1_formlabel
source: Hide
fr: Cacher
it: Nascondi

# pages.nav_hide_formlabel
source: In Menus
fr: Dans les menus
it: Nei menu

# pages.nav_title
source: Navigation Title:
fr: Titre de navigation :
it: Titolo di Navigazione

# pages.nav_title_formlabel
source: Alternative Navigation Title
fr: Titre de navigation alternatif
it: Titolo di navigazione alternativo

# pages.newUntil
source: 'New' Until:
fr: 'Nouveau' jusqu'à :
it: 'Nuovo' fino a:

# pages.newUntil_formlabel
source: Mark as 'New' Until
fr: Marquer comme étant "Nouveau" jusqu'à
it: Contrassegna come 'Nuovo' fino al

# pages.no_cache
source: No Cache:
fr: Sans cache :

# pages.no_cache_checkbox_1_formlabel
source: Disable
fr: Désactiver
it: Disabilita

# pages.no_search
source: No Search:
fr: Sans recherche :
it: No Ricerca:

# pages.no_search_checkbox_1_formlabel
source: Disable
fr: Désactiver
it: Disabilita

# pages.no_search_formlabel
source: Include in Search
fr: Inclure dans les résultats de recherche
it: Includi nella Ricerca

# pages.palettes.abstract
source: Abstract
fr: Résumé

# pages.palettes.access
source: Publish Dates and Access Rights
fr: Dates de publication et droits d'accès
it: Accesso e permessi

# pages.palettes.caching
source: Caching
fr: Mise en cache
it: Cache

# pages.palettes.config
source: TypoScript Configuration
fr: Configuration TypoScript
it: Configurazione TypoScript

# pages.palettes.editorial
source: Editorial
fr: Éditorial
it: Editori

# pages.palettes.language
source: Language
fr: Langue
it: Lingua

# pages.palettes.layout
source: Page Layout
fr: Mise en page
it: Layout Pagina

# pages.palettes.links
source: Links to this Page
fr: Liens vers cette page
it: Links a questa pagina

# pages.palettes.media
source: Files
fr: Fichiers

# pages.palettes.metatags
source: Meta Tags
fr: Métadonnées

# pages.palettes.miscellaneous
source: Miscellaneous
fr: Divers
it: Altro

# pages.palettes.module
source: Use as Container
fr: Utilisé comme conteneur
it: Usa come Contenitore per

# pages.palettes.replace
source: Replace Content
fr: Remplacer le contenu
it: Sostituisci Contenuto

# pages.palettes.storage
source: General Record Storage Page
fr: Page de stockage des enregistrements généraux

# pages.palettes.title
source: Title
fr: Titre
it: Titolo

# pages.palettes.visibility
source: Visibility
fr: Visibilité
it: Visibilità

# pages.php_tree_stop_formlabel
source: Stop Page Tree
fr: Arrêter l'arborescence des pages
it: Interrompi Albero Pagine

# pages.shortcut_formlabel
source: Shortcut Target
fr: Cible du raccourci
it: Destinazione dello shortcut

# pages.shortcut_mode
source: Shortcut Mode:
fr: Mode raccourci :
it: Tipo di Shortcut:

# pages.shortcut_mode_formlabel
source: Shortcut Mode
fr: Mode de raccourci
it: Tipo di Shortcut

# pages.shortcut_mode.I.0
source: Selected page
fr: Page sélectionnée
it: Pagina selezionata

# pages.shortcut_mode.I.1
source: First subpage of selected/current page
fr: Première sous-page
it: Prima sottopagina

# pages.shortcut_mode.I.2
source: Random subpage of selected/current page
fr: Sous-page aléatoire
it: Una sottopagina a caso

# pages.shortcut_mode.I.3
source: Parent page of current page
fr: Page parent de la page courante
it: Pagina superiore

# pages.starttime_formlabel
source: Publish Date
fr: Date de début de publication
it: Data di pubblicazione

# pages.subtitle
source: Subtitle:
fr: Sous-titre :
it: Sottotitolo:

# pages.subtitle_formlabel
source: Subtitle
fr: Sous-titre
it: Sottotitolo

# pages.tabs.access
source: Access
fr: Accès
it: Accesso

# pages.tabs.appearance
source: Appearance
fr: Apparence
it: Stile

# pages.tabs.behaviour
source: Behaviour
fr: Comportement
it: Comportamento

# pages.tabs.extended
source: Extended
fr: Etendu

# pages.tabs.files
source: Resources
fr: Ressources
it: Risorse

# pages.tabs.metadata
source: Metadata
fr: Métadonnées

# pages.tabs.mount
source: Mount
fr: Point de montage

# pages.tabs.resources
source: Resources
fr: Ressources
it: Risorse

# pages.tabs.shortcut
source: Shortcut
fr: Raccourci

# pages.target
source: Target:
fr: Cible :

# pages.target_formlabel
source: Link Target
fr: Cible des liens
it: Apri con queste configurazioni

# pages.title_formlabel
source: Page Title
fr: Titre de la page
it: Titolo Pagina

# pages.TSconfig_formlabel
source: Page TSConfig
fr: TSConfig de la page
it: TSconfig

# pages.url_scheme
source: Enforce Protocol:
fr: Forcer le protocole :
it: Enforce Protocollo:

# pages.url_scheme_formlabel
source: Use Protocol
fr: Utiliser le protocole
it: Usa Protocollo

# pages.urltype_formlabel
source: Protocol
fr: Protocole
it: Protocollo

# sys_domain
source: Domain
fr: Domaine
it: Dominio

# sys_domain.domainName
source: Domain:
fr: Domaine:
it: Dominio:

# sys_domain.forced
source: Always prepend this domain in links:
fr: Toujours préfixer ce domaine dans les liens :
it: Aggiungi sempre questo dominio nel links:

# sys_domain.prepend_params
source: Transfer parameters to Redirect URL:
fr: Transférer les paramètres vers l'URL:
it: Trasferisci i parametri all'URL:

# sys_domain.redirectHttpStatusCode
source: HTTP Status Code for the Redirect:
fr: Code de statut HTTP pour la redirection:
it: HTTP Status Code del Redirect:

# sys_domain.redirectHttpStatusCode.301
source: Moved permanently (301)
fr: Déplacé de façon permanente (301)
it: Spostato permanentemente (301)

# sys_domain.redirectHttpStatusCode.302
source: Found (302)
fr: Déplacé de façon temporaire (302)
it: Trovato (302)

# sys_domain.redirectHttpStatusCode.303
source: See Other (303)
fr: Autre (303)
it: Guarda altro (303)

# sys_domain.redirectHttpStatusCode.307
source: Moved Temporarily (307)
fr: Redirection temporaire (307)
it: Spostato temporaneamente (307)

# sys_domain.redirectTo
source: Redirect to:
fr: Rediriger vers:
it: Reindirizza a:

# sys_template
source: Template
fr: Gabarit

# sys_template.basedOn
source: Include Basis Template:
fr: Inclure les gabarits de base:
it: Includi template di base:

# sys_template.basedOn_add
source: Add New Basis Template
fr: Ajouter un nouveau gabarit de base
it: Aggiungi nuovo template di base

# sys_template.clear
source: Clear:
fr: Effacer:
it: Pulisci:

# sys_template.config
source: Setup:
fr: Configuration (setup):

# sys_template.constants
source: Constants:
fr: Constantes:
it: Costanti:

# sys_template.editorcfg
source: Backend Editor Configuration:
fr: Configuration de l'éditeur backend:
it: Configurazione Editor Backend:

# sys_template.includeStaticAfterBasedOn
source: Include Static Templates After Basis Templates:
fr: Inclure les gabarits statiques après les gabarits de base:
it: Includi static DOPO basedOn:

# sys_template.include_static_file
source: Include static (from extensions):
fr: Inclure les gabarits statiques des extensions:
it: Includi static (dalle estensioni):

# sys_template.nextLevel
source: Template on Next Level:
fr: Gabarit au prochain niveau:
it: Template del prossimo livello:

# sys_template.resources
source: Resources:
fr: Ressources:
it: Risorse:

# sys_template.root
source: Rootlevel:
fr: Racine du site :

# sys_template.sitetitle
source: Website Title:
fr: Titre du site:
it: Titolo Sito Web:

# sys_template.static_file_mode
source: Static Template Files from TYPO3 Extensions:
fr: Fichiers des gabarits statiques des extensions:
it: Files Template Statici dalle estensioni TYPO3

# sys_template.static_file_mode.0
source: Default (include before if root flag is set)
fr: Par défaut (inclure avant si la racine du site est cochée)
it: Predefinito (Incluso prima se il Root-flag è selezionato)

# sys_template.static_file_mode.1
source: Always include before this template record
fr: Toujours inclure avant ce gabarit
it: Includi sempre prima di questo record di template

# sys_template.static_file_mode.2
source: Never include before this template record
fr: Ne jamais inclure avant ce gabarit
it: Mai includere prima di questo record di template

# sys_template.static_file_mode.3
source: Include before all static templates if root flag is set
fr: Inclure avant tous les gabarits statiques si la propriété racine est définie
it: Includi prima di tutti i template statici se è impostato il "root flag"

# sys_template.tabs.access
source: Access
fr: Accès
it: Accesso

# sys_template.tabs.files
source: Resources
fr: Ressources
it: Risorse

# sys_template.tabs.include
source: Includes
fr: Inclusions
it: Includi

# sys_template.title
source: Template Title:
fr: Titre du gabarit
it: Nome template:

# tt_content
source: Page Content
fr: Contenu de la page
it: Contenuto Pagina

# backend_layout.description
source: Description
it: Descrizione

# fe_groups.tabs.options
source: Options
it: Opzioni

# fe_users.tabs.options
source: Options
it: Opzioni

# pages.description_formlabel
source: Description
it: Descrizione (SEO)

# pages.doktype.div.page
source: Page
it: Pagina

# pages.doktype_formlabel
source: Type
it: Tipo

# pages.hidden_formlabel
source: Page
it: Pagina

# pages.palettes.standard
source: Page
it: Pagina

# pages.storage_pid_formlabel
source: Page
it: Pagina

# pages.tabs.options
source: Options
it: Opzioni

# sys_template.description
source: Description:
it: Descrizione:

# sys_template.tabs.options
source: Options
it: Opzioni
