Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/res/accessibilityicons/*.locallang.xlf
Languages: ru

# download_altText
source: Initiates file download
ru: Начинается скачивание файла

# download_titleText
source: Initiates file download
ru: Начинается скачивание файла

# external_link_altText
source: Opens external link in current window
ru: Внешняя ссылка открывается в текущем окне

# external_link_new_window_altText
source: Opens external link in new window
ru: Внешняя ссылка открывается в новом окне

# external_link_new_window_titleText
source: Opens external link in new window
ru: Внешняя ссылка открывается в новом окне

# external_link_titleText
source: Opens external link in current window
ru: Внешняя ссылка открывается в текущем окне

# internal_link_altText
source: Opens internal link in current window
ru: Внутренняя ссылка открывается в текущем окне

# internal_link_new_window_altText
source: Opens internal link in new window
ru: Внутренняя ссылка открывается в новом окне

# internal_link_new_window_titleText
source: Opens internal link in new window
ru: Внутренняя ссылка открывается в новом окне

# internal_link_titleText
source: Opens internal link in current window
ru: Внутренняя ссылка открывается в текущем окне

# mail_altText
source: Opens window for sending email
ru: Открывается окно почтовой программы для отправки email

# mail_titleText
source: Opens window for sending email
ru: Открывается окно почтовой программы для отправки email
