Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/*.locallang_msg.xlf
Languages: it, ru

# ActiveX-required
source: Loading the editor in Internet Explorer requires the execution of ActiveX controls to be enabled.
it: Il caricamento dell'editor in Internet Explorer richiede l'abilitazione all'esecuzione dei controlli ActiveX.
ru: Для загрузки редактора в Internet Explorer необходимо, чтобы выполнение компонентов ActiveX было разрешено.

# Allow-Clipboard-Helper-Extension
source: For security reasons, unprivileged applications cannot access the clipboard. Click YES to install a component that will enable you to specify the sites or pages that will be allowed to access the clipboard and perform copy, cut and paste operations.
it: Per motivi di sicurezza, le applicazioni senza permessi non possono accedere al clipboard. Premi OK per installare un componente che permetterà di indicari i siti o le pagine che avranno i permessi per accedere al clipboard ed eseguire le operazioni di copia, taglia e incolla.
ru: Из соображений безопасности, непривилегированные приложения не могут использовать буфер обмена. Нажмите ДА, чтобы установить компонент, позволяющий указать сайты или страницы, которым будет разрешён доступ к буферу обмена для операций копирования, вырезания и вставки.

# Allow-Clipboard-Helper-Extension-Success
source: The installation was successful. You need to exit and restart your browser for the change to take effect. Afterwards, use the AllowClipboard Helper from the tools menu to allow specific sites to use the clipboard.
it: L'installazione è riuscita. Devi uscire e rilanciare il browser per dare effetto alle modifiche. Quindi usa AllowClipboard Helper dagli strumenti per abilitare siti specifici all'uso della clipboard.
ru: Установка успешно завершена. Для того, чтобы изменения вступили в силу Вам необходимо перезагрузить браузер. После этого используйте помощник подключения буфера обмена (AllowClipboard Helper) из меню инструментов, для указания сайтов, которым будет разрешён доступ к буферу обмена.

# HTML-document-not-well-formed
source: The HTML document is not well-formed.
it: Il documento HTML non è ben scritto.
ru: HTML документ содержит ошибки (нарушены требования well-formed).

# Moz-Clipboard
source: Unprivileged scripts cannot access Cut/Copy/Paste programatically for security reasons. Click YES to see a technical note at mozilla.org which shows you how to allow a script to access the clipboard.
it: Scripts senza l'autorizzazione non possono utilizzare le funzioni Taglia/Copia/Incolla. Clicca OK per visualizzare una nota tecnica in mozilla.org che ti mostrerà come permettere ad uno script di accedere alla clipboard.
ru: Обычные (непривелигированые) скрипты не могут работать с буфером обмена (выполнять копирование/вырезку/вставку) из-за запретов системы безопасности броузера. Нажмите ДА, чтобы узнать (на английском языке) как включить использование буфера обмена.

# Moz-Extension
source: For security reasons, unprivileged applications cannot access the clipboard. Click YES to install a component that will enable applications from this site to access the clipboard and perform copy, cut and paste operations.
it: Per motivi di sicurezza, le applicazioni senza permessi non possono accedere al 'clipboard'. Scegli OK per installare un componente che permetterà all'applicazioni di questo sito di accedere alla 'clipboard' e permettere le operazioni di copia, taglio e incolla.
ru: Из соображений безопасности, непривилегированные приложения не могут использовать буфер обмена. Нажмите ДА, чтобы установить компонент, позволяющий приложениям с этого сайта использовать буфер обмена для операций копирования, вырезания и вставки.

# Moz-Extension-Failure
source: Sorry, Firefox Add-on AllowClipboard Helper could not be installed.
it: Spiacenti, ma l'installazione non è andata a buon fine.
ru: Извините, невозможно установить дополнение для Firefox, AllowClipboard Helper

# Moz-Extension-Install-Not-Enabled
source: The installation cannot be performed. Please change your browser preferences in order to allow installation of sofware from this site.
it: L'installazione non può essere eseguita. E' necessario cambiare le impostazioni del browser per permettere l'installazione da questo sito.
ru: Невозможно провести установку. Пожалуйста, измените настройки вашего браузера, чтобы разрешить установку программного обеспечения с этого сайта.

# Moz-Extension-Success
source: The installation was successful. You need to exit and restart your browser for the change to take effect.
it: L'installazione è riuscita. Devi uscire e rilanciare il browser per dare effetto alle modifiche.
ru: Установка успешно завершена. Для того, чтобы изменения вступили в силу Вам необходимо перезагрузить браузер.

# Mozilla-Org-Install-Not-Enabled
source: The installation cannot be performed. Please change your browser preferences in order to allow installation of sofware from https://addons.mozilla.org.
it: L'installazione non può essere eseguita. E' necessario cambiare le impostazioni del browser per permettere l'installazione di software da http://ftp.mozilla.org.
ru: Невозможно провести установку. Пожалуйста, измените настройки вашего браузера, чтобы разрешить установку программного обеспечения с https://addons.mozilla.org.

source: Path
it: Percorso
ru: Путь
