Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/TYPO3Browsers/*.locallang.xlf
Languages: fr, it, ru

# download_altText
source: Initiates file download
fr: Démarre le téléchargement du fichier
it: Inizia download del file
ru: Начнется загрузка файла

# download_titleText
source: Initiates file download
fr: Démarre le téléchargement du fichier
it: Inizia download del file
ru: Начнется загрузка файла

# external_link_altText
source: Opens external link in current window
fr: Ouvre ce lien externe dans la fenêtre courante
it: Apri link esterno nell'attuale finestra
ru: Внешняя ссылка откроется в текущем окне

# external_link_new_window_altText
source: Opens external link in new window
fr: Ouvre ce lien externe dans une nouvelle fenêtre
it: Apri link esterno in nuova finestra
ru: Внешняя ссылка откроется в новом окне

# external_link_new_window_titleText
source: Opens external link in new window
fr: Ouvre ce lien externe dans une nouvelle fenêtre
it: Apri link esterno in nuova finestra
ru: Внешняя ссылка откроется в новом окне

# external_link_titleText
source: Opens external link in current window
fr: Ouvre ce lien externe dans la fenêtre courante
it: Apri link esterno nell'attuale finestra
ru: Внешняя ссылка откроется в текущем окне

# internal_link_altText
source: Opens internal link in current window
fr: Ouvre ce lien interne dans la fenêtre courante
it: Apri link interno nell'attuale finestra
ru: Внутренняя ссылка откроется в текущем окне

# internal_link_new_window_altText
source: Opens internal link in new window
fr: Ouvre ce lien interne dans une nouvelle fenêtre
it: Apri link interno in nuova finestra
ru: Внутренняя ссылка откроется в новом окне

# internal_link_new_window_titleText
source: Opens internal link in new window
fr: Ouvre ce lien interne dans une nouvelle fenêtre
it: Apri link interno in nuova finestra
ru: Внутренняя ссылка откроется в новом окне

# internal_link_titleText
source: Opens internal link in current window
fr: Ouvre ce lien interne dans la fenêtre courante
it: Apri link interno nell'attuale finestra
ru: Внутренняя ссылка откроется в текущем окне

# mail_altText
source: Opens window for sending email
fr: Ouvre une fenêtre d'envoi de courrier électronique
it: Apri nuova finestra per inviare email
ru: Откроется окно для создания электронного письма

# mail_titleText
source: Opens window for sending email
fr: Ouvre une fenêtre d'envoi de courrier électronique
it: Apri nuova finestra per inviare email
ru: Откроется окно для создания электронного письма
