Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/htmlarea/plugins/PlainText/*.locallang.xlf
Languages: ru

# Access-to-clipboard-denied
source: Content could not be pasted as plain text because permission to access the clipboard was denied.
ru: Содержимое в виде обычного текста не может быть вставлено, так как доступ к буферу обмена запрещен.

# disablepasteFormat
source: Disable paste structure and basic format
ru: Запретить вставлять структуру и основное форматирование

# disablepasteStructure
source: Disable paste structure only
ru: Запретить вставлять лишь структуру

# disableplainText
source: Disable paste as plain text
ru: Запретить вставлять обычный текст

# enablepasteFormat
source: Enable paste structure and basic format
ru: Разрешить вставлять структуру и основное форматирование

# enablepasteStructure
source: Enable paste structure only
ru: Разрешить вставлять лишь структуру

# enableplainText
source: Enable paste as plain text
ru: Разрешить вставлять обычный текст

source: Paste as plain text
ru: Вставить как обычный текст

# PasteBehaviourTooltip
source: Select alternate paste behaviour
ru: Выбор альтернативного события вставки

# pasteFormat
source: Paste structure and basic format
ru: Вставить структуру и основное форматирование

# pasteInPastingPad
source: Paste the content into this pasting pad and click OK.
ru: Вставьте содержимое в этот карман и нажмите OK/

# pasteStructure
source: Paste structure only
ru: Вставить только структуру

# PasteToggleTooltip
source: Toggle paste behaviour
ru: Переключатель события вставки

# plainText
source: Paste as plain text
ru: Вставить как обычный текст

# rteCleanPasteBehaviour
source: Clean paste behaviour
ru: Сбросить поведение при вставке
