Repository: trendtecug/uwesfrisurenstudio
Catalog: htdocs/typo3conf/l10n/*/rtehtmlarea/extensions/Language/*.locallang_csh.xlf
Languages: ru

# .alttitle
source: htmlArea RTE > Language
ru: htmlArea RTE > Язык

# .description
source: The Language feature allows to edit the language and text direction attributes of an element in the RTE editing area.
ru: Языковой функционал позволяет редактировать атрибуты элемента language и text direction в области редактора.

# .details
source: The following items may appear in the RTE toolbar: - a selector box that allows to assign the language of contents of an element; - two buttons that allow to set the direction of text; - another button that allows to make the language marks visible wittin the RTE editing area. The language selector box may also appear in some dialogues along with a text direction selector box.
ru: В панели инструментов редактора могут появиться следующие атрибуты: - блок выбора языка, назначенного для содержимого элемента; - две кнопки, позволяющие задать направление текста; - другая кнопка, позволяющая сделать видимыми языковые метки в области редактирования. Блок выбора языка и направления текста, кроме того, может присутствовать в некоторых диалогах.

# directionCombo.alttitle
source: Direction of text
ru: Направление текста

# directionCombo.description
source: Select the direction of text within the contents of the element.
ru: Выберете направление текста в содержимом элемента.

# directionCombo.details
source: The text direction selector box may appear in some dialogues. The selector shows the direction of text currently set on the current element, if any. Selecting a direction sets it on the element. If a direction was already set on the element, it is replaced by the newly selected direction. Any currently set direction may be removed by selecting the "Not set" item at the top of the list of the selector box.
ru: Блок выбора направления текста может присутствовать в панеле инструментов редактора, а также в некоторых диалогах. Если для элемента назначено какое-либо направление текста, оно будет показано в блоке выбора. Выбор направления текста для содержимого элемента. Если направление текста уже было выбрано, оно будет заменено на вновь выбранное. Любое назначенное направление текста можно убрать, выбрав "Не установлено" вверху списка.

# .image_descr
source: "Left to right" icon in the editor tool bar. "Right to left" icon in the editor tool bar. "Show language marks" icon in the editor tool bar.
ru: Значок "слева направо" на панели инструментов редактора. Значок "справа налево" на панели инструментов редактора. Значок "показать языковые метки" на панели инструментов редактора.

# languageCombo.alttitle
source: Language of contents
ru: Язык содержимого

# languageCombo.description
source: Select the language of the contents of the element.
ru: Выберете язык для содержимого элемента.

# languageCombo.details
source: The language selector box may appear in the RTE toolbar and in some dialogues. The selector shows the language currently assigned to the current element, if any. Selecting a language assigns it to the element. If a language was already assigned to the element, it is replaced by the newly selected language. Any currently assigned language may be removed by selecting the "Remove language mark" item at the top of the list of the selector box.
ru: Блок выбора языка может присутствовать в панеле инструментов редактора, а также в некоторых диалогах. Если для элемента назначен какой-либо язык, он будет показан в блоке выбора. Выбор языка для содержимого элемента. Если язык уже был выбран, он будет заменен на вновь выбранный. Любой назначенный язык можно убрать, выбрав "Удалить языковые метки" вверху списка выбора языков.
